{"Course ID": "242297", "Institution": "DORAL - DORAL COLLEGE", "Course Name": "ACG 2021 - PRINCIPLES OF FINANCIAL ACCOUNTING", "Course Title": "PRINCIPLES OF FINANCIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "ACCOUNTING PRIN-(CONDENSED)(3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "09/11/2019", "Effective Date": "09/11/2019", "Discontinue Date": "", "Date SCNS Approved": "9/27/2019", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.A.", "Prerequisites": "MGF 1106 OR SATISFACTORY TEST SCORES.", "Corequisites": "NONE", "Course Description": "THIS COURSE FAMILIARIZES STUDENTS WITH THE THEORY, LOGIC, AND CONCEPTS USED IN FINANCIAL ACCOUNTING. STUDENTS WILL LEARN ABOUT JOURNALIZING, POSTING, PREPARING A TRIAL BALANCE, MAKING ADJUSTMENTS AND CORRECTIONS, AND CLOSING. STUDENTS WILL ALSO LEARN HOW TO PREPARE INCOME STATEMENTS, BALANCE SHEETS; LEARN ABOUT CHANGES IN OWNER’S EQUITY AND CASH FLOW STATEMENT. OTHER TOPICS INCLUDE CURRENT ASSETS, INVENTORY, LONG-TERM ASSETS AND LIABILITIES; CORPORATE CAPITAL STRUCTURE, RETAINED EARNINGS AND FINANCIAL STATEMENT ANALYSIS. STUDENTS LEARN ACCOUNTING PRINCIPLES AND MASTERY OF ACCOUNTING SKILLS.", "Objectives / Learning Outcome(s) / Major Topics": "STUDENTS WILL 1. DESCRIBE THE GENERAL-PURPOSE FINANCIAL STATEMENTS ACCORDING TO GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP) 2. EXPLAIN THE CONCEPT OF ACCRUAL VS. CASH BASIS ACCOUNTING 3. PRACTICE USING FINANCIAL DATA IN PREPARATION OF FINANCIAL STATEMENTS 4. IDENTIFY AND EXPLAIN PROFESSIONAL ETHIC NECESSARY IN THE ACCOUNTANT'S PROFESSIONAL ACTIVITIES. 5. APPLY INTRODUCTORY KNOWLEDGE AND CONCEPTS OF FINANCIAL STATEMENT ANALYSIS", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": "", "Credential": "ACADEMIC TRANSFER", "Credential Effective Date": "09/24/2019"}