{"Course ID": "207160", "Institution": "STU - ST. THOMAS UNIVERSITY", "Course Name": "ACG 2001 - PRINCIPLES OF ACCOUNTING I", "Course Title": "PRINCIPLES OF ACCOUNTING I", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "PRINCIPLES OF ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2014", "Effective Date": "08/01/2014", "Discontinue Date": "", "Date SCNS Approved": "5/5/2014", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "GEB 1011", "Corequisites": "NONE", "Course Description": "AN INTRODUCTION TO ACCOUNTING PRINCIPLES, PRACTICES, AND PROCEDURES; MEASURING AND REPORTING FINANCIAL POSITION AND RESULTS OF OPERATIONS FOR PROPRIETORSHIPS AND CORPORATIONS; INTERPRETATION AND RECORDING OF BUSINESS TRANSACTIONS; AND THE PREPARATION OF FINANCIAL STATEMENTS.", "Objectives / Learning Outcome(s) / Major Topics": "1.STUDENT WILL UNDERSTAND THE USES OF ACCOUNTING AS AN INFORMATION SYSTEM AND THE EQUALITY OF ASSETS AND EQUITIES, ACCOUNTING PRINCIPLES AND PRACTICES.\n2.STUDENT WILL UNDERSTAND THE FLOW OF BUSINESS TRANSACTIONS DATA AND THEIR RECORDING.\n3.STUDENT WILL UNDERSTAND THE COMPLETION OF THE ACCOUNTING CYCLE AND PREPARATION OF FINANCIAL STATEMENTS.\n4.STUDENT WILL UNDERSTAND ACCOUNTING SYSTEMS AND THE USE OF SPECIALIZED JOURNALS AND AUXILIARY LEDGERS.\n5.STUDENT WILL UNDERSTAND THE MATCHING CONCEPT, ADJUSTING ENTRIES.\n6.STUDENT WILL UNDERSTAND WORKSHEET, CLOSING ENTRIES, REVERSING ENTRIES.\n7.STUDENT WILL UNDERSTAND MANUAL AND COMPUTERIZED ACCOUNTING.\n8.STUDENT WILL UNDERSTAND PROCEDURES FOR CONTROL OF CASH, INCLUDING BANK RECONCILIATION.\n9.STUDENT WILL UNDERSTAND ACCOUNTING PROCEDURES FOR NOTES AND ACCOUNTS RECEIVABLE.\n10.STUDENT WILL UNDERSTAND IMPORTANCE OF INVENTORIES, COSTING METHODS.\n11.STUDENT WILL UNDERSTAND THE DIFFERENCE BETWEEN CAPITAL AND REVENUE EXPENDITURES, ACCOUNTING FOR PLANT ASSET ACQUISITIONS, DEPRECIATION AND DISPOSITION, AND CONCEPTS OF INTANGIBLE ASSETS.\n12.STUDENT WILL UNDERSTAND ACCOUNTING FOR LIABILITIES, NOTES PAYABLE, PAYROLL AND OTHER CURRENT LIABILITIES.\n13.STUDENT WILL UNDERSTAND CORPORATIONS, STOCKHOLDERS, ISSUING STOCK, TREASURY STOCK, ACCOUNTING FOR DIVIDENDS, AND CORPORATE INCOME TAXES, UNUSUAL ITEMS, DISCONTINUED OPERATIONS, EXTRAORDINARY ITEMS, CHANGES IN ACCOUNTING PRINCIPLES, EARNING PER COMMON SHARE, REPORTING STOCKHOLDERS EQUITY, COMPREHENSIVE INCOME.", "Textbook(s)": "MARSHALL, D.H., MCMANUS, W.W., & VIELE, D. (2011). ACCOUNTING: WHAT THE NUMBERS MEAN (9TH ED.). COLUMBUS, OH: MCGRAW-HILL EDUCATION. [ISBN:  978-0-07-352706-2].", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}