{"Course ID": "212184", "Institution": "STU - ST. THOMAS UNIVERSITY", "Course Name": "ACG 3111 - FINANCIAL ACCOUNTING II", "Course Title": "FINANCIAL ACCOUNTING II", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "INTERMEDIATE ACCOUNTING II(2 OF 2)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "10/01/2014", "Effective Date": "10/01/2014", "Discontinue Date": "", "Date SCNS Approved": "4/6/2015", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 301 OR EQUIVALENT", "Corequisites": "NONE", "Course Description": "INCOME DETERMINATION AND VALUATION PROBLEMS IN ASSET, LIABILITY, AND EQUITY ACCOUNTING; ANALYSIS AND INTERPRETATION OF ACCOUNTING DATA; CASH FLOW STATEMENTS; STATEMENTS FROM INCOMPLETE RECORDS; AND PRICE LEVEL IMPACT", "Objectives / Learning Outcome(s) / Major Topics": "UPON COMPLETION OF THIS COURSE, STUDENTS WILL BE ABLE TO:\n\n1.USE DIFFERENT DEPRECIATION METHODS TO COMPUTE ANNUAL DEPRECIATION EXPENSE, AND INCORPORATE CHANGES IN ESTIMATES INTO THE COMPUTATION\n2.ACCOUNT FOR THE PURCHASE AND THE SALE OF DEBT AND EQUITY SECURITIES, FOR THE CHANGE IN VALUE OF SECURITIES, AND FOR THE RECOGNITION OF REVENUE FROM INVESTMENTS\n3.APPLY THE LEASE CLASSIFICATION CRITERIA IN ORDER TO DISTINGUISH BETWEEN CAPITAL AND OPERATING LEASES, AND PROPERLY ACCOUNT FOR BOTH CAPITAL AND OPERATING LEASES FROM THE STANDPOINT OF THE LESSOR (ASSET OWNER)\n4.UNDERSTAND THE CONCEPT OF DEFERRED TAXES AND COMPUTE THE AMOUNT OF DEFERRED TAX LIABILITIES AND ASSETS; PROVISIONS OF TAX LOSS CARRYBACKS AND CARRY FORWARDS AND BE ABLE TO ACCOUNT FOR THESE PROVISIONS; DETERMINE APPROPRIATE FINANCIAL STATEMENT PRESENTATION AND DISCLOSURE ASSOCIATED WITH DEFERRED TAX ASSETS AND LIABILITIES\n5.ACCOUNT FOR PAYROLL AND PAYROLL TAXES AND PERFORMANCE BONUSES; EMPLOYER PENSION PLANS INCLUDING A DETAILED DISCUSSION OF DEFINED BENEFIT PLANS\n6.UNDERSTAND THE CONCEPTS UNDERLYING DERIVATIVES AND HEDGING ACTIVITIES INCLUDING THOSE RELATED TO SWAPS, FORWARDS, FUTURES, AND OPTIONS", "Textbook(s)": "STICE, JAMES & STICE, EARL (2009).  INTERMEDIATE ACCOUNTING (18TH ED.). INDEPENDENCE, KY: CENGAGE LEARNING. [ISBN 978-0-538-47973-8]", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}