{"Course ID": "232519", "Institution": "MDC - MIAMI DADE COLLEGE", "Course Name": "ACG 3103 - INTERMEDIATE FINANCIAL ACCOUNTING I", "Course Title": "INTERMEDIATE FINANCIAL ACCOUNTING I", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "INTERMEDIATE ACCOUNTING I(1 OF 3)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "01/01/2019", "Effective Date": "01/01/2019", "Discontinue Date": "", "Date SCNS Approved": "12/10/2018", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2071, MAC 2233, QMB 2100", "Corequisites": "NONE", "Course Description": "THEORY AND METHODOLOGY UNDERLYING FINANCIAL REPORTING, INCLUDING THE FASB'S CONCEPTUAL FRAMEWORK, THE ACCOUNTING PROCESS, FINANCIAL STATEMENTS, ACCOUNTING CHANGES, PRESENT VALUE APPLICATIONS, AND CURRENT ASSETS.", "Objectives / Learning Outcome(s) / Major Topics": "COMPETENCY 1: THE STUDENT WILL DEMONSTRATE KNOWLEDGE OF ACCOUNTING AND ITS THEORETICAL FOUNDATION BY: \n1.\tDESCRIBING THE VARIOUS PROFESSIONAL ASSOCIATIONS CONCERNED WITH THE DEVELOPMENT AND APPLICATION OF ACCOUNTING PRINCIPLES. \n2.\tIDENTIFYING ACCOUNTING STANDARDS ISSUED BY THE FINANCIAL ACCOUNTING STANDARDS BOARD. \n3.\tLISTING THE TRADITIONAL ASSUMPTIONS OF THE ACCOUNTING MODEL.                                       \n4.\tDEFINING THE CONCEPTUAL FRAMEWORK COMPONENTS OF THE FINANCIAL ACCOUNTING STANDARDS BOARD. \n5.\tDESCRIBING THE PROVISION OF ADDITIONAL DISCLOSURE TO THE BALANCE SHEET INCLUDING A SUMMARY OF SIGNIFICANT ACCOUNTING POLICIES. \nCOMPETENCY 2: THE STUDENT WILL SHOW A COMPREHENSION OF ACCOUNTING TECHNIQUES BY: \n1.\tEXPLAINING THE RECORDING OF THE ACQUISITION OF NON-CURRENT ASSETS BY VARIOUS MEANS SUCH AS LUMP-SUM PURCHASE PRICE, DEFERRED PAYMENT CONTRACTS, CAPITAL LEASES, EXCHANGE OF NON-MONETARY ASSETS, ISSUANCE OF SECURITIES, AND BY DONATION. \n2.\tCONVERTING U.S. DOLLARS TO FOREIGN CURRENCY IN INVENTORY TRANSACTIONS. \n3.\tDISTINGUISHING THE ITEMS TO BE INCLUDED IN THE DETERMINATION OF INVENTORY COST. \n4.\tSUMMARIZING THE DIFFERENCE BETWEEN ACCRUAL AND CASH-BASIS ACCOUNTING. \n5.\tPARAPHRASING THE STEPS IN REPORTING CHANGES IN RETAINED EARNINGS. \n6.\tGIVING EXAMPLES OF COMPENSATING BALANCES AND OF PETTY CASH FUNDS. \n7.\tDISTINGUISHING BETWEEN ACCOUNTS RECEIVABLE AND NOTES RECEIVABLE AS TO METHODS OF VALUATION AND REPORTING. \nCOMPETENCY 3: THE STUDENT WILL DEMONSTRATE KNOWLEDGE OF CASH AND TEMPORARY INVESTMENTS BY: \n1.\tLISTING THE ASSETS THAT COMPOSE THIS CATEGORY. \n2.\tDESCRIBING THE USEFULNESS OF EACH OF THESE ASSETS. \n3.\tREPRODUCING THIS PORTION OF THE BALANCE SHEET. \n4.\tSTATING THE CRITERIA FOR REPORTING SECURITIES AS TEMPORARY INVESTMENTS. \n5.\tDESCRIBING THE TIME-VALUE-OF-MONEY CONCEPT. \n6.\tDEFINING FUTURE VALUE AND PRESENT VALUE TECHNIQUES. \n7.\tPROVIDING AN ILLUSTRATION OF THE REPORTING OF CASH AND TEMPORARY INVESTMENTS ON THE BALANCE SHEET AND ON THE STATEMENT OF CASH FLOWS. \n8.\tOUTLINING THE USE OF NOTES RECEIVABLE AS A SOURCE OF CASH. \n9.\tNAMING THE PROCEDURES TO VALUE TEMPORARY INVESTMENTS SUBSEQUENT TO ACQUISITION. \nCOMPETENCY 4: THE STUDENT WILL APPLY KNOWLEDGE ABOUT FINANCIAL STATEMENTS BY: \n1.\tPREPARING SEVERAL DIFFERENT FORMS OF THE BALANCE SHEET. \n2.\tPRODUCING A STATEMENT OF CASH FLOWS USING THE DIRECT METHOD. \n3.\tCREATING A STATEMENT OF CASH FLOWS USING THE INDIRECT METHOD. \n4.\tDEMONSTRATING THE REPORTING OF CASH FLOW FROM INVESTING ACTIVITIES AND FROM FINANCING ACTIVITIES. \nCOMPETENCY 5: THE STUDENT WILL APPLY KNOWLEDGE ABOUT OF NON-CURRENT ASSETS BY: \n1.\tCOMPUTING THE DEPRECIATION FOR NON-CURRENT ASSETS USING THREE DIFFERENT METHODS. \n2.\tSHOWING THE DIFFERENT WAYS OF ESTIMATING GOODWILL. \n3.\tSOLVING PROBLEMS INVOLVING THE AMORTIZATION OF INTANGIBLE ASSETS AND THE DEPLETION OF NATURAL RESOURCES. \n4.\tUSING THE COST METHOD AND THE EQUITY METHOD FOR LONG-TERM INVESTMENTS IN EQUITY SECURITIES. \n5.\tRELATING THE VARIOUS WAYS OF RETIRING A NON-CURRENT ASSET. \nCOMPETENCY 6: THE STUDENT WILL PERFORM AN ANALYSIS OF ASSET ACCOUNTS BY: \n1.\tDISTINGUISHING BETWEEN CURRENT AND NON-CURRENT ASSETS. \n2.\tIDENTIFYING THE DIFFERENT METHODS OF INVENTORY VALUATION, INCLUDING THEIR INCOME TAX CONSEQUENCES. \n3.\tDIFFERENTIATING THE METHODS FOR WRITING OFF A BAD DEBT. \n4.\tILLUSTRATING THE DIFFERENT METHODS OF ESTIMATING THE VALUE OF INVENTORY FOR MID-YEAR REPORTING. \n5.\tDISCUSSING THE NATURE OF INVENTORIES OF RAW MATERIALS, GOOD IN PROCESS, AND FINISHED GOODS. \nCOMPETENCY 7: THE STUDENT WILL DEMONSTRATE ABILITY TO SYNTHESIZE THE ACCOUNTING PROCESS BY: \n1.\tGENERATING THE BANK RECONCILIATION. \n2.\tORGANIZING THE INCOME STATEMENT ACCOUNTS INTO A MULTI-STEP INCOME STATEMENT. \n3.\tCOMPILING A BALANCE SHEET, AND TELLING ABOUT ITS USEFULNESS. \n4.\tCREATING A STATEMENT OF CASH FLOWS. \n5.\tEXPLAINING HOW COMPUTERS ARE USED TO INCREASE SPEED AND ACCURACY IN ACCOUNTING. \n6.\tRELATING AN ILLUSTRATION OF THE IMPORTANCE OF RECOGNIZING, MEASURING, AND REPORTING INCOME.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}