{"Course ID": "232520", "Institution": "MDC - MIAMI DADE COLLEGE", "Course Name": "ACG 3113 - INTERMEDIA FINANCIAL ACCOUNTING II", "Course Title": "INTERMEDIA FINANCIAL ACCOUNTING II", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "INTERMEDIATE ACCOUNTING II(2 OF 3)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "01/01/2019", "Effective Date": "01/01/2019", "Discontinue Date": "", "Date SCNS Approved": "12/10/2018", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 3103", "Corequisites": "NONE", "Course Description": "THIS COURSE PROVIDES AN EMPHASIS ON ANALYSIS OF BALANCE SHEET ACCOUNTS THROUGH PROBLEM SOLVING. STUDENTS WILL GAIN A MORE IN-DEPTH KNOWLEDGE OF GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP), INCLUDING AN ADVANCED UNDERSTANDING OF LONG-TERM ASSETS, CURRENT AND LONG-TERM LIABILITIES AND EQUITIES.", "Objectives / Learning Outcome(s) / Major Topics": "COMPETENCY 1: THE STUDENT WILL DEMONSTRATE FINANCING LIABILITIES: BONDS AND LONG-TERM LIABILITIES BY: \n1.\t EXPLAIN THE REASONS FOR ISSUING LONG-TERM FINANCING LIABILITIES, SUCH AS BONDS AND NOTES PAYABLE. \n2.\tUNDERSTAND THE CHARACTERISTICS OF BONDS PAYABLE. \n3.\tCOMPUTE THE ISSUE PRICE OF BONDS PAYABLE. \n4.\tRECORD THE ISSUANCE OF BONDS PAYABLE. \n5.\tAMORTIZE BOND DISCOUNTS AND BOND PREMIUMS. \n6.\tEXPLAIN EXTINGUISHMENT OF LIABILITIES. \nCOMPETENCY 2: THE STUDENT WILL DEMONSTRATE CONTRIBUTED CAPITAL BY:\n1.\tDEFINE EQUITY AND EXPLAIN THE CORPORATE FORM OF ORGANIZATION, INCLUDING ITS ADVANTAGES AND DISADVANTAGES.\n2.\tEXPLAIN THE RIGHTS AND TERMS THAT APPLY TO CAPITAL STOCK.\n3.\tCOMPUTE THE ACCOUNTING FOR THE ISSUANCE OF CAPITAL STOCK.\n4.\tANALYZE NON-COMPENSATORY SHARE PURCHASE PLANS.\n5.\tANALYZE AND ACCOUNT FOR SHARE-BASED COMPENSATION PLANS.\n6.\tDESCRIBE THE CHARACTERISTICS OF PREFERRED STOCK.\n7.\tUNDERSTAND THE ACCOUNTING FOR TREASURY STOCK.\n8.\tDISTINGUISH THE COMPONENTS OF CONTRIBUTED CAPITAL AND HOW THEY ARE REPORTED IN FINANCIAL STATEMENTS.\nCOMPETENCY 3: THE STUDENT WILL DEMONSTRATE RETAINED EARNINGS AND EARNINGS PER SHARE BY:\n1.\tEXPLAIN THE ACCOUNTING AND REPORTING FOR DIFFERENT TYPES OF DIVIDENDS.\n2.\tDISCUSS THE ACCOUNTING FOR PRIOR PERIOD ADJUSTMENTS AND RESTRICTIONS OF RETAINED EARNINGS.\n3.\tEXPLAIN THE VARIOUS COMPONENTS OF SHAREHOLDERS’ EQUITY AND RELATED DISCLOSURES.\n4.\tCOMPUTE BASIC EARNINGS PER SHARE (EPS) INCLUDING THE COMPUTATION OF WEIGHTED AVERAGE COMMON SHARES.\n5.\tCOMPUTE DILUTED EARNINGS PER SHARE INCLUDING THE IDENTIFICATION OF POTENTIAL COMMON SHARES.\n6.\tANALYZE THE DIFFERENCES IN DILUTED AND BASIC EARNINGS PER SHARE.\nCOMPETENCY 4: THE STUDENT WILL DEMONSTRATE ADVANCED ISSUES IN REVENUE RECOGNITION BY:\n1.\tUNDERSTAND AND EXPLAIN THE CORE ISSUES OF REVENUE RECOGNITION.\n2.\tDESCRIBE HOW A COMPANY IDENTIFIES A CONTRACT WITH A CUSTOMER.\n3.\tEXAMINE HOW A COMPANY IDENTIFIES THE PERFORMANCE OBLIGATIONS IN A CONTRACT.\n4.\tUNDERSTAND HOW A COMPANY DETERMINES THE TRANSACTION PRICE OF A CONTRACT.\n5.\tDESCRIBE HOW TO ALLOCATE THE TRANSACTION PRICE TO THE PERFORMANCE OBLIGATIONS IN THE CONTRACT.\n6.\tANALYZE REVENUE AS THE COMPANY SATISFIES THE PERFORMANCE OBLIGATIONS IN THE CONTRACT.\n7.\tUNDERSTAND THE ACCOUNTING FOR LONG-TERM CONTRACTS IN WHICH REVENUE IS RECOGNIZED OVER TIME VERSUS AT A POINT IN TIME.\nCOMPETENCY 5: THE STUDENT WILL DEMONSTRATE ACCOUNTING FOR INCOME TAXES BY:\n1.\tUNDERSTAND ACCOUNTING ISSUES RELATED TO INCOME TAXES.\n2.\tAPPLY INTERPERIOD INCOME TAX ALLOCATION AND EXPLAIN THE ACCOUNTING FOR TEMPORARY DIFFERENCES.\n3.\tANALYZE, RECORD AND REPORT DEFERRED TAX LIABILITIES AND DEFERRED TAX ASSETS.\n4.\tUNDERSTAND AND EXPLAIN THE ACCOUNTING FOR PERMANENT DIFFERENCES.\n5.\tEXPLAIN AND ACCOUNT FOR OPERATING LOSS CARRYBACKS AND CARRYFORWARDS.\n6.\tDESCRIBE AND APPLY INTRAPERIOD TAX ALLOCATION.\n7.\tEXAMINE PRESENTATION AND DISCLOSURE ISSUES RELATED TO ACCOUNTING FOR INCOME TAXES.\n8.\tUNDERSTAND AND EXPLAIN THE ACCOUNTING FOR UNCERTAIN TAX POSITIONS\nCOMPETENCY 6: THE STUDENT WILL DEMONSTRATE ACCOUNTING FOR POST-RETIREMENT PENSION PLANS BY:\n1.\tUNDERSTAND THE CHARACTERISTICS OF PENSION PLANS.\n2.\tEXPLAIN THE GAAP FOR PENSION PLANS, INCLUDING COMPUTING PENSION EXPENSE AND RECOGNIZING PENSION LIABILITIES AND ASSETS.\n3.\tACCOUNT FOR DEFINED BENEFIT PENSION PLANS.\n4.\tUNDERSTAND SEVERAL IMPORTANT ADDITIONAL ISSUES RELATED TO ACCOUNTING FOR PENSION PLANS.\n5.\tEXPLAIN AND ACCOUNT FOR OTHER POSTRETIREMENT BENEFIT PLANS (OPRBS).\nCOMPETENCY 7: THE STUDENT WILL DEMONSTRATE ACCOUNTING FOR LEASES BY:\n1.\tEXPLAIN HOW TO CLASSIFY LEASES.\n2.\tEXPLAIN THE ADVANTAGES AND DISADVANTAGES OF LEASING.\n3.\tACCOUNT FOR A LESSEE’S OPERATING AND CAPITAL LEASES.\n4.\tUNDERSTAND STATEMENT OF CASH FLOW PRESENTATION AND DISCLOSURE BY THE LESSEE.\n5.\tACCOUNT FOR A LESSOR’S OPERATING, DIRECT FINANCING, AND SALES-TYPE LEASES.\n6.\tUNDERSTAND STATEMENT OF CASH FLOW PRESENTATION AND DISCLOSURE BY THE LESSOR.\nCOMPETENCY 8: THE STUDENT WILL DEMONSTRATE STATEMENT OF CASH FLOWS BY:\n1.\tUNDERSTAND AND DEFINE OPERATING, INVESTING, AND FINANCING ACTIVITIES. \n2.\tEXPLAIN THE DIRECT AND INDIRECT METHODS FOR REPORTING OPERATING CASH FLOWS. \n3.\tPREPARE A STATEMENT OF CASH FLOWS USING THE VISUAL INSPECTION METHOD. \n4.\tPREPARE A STATEMENT OF CASH FLOWS USING THE SPREADSHEET METHOD. \n5.\tACCOUNT FOR SPECIAL ITEMS AFFECTING THE STATEMENT OF CASH FLOWS.  \n6.\tUNDERSTAND AND PREPARE THE OPERATING ACTIVITIES SECTION UNDER THE DIRECT METHOD.\nCOMPETENCY 9: THE STUDENT WILL DEMONSTRATE ACCOUNTING FOR ERRORS BY:\n1.\tIDENTIFY THE TYPES OF ACCOUNTING CHANGES AND EXPLAIN THE METHODS OF REPORTING EACH TYPE OF CHANGE. \n2.\tACCOUNT FOR A CHANGE IN ACCOUNTING PRINCIPLE. \n3.\tACCOUNT FOR A CHANGE IN ESTIMATE. \n4.\tIDENTIFY A CHANGE IN A REPORTING ENTITY. \n5.\tACCOUNT FOR A CORRECTION OF AN ERROR.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}