{"Course ID": "233940", "Institution": "MDC - MIAMI DADE COLLEGE", "Course Name": "ACG 3343 - COST ACCOUNTING AND CONTROLS", "Course Title": "COST ACCOUNTING AND CONTROLS", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "COST ACCOUNTING", "Lab Code": " ", "Honors Course": "NO", "Add Date": "01/01/2019", "Effective Date": "01/01/2019", "Discontinue Date": "", "Date SCNS Approved": "1/25/2019", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2071", "Corequisites": "NONE", "Course Description": "PREPARATION OF ACCOUNTING INFORMATION FOR USE IN MANAGEMENT DECISION MAKING PROCESS. CONTAINS INFORMATION ON BUDGETING, STANDARD COSTING, DIRECT COSTING, PERFORMANCE EVALUATION, AND USE OF ACCOUNTING INFORMATION.", "Objectives / Learning Outcome(s) / Major Topics": "COMPETENCY 1: THE STUDENT WILL UNDERSTAND THE USES OF COST ACCOUNTING DATA BY:\n1.\t EVALUATING THE PLANNING AND CONTROL USES OF COST ACCOUNTING DATA\n2.\tUNDERSTANDING THE IMPORTANCE OF PROFESSIONAL ETHICS\n3.\tANALYZING THE RELATIONSHIP BETWEEN COST ACCOUNTING TO FINANCIAL AND MANAGERIAL ACCOUNTING \n4.\tDETERMINE THE THREE MANUFACTURING COSTS: DIRECT MATERIALS, DIRECT LABOR, AND FACTORY OVERHEAD.\n5.\tDIFFERENTIATE AMONG THE VARIOUS COST ACCOUNTING SYSTEMS\nCOMPETENCY 2:\tTHE STUDENT WILL DETERMINE AND ANALYZE THE COST OF MATERIALS BY:\n1.\tUNDERSTANDING THE IMPORTANCE OF MAINTAINING PHYSICAL CONTROL OF MATERIALS\n2.\tCALCULATING THE COST OF MATERIALS ISSUED AND RELATED ACCOUNTING PROCEDURES\n3.\tAPPLYING JUST-IN-TIME MATERIALS CONTROL METHODS\nCOMPETENCY 3:\tTHE STUDENT WILL DETERMINE AND ANALYZE THE COST OF LABOR BY:\n1.\tDETERMINING THE SCRAP, SPOILED GOODS AND DEFECTIVE WORK AND HOW TO ACCOUNT FOR IT\n2.\tDIFFERENTIATING AMONG THE VARIOUS WAGES PLANS AVAILABLE FOR A FIRM\n3.\tUNDERSTANDING THE METHODS USED TO CONTROL LABOR COSTS\n4.\tCALCULATING THE LABOR COSTS AND RELATED EMPLOYEE CONTRIBUTIONS\nCOMPETENCY 4:\tTHE STUDENT WILL DETERMINE AND ANALYZE FACTORY OVERHEAD COSTS BY:\n1.\tIDENTIFYING THE COST BEHAVIOR PATTERNS INVOLVED.\n2.\tANALYZING SEMI-VARIABLE FACTORY OVERHEAD COSTS\n3.\tUNDERSTANDING HOW TO BUDGET OVERHEAD COSTS\n4.\tDETERMINING THE APPROPRIATE ACCOUNTING PROCEDURES FOR THE RECORDING OF OVERHEAD COSTS\n5.\tALLOCATING SERVICE DEPARTMENT EXPENSES TO PRODUCTION AREAS\n6.\tAPPLYING FACTORY OVERHEAD TO PRODUCTION\n7.\tDETERMINING THE APPROPRIATE ACCOUNTING PROCEDURES FOR THE RECORDING OF ACTUAL AND APPLIED FACTORY OVERHEAD COSTS\nCOMPETENCY 5:  THE STUDENT WILL BE ABLE TO APPLY PROCESS COST ACCOUNTING PROCEDURES BY:\n1.\tCOMPARING AND CONTRASTING THE BASIC COST SYSTEMS\n2.\tDETERMINING DIRECT MATERIAL, DIRECT LABOR AND FACTORY OVERHEAD COSTS UNDER PROCESS COSTING SYSTEMS\n3.\tCALCULATING EQUIVALENT UNITS OF PRODUCTION UNDER FIRST IN, FIRST OUT METHOD\n4.\tANALYZING THE APPLICATION OF PROCESS COSTING TO A MULTI-DEPARTMENTAL FACTORY\nCOMPETENCY 6:  THE STUDENT WILL BE ABLE TO APPLY PROCESS COST ACCOUNTING PROCEDURES TO JOINT PRODUCTS AND BY-PRODUCTS BY:\n1.\tUNDERSTANDING THE APPLICATION OF MATERIALS IN THE PROCESS\n2.\tDETERMINING THE UNITS LOST IN PRODUCTION\n3.\tALLOCATING COSTS AMONG THE JOINT PRODUCTS OR BY-PRODUCTS.\nCOMPETENCY 7:  THE STUDENT WILL BE ABLE TO COMPLETE THE PREPARATION OF A MASTER BUDGET BY:\n1.\tUNDERSTANDING THE PURPOSE AND NEED FOR BUDGETING IN A FIRM\n2.\tDEVELOPING THE MASTER BUDGET THROUGH ITS COMPONENT BUDGETS: SALES, PRODUCTION, DIRECT MATERIALS, DIRECT LABOR, FACTORY OVERHEAD, COST OF GOODS SOLD, SELLING AND ADMINISTRATIVE EXPENSES, BUDGETED INCOME STATEMENT AND CASH BUDGET\n3.\tEVALUATE BUDGET PERFORMANCE THROUGH THE USE OF A FLEXIBLE BUDGET\nCOMPETENCY 8:  THE STUDENT WILL BE ABLE TO EVALUATE PERFORMANCE THROUGH THE USE OF STANDARDS BY:\n1.\tUNDERSTANDING THE DIFFERENCE BETWEEN THE TYPES OF STANDARDS.\n2.\tDETERMINING THE STANDARD COSTS FOR MATERIALS AND LABOR.\n3.\tDETERMINING THE VARIANCES FOR DIRECT MATERIALS AND DIRECT LABOR.\n4.\tANALYZING THE VARIANCES AND DETERMINING NECESSARY PRODUCTION CHANGES.\n5.\tDETERMINING THE VARIANCES FOR FACTORY OVERHEAD UNDER THE TWO-VARIANCE AND THE FOUR-VARIANCE METHODS OF ANALYSIS.\nCOMPETENCY 9:  THE STUDENT WILL BE ABLE TO APPLY JOB ORDER COSTING TO A SERVICE BUSINESS BY:\n1.\tDETERMINING THE COST ALLOCATION BASE AND TRACING DIRECT COSTS TO THE JOB\n2.\tCOMPLETING THE BUDGETING PROCESS FOR A SERVICE BUSINESS\n3.\tAPPLYING ACTIVITY BASED COSTING TO A SERVICE FIRM\n4.\tDIFFERENTIATE THE ALLOCATIONS USED BY SIMPLIFIED COSTING VS. ACTIVITY BASED COSTING\nCOMPETENCY 10:  THE STUDENT WILL BE ABLE TO APPLY COST ANALYSIS FOR MANAGEMENT DECISION MAKING BY:\n1.\tDIFFERENTIATING OPERATING INCOME DERIVED UNDER ABSORPTION COSTING VERSUS VARIABLE COSTING.\n2.\tUNDERSTANDING THE MERITS AND LIMITATIONS OF VARIABLE COSTING\n3.\tANALYZING SEGMENT REPORTING FOR PROFITABILITY ANALYSIS UNDER VARIABLE COSTING\nCOMPETENCY 11:  THE STUDENT WILL BE ABLE TO ANALYZE BUSINESS DECISION USING COST-VOLUME-PROFIT ANALYSIS BY:\n1.\tUNDERSTANDING THE LIMITATIONS OF BREAKEVEN ANALYSIS\n2.\tDETERMINING CONTRIBUTION MARGIN AND MARGIN OF SAFETY\n3.\tAPPLYING BREAK EVEN ANALYSIS TO THE COMPUTATION CHANGES IN COSTS AND PRICES OF THE PRODUCT\n4.\tAPPLYING BREAK EVEN ANALYSIS TO SALES MIX ISSUES\nCOMPETENCY 12:  THE STUDENT WILL BE ABLE TO EVALUATE BUSINESS DECISION USING DIFFERENTIAL ANALYSIS BY:\n1.\tEVALUATING THE DECISION TO ACCEPT OR REJECT A SPECIAL ORDER\n2.\tEVALUATING THE DECISION TO MAKE OR BUY A COMPONENT", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}