{"Course ID": "233941", "Institution": "MDC - MIAMI DADE COLLEGE", "Course Name": "ACG 4632 - AUDITING", "Course Title": "AUDITING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "AUDITING I(1 OF 2)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "01/01/2019", "Effective Date": "01/01/2019", "Discontinue Date": "", "Date SCNS Approved": "1/25/2019", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 3113", "Corequisites": "NONE", "Course Description": "THIS COURSE PROVIDES A SOUND CONCEPTUAL FOUNDATION OF BASIC AUDITING PROCESS FROM THE PERSPECTIVE OF THE PUBLIC ACCOUNTING PROFESSION.  PROFESSIONAL STANDARDS, ETHICS, LEGAL RESPONSIBILITIES, AND UTILIZATION OF TECHNOLOGY ARE ADDRESSED. PRINCIPLES AND PROCEDURES OF INTERNAL AND PUBLIC AUDITING ARE DISCUSSED, INCLUDING PROFESSIONAL STANDARDS, ETHICS, LEGAL RESPONSIBILITIES, AND THE UTILIZATION OF TECHNOLOGY.", "Objectives / Learning Outcome(s) / Major Topics": "COMPETENCY 1:\tTHE STUDENT WILL UNDERSTAND THE ROLE OF THE PUBLIC ACCOUNTANT IN THE AMERICAN ECONOMY BY:\n1.\tUNDERSTANDING THE VARIOUS ASSURANCE SERVICES AND THEIR PURPOSE\n2.\tUNDERSTANDING THE PUBLIC ACCOUNTING PROFESSION\n3.\tUNDERSTANDING THE IMPORTANCE OF PROFESSIONAL ETHICS\nCOMPETENCY 2:\tTHE STUDENT WILL ANALYZE THE PROFESSIONAL STANDARDS BY:\n1.\tUNDERSTANDING THE GENERALLY ACCEPTED AUDITING STANDARDS\n2.\tDETERMINING THE AUDITORS’ RESPONSIBILITY FOR DETECTING MISSTATEMENTS\n3.\tUNDERSTANDING THE VARIOUS AUDITING REPORTS\n4.\tUNDERSTANDING THE ATTESTATION STANDARDS\nCOMPETENCY 3:\tTHE STUDENT WILL UNDERSTAND PROFESSIONAL ETHICS BY:\n1.\tANALYZING THE NATURE OF ETHICS\n2.\tUNDERSTANDING THE NEED FOR ETHICS IN THE PROFESSION\n3.\tEVALUATING THE AICPA CODE OF PROFESSIONAL CONDUCT\n4.\tDIFFERENTIATING BETWEEN THE ETHICS FOR PUBLIC ACCOUNTANTS AND INTERNAL AUDITORS\nCOMPETENCY 4:\tTHE STUDENT WILL EVALUATE THE LEGAL LIABILITY OF CPAS BY:\n1.\tIDENTIFYING THE SCOPE OF CPA LIABILITIES\n2.\tDETERMINE THE CPA’S LIABILITY TO CLIENTS UNDER COMMON LAW AND STATUTORY LAW\nCOMPETENCY 5:  THE STUDENT WILL BE ABLE TO ANALYZE AUDIT EVIDENCE AND DOCUMENTATION BY:\n1.\tUNDERSTANDING THE RELATIONSHIP OF AUDIT RISK TO AUDIT EVIDENCE\n2.\tDIFFERENTIATING AMONG THE DIFFERENT TYPES OF AUDIT EVIDENCE\n3.\tDETERMINING THE NATURE, TIMING AND EXTENT OF AUDIT PROCEDURES TO BE UNDERTAKEN\n4.\tANALYZING AUDIT EVIDENCE WITH THE PROPER PROCEDURES\n5.\tEVALUATING AUDIT EVIDENCE IN SUBJECTIVE AREAS\n6.\tUNDERSTANDING THE IMPORTANCE OF AUDIT DOCUMENTATION\nCOMPETENCY 6:  THE STUDENT WILL BE ABLE TO PLAN AN AUDIT BY:\n1.\tUNDERSTAND THE PROCEDURES WHEN FIRST OBTAINING A CLIENT\n2.\tPLAN THE AUDIT BY OBTAINING AN UNDERSTANDING OF THE CLIENT’S BUSINESS\n3.\tASSESSING THE INHERENT RISKS OF THE AUDIT\n4.\tLINKING THE AUDIT PROCEDURES TO THE RISKS\n5.\tDETERMINING THE TIMING OF THE AUDIT\nCOMPETENCY 7:  THE STUDENT WILL BE ABLE TO DETERMINE THE VALIDITY OF INTERNAL CONTROL BY:\n1.\tUNDERSTANDING THE MEANING OF INTERNAL CONTROL\n2.\tDETERMINING THE CONTROL ENVIRONMENT\n3.\tASSESSING THE RISK OF DEFICIENCIES IN THE AUDIT\n4.\tEVALUATING THE CONTROL ACTIVITIES AND MONITORING THE CONTROLS.\n5.\tUNDERSTANDING THE LIMITATIONS OF INTERNAL CONTROL\nCOMPETENCY 8:  THE STUDENT WILL BE ABLE CONSIDER THE ROLE OF INTERNAL CONTROL IN AN INFORMATION TECHNOLOGY ENVIRONMENT BY:\n1.\tUNDERSTANDING THE IT-BASED SYSTEMS\n2.\tUNDERSTANDING THE ROLE OF INTERNAL CONTROL IN AN IT ENVIRONMENT\n3.\tAPPLYING SUBSTANTIVE TESTING WITH COMPUTERS.\nCOMPETENCY 9:  THE STUDENT WILL BE ABLE TO APPLY AUDIT SAMPLING BY:\n1.\tCOMPARING STATISTICAL AND NON- STATISTICAL SAMPLING.\n2.\tAPPLYING AUDIT SAMPLING FOR TESTS OF CONTROLS\n3.\tDETERMINE THE USE OF ATTRIBUTES SAMPLING ON THE AUDIT\n4.\tUNDERSTAND THE USE OF CLASSICAL VARIABLES SAMPLING\nCOMPETENCY 10:  THE STUDENT WILL BE ABLE TO AUDIT CASH, FINANCIAL INVESTMENTS, RECEIVABLES AND INVENTORIES BY:\n1.\tUNDERSTANDING THE SOURCES AND USES OF CASH\n2.\tDETERMINING AUDIT PROGRAM TO VERIFY CASH AND FINANCIAL INVESTMENTS\n3.\tDETERMINING THE AUDIT PROGRAM TO VERIFY RECEIVABLES\n4.\tUNDERSTAND THE SOURCES AND NATURE OF INVENTORIES AND COST OF GOODS SOLD\n5.\tUNDERSTAND THE INTERNAL CONTROLS THAT MUST BE IN PLACE FOR INVENTORIES\n6.\tDETERMINE THE AUDIT PROGRAM TO VERIFY INVENTORIES\nCOMPETENCY 11:  THE STUDENT WILL BE ABLE TO AUDIT LIABILITIES, DEBT AND EQUITY CAPITAL BY:\n1.\tUNDERSTANDING THE SOURCES AND NATURE OF THE DIFFERENT LIABILITIES\n2.\tDETERMINING THE AUDIT PROGRAM TO VERIFY LIABILITIES\n3.\tUNDERSTANDING THE SOURCES AND NATURE OF DEBT AND EQUITY CAPITAL\n4.\tDEVELOPING AN AUDIT PROGRAM FOR DEBT AND EQUITY CAPITAL", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}