{"Course ID": "205196", "Institution": "SCFMS - STATE COLLEGE OF FLORIDA, MANATEE-SARASOTA", "Course Name": "ACG 2949 - INTERNSHIP IN ACCOUNTING", "Course Title": "INTERNSHIP IN ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "INTERNSHIPS/PRACTICUMS/CLINICAL PRACTICE", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2014", "Effective Date": "08/02/2021", "Discontinue Date": "", "Date SCNS Approved": "12/17/2013", "Term Type": "SEMESTER", "Course Credits": "1-3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.", "Prerequisites": "ACG 2021 AND PERMISSION OF PROGRAM MANAGER.", "Corequisites": "NONE", "Course Description": "(1-3 VARIABLE CREDIT HOURS) (A.S.)  FOUR, EIGHT OR 12 HOURS OF VOLUNTEER OR WORK EXPERIENCE PER WEEK ARE EXPECTED DEPENDING ON THE CREDIT HOUR REQUIREMENTS.  THIS WORK-STUDY COURSE REINFORCES EDUCATIONAL AND PROFESSIONAL GROWTH IN ACCOUNTING THROUGH COORDINATED FIELD EXPERIENCES OR THROUGH A VIRTUAL INTERNSHIP COURSE FOCUSED ON AUDITING.  IT IS DESIGNED TO PROVIDE STUDENTS THE OPPORTUNITY TO APPLY CLASSROOM THEORY TO PRACTICAL, WORK-RELATED APPLICATIONS. THE STUDENT, INSTRUCTOR AND WORK SITE SUPERVISOR WORK TOGETHER TO DETERMINE SPECIFIC LEARNING OBJECTIVES FOR EACH STUDENT.  THE STUDENT IS THEN EVALUATED BASED ON DOCUMENTATION OF SATISFACTORY COMPLETION OF THE LEARNING OBJECTIVES AND WORK ASSIGNMENTS.  WITH PROGRAM MANAGERS APPROVAL AND BASED UPON DEGREE REQUIREMENTS, DEGREE-SEEKING STUDENTS WHO ARE MAKING PROGRESS IN THEIR DEGREE PROGRAM MAY REPEAT THIS COURSE FOR A MAXIMUM TOTAL OF THREE CREDITS.  (OFFERED ONLY AS NEEDED.)", "Objectives / Learning Outcome(s) / Major Topics": "SPECIFIC STUDENT PERFORMANCE OBJECTIVES ARE DEVELOPED FOR EACH STUDENT IN THE WORK-STUDY COURSE, WHICH ARE IN LINE WITH THEIR CAREER GOALS AND THE LENGTH AND TYPE OF WORK INTERNSHIP AVAILABLE. STUDENTS WHO COMPLETE THE VIRTUAL INTERNSHIP WILL BE ABLE TO DEMONSTRATE A DEEP, INTUITIVE UNDERSTANDING OF AUDITING PROCEDURES AND STANDARDS.", "Textbook(s)": "NONE", "Transfer Status": "NOT AUTOMATICALLY TRANSFERABLE", "Transaction Type": ""}