{"Course ID": "29016", "Institution": "BC - BROWARD COLLEGE", "Course Name": "ACG 2011 - PRINCIPLES OF ACCOUNTING II", "Course Title": "PRINCIPLES OF ACCOUNTING II", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "PRINCIPLES OF ACCOUNTING II", "Lab Code": " ", "Honors Course": "YES", "Add Date": "", "Effective Date": "08/01/2015", "Discontinue Date": "", "Date SCNS Approved": "2/5/1982", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "T.C.A.S.", "Prerequisites": "ACG2001 WITH A MINIMUM GRADE OF C", "Corequisites": "NONE", "Course Description": "AS THE SECOND COURSE OF THE FINANCIAL ACCOUNTING SERIES, THIS COURSE CONCLUDES THE STUDY OF FINANCIAL ACCOUNTING. TOPICS COVERED INCLUDE PLANT ASSETS, CURRENT LIABILITIES, PAYROLL, CORPORATIONS, PARTNERSHIPS AND CASH FLOW STATEMENTS. ADVISEMENT NOTE: STUDENTS ACHIEVING LESS THAN A GRADE OF \"C\" WILL NOT BE ALLOWED TO CONTINUE ON TO ACG2071, MANAGERIAL ACCOUNTING. A GRADE OF LESS THAN \"C\" IS NOT TRANSFERABLE TO UPPER DIVISION.", "Objectives / Learning Outcome(s) / Major Topics": "1. PLANT ASSETS AND INTANGIBLE ASSETS\nTHE STUDENT SHOULD BE ABLE TO DESCRIBE THE ACCOUNTING AND REPORTING OF PLANT AND INTANGIBLE ASSETS AND NATURAL RESOURCES.\n2. CURRENT LIABILITIES AND PAYROLL\nTHE STUDENTS SHOULD BE ABLE TO DESCRIBE THE ACCOUNTING FOR PAYROLLS, SHORT-TERM FINANCING DEVICES, AND OTHER CURRENT LIABILITIES.\n3. FORMS OF BUSINESS ORGANIZATION\nTHE STUDENTS SHOULD BE ABLE TO DESCRIBE AND ILLUSTRATE BUSINESS ORGANIZATIONAL CHARACTERISTICS THAT HAVE ACCOUNTING IMPLICATIONS.\n4. STOCKHOLDERS' EQUITY, EARNINGS, AND DIVIDENDS\nTHE STUDENTS SHOULD BE ABLE TO DEVELOP THE ACCOUNTING FOR STOCKHOLDERS' EQUITY, EARNINGS, AND DIVIDENDS.\n5. LONG-TERM LIABILITIES AND INVESTMENTS IN BONDS\nTHE STUDENTS SHOULD BE ABLE TO DEVELOP THE ACCOUNTING FOR LONG-TERM OBLIGATIONS AND INVESTMENTS IN STOCKS AND BONDS.\n6. INVESTMENTS IN STOCKS\nTHE STUDENTS SHOULD BE ABLE DESCRIBE AND ILLUSTRATE THE ACCOUNTING FOR LONG-TERM INVESTMENTS IN STOCKS.\n7. STATEMENT OF CASH FLOWS\nTHE STUDENTS SHOULD BE ABLE TO PREPARE A STATEMENT OF CASH FLOW BY ANALYZING ACCOUNTS AND REPORTING THE NEEDED INFORMATION TO DECISION MAKERS.\n8. FINANCIAL STATEMENT ANALYSIS\nTHE STUDENTS SHOULD BE ABLE TO ANALYZE FINANCIAL STATEMENTS AND DETERMINE SOLVENCY AND PROFITABILITY.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}