{"Course ID": "66967", "Institution": "BC - BROWARD COLLEGE", "Course Name": "ACG 2071 - MANAGERIAL ACCOUNTING", "Course Title": "MANAGERIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "MANAGERIAL ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "08/01/2015", "Discontinue Date": "", "Date SCNS Approved": "1/24/1992", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "T.C.A.S.", "Prerequisites": "ACG2011 WITH A MINIMUM GRADE OF C", "Corequisites": "NONE", "Course Description": "AS THE LAST COURSE OF THE SERIES, THIS COURSE CONCLUDES THE STUDY OF MANUFACTURING ACCOUNTING AND MANAGERIAL ACCOUNTING. TOPICS COVERED INCLUDE THE PROCESS COST SYSTEM, COST BEHAVIOR, COST- VOLUME-PROFIT ANALYSES, BUDGETING, PROFIT ANALYSIS, RESPONSIBILITY ACCOUNTING, DIFFERENTIAL ANALYSIS CAPITAL INVESTMENT ANALYSIS, QUANTITATIVE TECHNIQUES FOR INVENTORY CONTROL, AND DECISION-MAKING UNDER UNCERTAINTY. ADVISEMENT NOTE: STUDENTS ACHIEVING LESS THAN A GRADE OF \"C\" MAY EXPERIENCE ACADEMIC DIFFICULTY IN HIGHER LEVEL COURSES. A GRADE OF LESS THAN \"C\" IS NOT TRANSFERABLE TO UPPER DIVISION.", "Objectives / Learning Outcome(s) / Major Topics": "1. PROCESS COST SYSTEM\nTHE STUDENTS SHOULD BE ABLE TO DEMONSTRATE AND ILLUSTRATE THE ACCOUNTING CONCEPTS AND PROCEDURES USED BY MANUFACTURING OPERATIONS EMPLOYING A PROCESS COST SYSTEM.\n2. COST BEHAVIOR AND COST ESTIMATION\nTHE STUDENTS SHOULD BE ABLE TO DESCRIBE COST BEHAVIOR AND COST ESTIMATION METHODS ESSENTIAL FOR PLANNING AND CONTROLLING OPERATIONS.\n3. COST-VOLUME-PROFIT ANALYSIS\nTHE STUDENTS SHOULD BE ABLE TO DESCRIBE AND APPLY COST-VOLUME-PROFIT ANALYSIS.\n4. BUDGETING\nTHE STUDENTS SHOULD BE ABLE TO EXPLAIN THE OBJECTIVES OF THE BUDGET PROCESS.\n5. STANDARD COST SYSTEMS\nTHE STUDENTS SHOULD BE ABLE TO EXPLAIN THE USE OF STANDARD COSTS IN PLANNING AND CONTROLLING OPERATIONS. \n6. RESPONSIBILITY ACCOUNTING FOR COST, PROFIT AND INVESTMENT CENTERS\nTHE STUDENTS SHOULD BE ABLE TO DESCRIBE THE FUNCTION OF MANAGERIAL ACCOUNTING AND RESPONSIBILITY ACCOUNTING.\n7. NATURE OF MANAGERIAL ACCOUNTING\nTHE STUDENTS SHOULD BE ABLE TO DESCRIBE THE FUNCTION OF MANAGERIAL ACCOUNTING AND RESPONSIBILITY ACCOUNTING.\n8. DIFFERENTIAL ANALYSIS\nTHE STUDENTS SHOULD BE ABLE TO IDENTIFY RELEVANT INFORMATION AND APPLY DIFFERENTIAL ANALYSIS TECHNIQUES. \n9. CAPITAL INVESTMENT ANALYSIS\nTHE STUDENTS SHOULD BE ABLE TO IDENTIFY RELEVANT INFORMATION AND APPLY CAPITAL INVESTMENT ANALYSIS TECHNIQUES.\n10. JOB ORDER COST SYSTEM\nTHE STUDENTS SHOULD BE ABLE TO DEMONSTRATE AND ILLUSTRATE THE CONCEPTS AND PROCEDURES USED IN ACCOUNTING FOR MANUFACTURING OPERATIONS EMPLOYING A JOB ORDER COST ACCOUNTING SYSTEM.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}