{"Course ID": "212262", "Institution": "NFC - NORTH FLORIDA COLLEGE", "Course Name": "ACG 2110 - INTERMEDIATE ACCOUNTING II", "Course Title": "INTERMEDIATE ACCOUNTING II", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "INTERMEDIATE ACCOUNTING II", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2015", "Effective Date": "08/01/2015", "Discontinue Date": "", "Date SCNS Approved": "4/7/2015", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.A.A.", "Prerequisites": "ACG 2104", "Corequisites": "NONE", "Course Description": "THIS COURSE IS A CONTINUATION OF CONCEPTS LEARNED IN INTERMEDIATE ACCOUNTING I, FURTHER EXPLORING ASSET VALUATION AND LIABILITIES, ALSO INCLUDING ANALYSIS AND INTERPRETATION OF FINANCIAL STATEMENTS, EXPANDING INTO CONCEPTS ASSOCIATED WITH STOCKHOLDERS EQUITY AND MISCELLANEOUS ACCOUNTING TOPICS INCLUDING ACCOUNTING CHANGES, ERROR CORRECTIONS, PRIOR PERIOD ADJUSTMENTS AND GLOBALIZATION OF ACCOUNTING STANDARDS.", "Objectives / Learning Outcome(s) / Major Topics": "1.IDENTIFY AND EXPLAIN VARIOUS CLASSIFICATION AND MEASUREMENT ISSUES ASSOCIATED WITH DEBT, APPLYING PRESENT VALUE CONCEPTS IN ACCOUNTING FOR LONG-TERM DEBT AND CONSTRUCT THE LIABILITIES SECTION OF THE BALANCE SHEET.\n2.IDENTIFY AND DESCRIBE THE CHARACTERISTICS AND APPROPRIATE DISCLOSURES OF DEBT INSTRUMENTS AND IDENTIFY AND APPLY CALCULATION METHODS ASSOCIATED WITH DEBT INSTRUMENTS. \n3.IDENTIFY AND DESCRIBE THE CHARACTERISTICS AND APPROPRIATE DISCLOSURES OF STOCKHOLDERS EQUITY, CONSTRUCT THE STOCKHOLDERS EQUITY SECTION OF THE BALANCE SHEET.\n4.DISCUSS THE VARYING CLASSIFICATIONS ASSOCIATED WITH INVESTMENT SECURITIES, EXPLAIN WHY COMPANIES INVEST IN OTHER COMPANIES AND ACCOUNT FOR THE PURCHASE OF DEBT AND EQUITY SECURITIES, REVENUE RECOGNITION, CHANGES IN FAIR VALUE AND SALE OF INVESTMENT SECURITIES. \n5.EXPLAIN AND APPLY LEASE CLASSIFICATION CRITERIA, DIFFERENTIATING BETWEEN OPERATING AND CAPITAL LEASES.\n6.EXPLAIN SIMPLE AND COMPLEX CAPITAL STRUCTURES AND APPLY METHODS OF COMPUTING EARNINGS PER SHARE.\n7.IDENTIFY, DISCUSS AND APPLY ACCOUNTING FOR DERIVATIVES, CONTINGENCIES, ACCOUNTING CHANGES AND ERROR CORRECTIONS AND PRIOR PERIOD ADJUSTMENTS.\n8.IMPLEMENT A SYSTEMATIC FINANCIAL RATIO ANALYSIS AND DISCUSS THE IMPACT OF DIFFERING ACCOUNTING METHODS ON FINANCIAL RATIOS.\n9.PREPARE A COMPLETE STATEMENT OF CASH FLOWS AND EXPLAIN THE DIFFERENCE BETWEEN CASH FLOW STATEMENTS PREPARED UNDER US GAAP AND IASB STANDARDS.", "Textbook(s)": "INTERMEDIATE ACCOUNTING, 19TH EDITION, STICE/STICE, ISBN:  9781133957911", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}