{"Course ID": "212261", "Institution": "NFC - NORTH FLORIDA COLLEGE", "Course Name": "ACG 2100 - INTERMEDIATE ACCOUNTING I", "Course Title": "INTERMEDIATE ACCOUNTING I", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "INTERMEDIATE ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2015", "Effective Date": "08/01/2015", "Discontinue Date": "", "Date SCNS Approved": "4/7/2015", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.A.A.", "Prerequisites": "ACG 2071", "Corequisites": "NONE", "Course Description": "THIS COURSE PROVIDES STUDENTS WITH AN IN-DEPTH UNDERSTANDING OF ACCOUNTING PROCEDURES AND SPECIALIZED TREATMENT OF FINANCIAL STATEMENT ITEMS, CASH AND TEMPORARY ASSETS, RECEIVABLES, INVENTORIES (GENERAL AND ESTIMATING PROCEDURES), CURRENT LIABILITIES, INCOME-TAX PROCEDURES IN ACCOUNTING AND THE ACQUISITION, USE, AND RETIREMENT OF LONG-TERM PLANT ASSETS.", "Objectives / Learning Outcome(s) / Major Topics": "1. EXPLAIN THE UNDERLYING CONCEPTS IN FINANCIAL REPORTING, THE ACCOUNTING STANDARD-SETTING PROCESS AND THE FASB CONCEPTUAL FRAMEWORK.\n2. IDENTIFY, EXPLAIN, AND IMPLEMENT BASIC STEPS IN THE ACCOUNTING CYCLE.\n3. DESCRIBE THE SPECIFIC ELEMENTS OF THE BALANCE SHEET AND IDENTIFY AND IMPLEMENT DIFFERENT FORMATS USED TO PRESENT BALANCE SHEET DATA.\n4. EXPLAIN THE CONCEPT OF INCOME AND IMPORTANCE OF INCOME MEASURE AND DISCUSS AND IMPLEMENT THE FORMAT AND SPECIFIC COMPONENTS OF THE INCOME STATEMENT.\n5. IDENTIFY SPECIFIC COMPONENTS OF THE STATEMENT OF CASH FLOWS AND PREPARE A COMPLETE STATEMENT OF CASH FLOWS, INCLUDING REQUIRED SUPPLEMENTAL DISCLOSURES.\n6. IDENTIFY PRIMARY CRITERIA FOR REVENUE RECOGNITION, AND RECORD JOURNAL ENTRIES RELATED TO REVENUE TRANSACTIONS, INCLUDING LONG-TERM CONSTRUCTION TYPE CONTRACTS USING PERCENTAGE-OF-COMPLETION AND COMPLETED-CONTRACT METHODS AND LONG-TERM SERVICE TYPE CONTRACTS.\n7. DISCUSS, ANALYZE AND APPLY CONCEPTS RELATING TO INVENTORY VALUATION AND IDENTIFICATION AND COST OF GOODS SOLD.\n8. DISCUSS, ANALYZE AND APPLY CONCEPTS RELATING TO INVESTMENTS IN NONCURRENT OPERATING ASSETS ACQUISITIONS, UTILIZATION AND RETIREMENT.", "Textbook(s)": "INTERMEDIATE ACCOUNTING, 19TH EDITION, STICE/STICE, ISBN:  9781133957911", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}