{"Course ID": "144781", "Institution": "UWF - UNIVERSITY OF WEST FLORIDA", "Course Name": "ACG 4651 - AUDITING", "Course Title": "AUDITING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "AUDITING-CONDENSED (3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2007", "Effective Date": "08/22/2016", "Discontinue Date": "", "Date SCNS Approved": "8/23/2006", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "PREREQUISITE: ACG 3111 AND ACG 3401", "Corequisites": "NONE", "Course Description": "INTRODUCTION TO PRINCIPLES OF AUDITING  AND OTHER ASSURANCE SERVICES WITH AN EMPHASIS ON ATTESTATION STANDARDS AND ETHICAL REQUIREMENTS PROMULGATED BY THE AMERICAN INSTITUTE OF CERTIFIED PUBLIC ACCOUNTANTS.", "Objectives / Learning Outcome(s) / Major Topics": "DESCRIBE THE ROLE AND CONTRIBUTION OF THE AUDIT TO THE PROCESS OF COMMUNICATING FINANCIAL INFORMATION.\n    DESCRIBE AUDITING AND ATTESTATION STANDARDS AND PROCEDURES IN THE UNITED STATES (GAAS), WITH AN EMPHASIS ON STANDARDS APPLICABLE FOR NON-PUBLIC COMPANIES.\n    RECOGNIZE THE SITUATIONS WHEN PCAOB STANDARDS APPLY, AND RECOGNIZE THE SIGNIFICANT DIFFERENCES BETWEEN THE AICPA AND THE PCAOB REPORTING STANDARDS.\n    RECOGNIZE AND DISTINGUISH BETWEEN VARIOUS TYPES OF AUDIT, ASSURANCE, AND NON-ASSURANCE ACCOUNTING SERVICES.\n    UNDERSTAND AND DESCRIBE THE PURPOSE OF AN AUDIT, PREMISE OF AN AUDIT, AUDITORS RESPONSIBILITIES IN THE CONDUCT OF THE AUDIT, AND MANAGEMENT RESPONSIBILITIES RELATED TO FINANCIAL REPORTING AND THE AUDIT PROCESS.\n    DESCRIBE THE CONTENTS OF AN UNMODIFIED AUDIT REPORT.\n    RECOGNIZE THE SITUATIONS WHERE A MODIFIED AUDIT REPORT IS REQUIRED, AND RECOGNIZE THE NATURE OF THE MODIFICATION REQUIRED.\n    DESCRIBE THE STAGES AND COMPONENTS OF A RISK-BASED FINANCIAL STATEMENT AUDIT FOR A NONPUBLIC COMPANY INCLUDING AUDIT STRATEGY AND AUDIT PLANS.\n    DESCRIBE THE TYPES OF AUDIT RISK, THE FACTORS INFLUENCING THOSE RISKS, AND THE RISK ASSESSMENT PROCEDURES PERFORMED TO ASSESS THOSE RISKS.\n    EXPLAIN THE RELATIONSHIP BETWEEN AUDIT RISKS AND THE TIMING, NATURE, AND EXTENT OF AUDIT PROCEDURES.\n    DESCRIBE SPECIFIC EXAMPLES OF HOW CHANGES IN AUDIT RISK IMPACT TIMING, NATURE, AND EXTENT OF THE AUDIT PROCEDURES.\n    CREATE AUDIT PLAN, INCLUDING SPECIFIC AUDIT PROCEDURES, FOR THE AUDIT OF ONE OR MORE FINANCIAL STATEMENT BALANCES OR CLASSES OF TRANSACTIONS, E.G., THE CASH ACCOUNT.\n    SELECT, DESCRIBE, AND COMPLETE APPROPRIATE PROCEDURES TO TEST ASSERTIONS EMBODIED FINANCIAL STATEMENT ACCOUNT OR CLASS OF TRANSACTIONS, E.G., ACCOUNTS RECEIVABLE.\n    MAKE AUDIT DECISIONS AND REACH CONCLUSIONS BASED ON THE RESULTS OF AUDITING PROCEDURES PERFORMED.\n    APPLY CRITICAL THINKING SKILLS TO AUDITING PROBLEMS BY IDENTIFYING THE PROBLEM OR ISSUE, EVALUATING ALTERNATIVES, AND MAKING APPROPRIATE RECOMMENDATIONS.\n    APPLY CRITICAL THINKING SKILLS TO POTENTIAL ETHICAL DILEMMAS BY RECOGNIZING ETHICAL ISSUES THAT OCCUR IN AUDITING, EVALUATING ALTERNATIVE COURSES OF ACTIONS, AND REACHING A DECISION BY APPLYING AT LEAST ONE ETHICAL DECISION MODEL AND THE AICPA CODE OF CONDUCT.\n\nTOPICS \n\nTHE NATURE AND ENVIRONMENT OF ASSURANCE SERVICES\n\nAUDIT PLANNING\n\nRISK ASSESSMENT AND MATERIALITY\n\nAUDIT EVIDENCE\n\nAUDIT DOCUMENTATION\n\nAUDIT PROCEDURES FOR SELECTED BUSINESS CYCLES\n\nAUDIT REPORTS\n\nPROFESSIONAL RESPONSIBILITIES AND CODE OF PROFESSIONAL CONDUCT", "Textbook(s)": "AUDITING, 19E, BY WHITTINGTON AND PANY, MCGRAW HILL, 2014 (OR SIMILAR CURRENT TEXT)", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}