{"Course ID": "146084", "Institution": "UWF - UNIVERSITY OF WEST FLORIDA", "Course Name": "ACG 4201 - ADVANCED FINANCIAL ACCOUNTING", "Course Title": "ADVANCED FINANCIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "ADVANCED ACCOUNTING I(3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2007", "Effective Date": "01/10/2022", "Discontinue Date": "", "Date SCNS Approved": "1/11/2022", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 3111 INTERMEDIATE FINANCIAL ACCOUNTING II WITH A MINIMUM GRADE OF C.", "Corequisites": "NONE", "Course Description": "PROBLEMS IN EXTERNAL FINANCIAL REPORTING INCLUDING BUSINESS COMBINATIONS AND CONSOLIDATED FINANCIAL STATEMENTS, FOREIGN OPERATIONS, AND PARTNERSHIPS. OFFERED CONCURRENTLY WITH ACG 5205; ACG 5205 INCLUDES  ADDITIONAL LEARNING OBJECTIVES NOT INCLUDED IN ACG 4201. WORK. CREDIT FOR BOTH ACG 4201 AND ACG 5205 IS NOT PERMITTED.", "Objectives / Learning Outcome(s) / Major Topics": "STUDENT LEARNING OUTCOMES (SLO'S)\t\nCOMPARE AND CONTRAST THE ACCOUNTING FOR AN ACQUISITION OF NET ASSETS AND A CONTROLLING INTEREST IN THE STOCK OF A COMPANY\nDETERMINE THE COMPONENTS OF CONSOLIDATED FINANCIAL STATEMENTS USING THE PRINCIPLES OF CONSOLIDATION\nCRITIQUE INTRA-ENTITY TRANSACTIONS AND PREPARE ELIMINATION ENTRIES RELATED TO INTRA-ENTITY TRANSACTIONS\nANALYZE FOREIGN CURRENCY TRANSACTIONS AND FOREIGN CURRENCY HEDGES AND PREPARE APPROPRIATE JOURNAL ENTRIES \nRECONSTRUCT FOREIGN FINANCIAL STATEMENTS INTO US DOLLAR BASED FINANCIAL STATEMENTS UNDER VARIOUS SCENARIOS\nDEVISE THE APPROPRIATE ACCOUNTING TREATMENT OF VARIOUS PARTNERSHIP ACTIVITIES AND CHANGES\nADDITIONAL SLO FOR ACG5205: COMPILE A COMPARISON AND CONTRAST US GAAP AND INTERNATIONAL FINANCIAL ACCOUNTING STANDARDS RELATED TO CONSOLIDATED FINANCIAL STATEMENTS IN A RESEARCH STUDY.\n\nTOPICS\t\nTHE EQUITY METHOD OF ACCOUNTING FOR INVESTMENTS\nCONSOLIDATION OF FINANCIAL INFORMATION\nCONSOLIDATIONS: SUBSEQUENT TO THE DATE OF ACQUISITION\nCONSOLIDATED FINANCIAL STATEMENTS AND OUTSIDE OWNERSHIP\nCONSOLIDATED FINANCIAL STATEMENTS: INTRA-ENTITY ASSET TRANSACTIONS\nFOREIGN CURRENCY TRANSACTIONS AND HEDGING FOREIGN EXCHANGE RISK\nTRANSLATION OF FOREIGN CURRENCY FINANCIAL STATEMENTS\nPARTNERSHIPS: FORMATION AND OPERATION\nPARTNERSHIPS: TERMINATION AND LIQUIDATION", "Textbook(s)": "TBA", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}