{"Course ID": "220744", "Institution": "EWU - EDWARD WATERS UNIVERSITY", "Course Name": "ACG 3105 - FINANCIAL ACCOUNTING AND REPORTING", "Course Title": "FINANCIAL ACCOUNTING AND REPORTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "FINANCIAL ACCOUNTING AND REPORTING", "Lab Code": " ", "Honors Course": "NO", "Add Date": "01/01/2017", "Effective Date": "01/01/2017", "Discontinue Date": "", "Date SCNS Approved": "9/21/2017", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2021 & ACG 2071", "Corequisites": "NONE", "Course Description": "THIS COURSE PROVIDES AN IN-DEPTH STUDY OF FINANCIAL-REPORTING CONCEPTS AND GENERALLY ACCEPTED PRACTICE, INCLUDING AN OVERVIEW OF THE ACCOUNTING-CYCLE ASSETS AND NON-CURRENT ASSETS. EMPHASIS IS PLACED ON ANALYZING FINANCIAL EVENTS AND THE CONSEQUENCES OF FINANCIAL-REPORTING ALTERNATIVES. THIS COURSE COVERS THE KNOWLEDGE AND UNDERSTANDING OF THE FINANCIAL REPORTING FRAMEWORK USED BY BUSINESSES, NOT-FOR-PROFIT, AND GOVERNMENT ENTITIES. THE FINANCIAL REPORTING FRAMEWORKS COVERED IN THIS COURSE INCLUDE THOSE ISSUED BY THE FINANCIAL ACCOUNTING STANDARDS BOARD (FASB), THE INTERNATIONAL ACCOUNTING STANDARDS BOARD (IASB), THE SECURITIES AND EXCHANGE COMIMSSION (SEC), AND THE GOVERNMENTAL ACCOUNTING STANDARDS BOARD (GASB). IT IS A CONTINUATION OF AN INTRODUCTORY STUDY OF ACCOUNTING THEORY GOVERNING PREPARATION OF FINANCIAL STATEMENTS. THE COURSE COVERS THE CONCEPTUAL FRAMEWORK, DEVELOPMENT OF ACCOUNTING STANDARDS, AND THE RECORDING AND REPORTING PROCESS, USING THE VARIOUS FINANCIAL STATEMENTS.", "Objectives / Learning Outcome(s) / Major Topics": "THE COURSE IS DESIGNED FOR STUDENTS WHO HAVE A SOLID UNDERSTANDING OF GENERALLY ACCEPTED ACCOUNTING PRINCIPLES AND ARE INTERESTED IN PURSUING A CAREER IN ACCOUNTING SUCH AS AUDITING, TAXATION, MANAGEMENT CONSULTANCY, FINANCIAL ACCOUNTING, COST ACCOUNTING, GOVERNMENT ACCOUNTING, AND MORE. THE COURSE IS DESIGNED TO DEVELOP SKILLS IN INTERPRETING AND ANALYZING THE FINANCIAL REPORTS PREPARED BY FIRMS FOR INVESTORS AND CREDITORS. ALSO, THE COURSE WILL ALSO FOCUS ON DEVELOPING A WORKING KNOWLEDGE AND UNDERSTANDING OF GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP), THEORIES, CONCEPTS AND VARIOUS METHODS OF ACCOUNTING MEASUREMENT AND VALUATION. AFTER SUCCESSFULLY COMPLETING THIS COURSE, STUDENTS WILL BE ABLE TO: \nAPPLY ACCOUNTING THEORY TO CASES AND PROBLEMS SIMILAR TO THOSE FOUND ON THE CPA EXAM. \nDEMONSTRATE PROFICIENCY IN RESEARCHING TOPICS RELATING TO BUSINESS SITUATIONS. \nUSE EFFECTIVE WRITTEN COMMUNICATIONS SKILLS IN CREATING FINANCIAL ACCOUNTING REPORTS. \nINTEGRATE CRITICAL THINKING AND PROBLEM SOLVING SKILLS IN DEVELOPING SOLUTIONS TO COMPLEX ACCOUNTING PROBLEMS.\nDEVELOP A COMPETENCY FOR THE INFORMATION PROVIDED BY FINANCIAL STATEMENTS AND THEIR USE IN PERFORMANCE ASSESSMENT AND DECISION-MAKING PROCESSES\nASSESS  THE QUALITY OF EARNINGS AND EARNINGS PERSISTENCE\nREFINE UNSTRUCTURED PROBLEM-SOLVING SKILLS AND THE ABILITY TO APPLY LEARNED PRINCIPLES TO NEW SITUATIONS INVOLVING MULTIPLE ISSUES\nUNDERSTAND AND APPRECIATE THE STRENGTHS AND LIMITATIONS OF CORPORATE FINANCIAL REPORTING.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}