{"Course ID": "220977", "Institution": "EWU - EDWARD WATERS UNIVERSITY", "Course Name": "ACG 2022 - FINANCIAL ACCOUNTING II", "Course Title": "FINANCIAL ACCOUNTING II", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "ACCOUNTING PRIN-(CONDENSED)(4 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "01/01/2017", "Effective Date": "01/01/2017", "Discontinue Date": "", "Date SCNS Approved": "10/30/2017", "Term Type": "SEMESTER", "Course Credits": "4", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2021", "Corequisites": "NONE", "Course Description": "THIS COURSE IS A CONTINUATION OF PRINCIPLES OF ACCOUNTING I, WITH EMPHASIS ON PARTNERSHIPS, CORPORATIONS, FINANCIAL ANALYSIS, AND MANAGERIAL ACCOUNTING. THE CONTENTS TO BE COVERED INCLUDEPLANT ASSETS, NATURAL RESOURCES AND INTANGIBLES; CURRENT LIABILITIES AND PAYROLLS, CORPORATE ORGANIZATION AND OPERATIONS, PARTNERSHIP ACCOUNTING, EARNINGS PER SHARE AND DIVIDENDS, LONG-TERM OBLIGATIONS AND INVESTMENTS, STATEMENT OF CASH FLOWS, ANALYSIS OF FINANCIAL STATEMENTS, BUDGETING AND MANAGERIAL DECISION-MAKING.", "Objectives / Learning Outcome(s) / Major Topics": "AT THE END OF THE COURSE, STUDENTS WHO COMPLETED ALL ASSIGNMENTS AND PARTICIPATED IN CLASS AND GROUP DISCUSSIONS SHOULD BE ABLE TO:\nUNDERSTAND THE CONCEPT OF FIXED ASSETS AND METHODS OF DEPRECIATION.\nUNDERSTAND BASIC CATEGORIZING AND RECORDING CURRENT LIABILITIES AND PAYROLL ACCOUNTING.\nUNDERSTAND HOW TO ACCOUNT FOR PARTNERSHIP AND CORPORATE ACTIVITIES. \nUNDERSTAND HOW TO ACCOUNT FOR BONDS AND OTHER LONG-TERM INVESTMENTS. \nUNDERSTAND HOW TO ANALYZE FINANCIAL STATEMENTS, PREPARE AND INTERPRET BUDGETS, AND FORECAST PROFIT AND BREAK EVEN. \nUNDERSTAND THE IMPORTANCE OF INTEGRITY, OBJECTIVITY AND ETHICS IN BUSINESS. \nPOSSESS THE ABILITY TO PROFICIENTLY USE THE ACCOUNTING KNOWLEDGE AND SKILLS ACQUIRED IN THE COURSE..\nPREPARE, REVIEW, AND ANALYZE FINANCIAL STATEMENTS.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}