{"Course ID": "226237", "Institution": "EWU - EDWARD WATERS UNIVERSITY", "Course Name": "ACG 2021 - FINANCIAL ACCOUNTING I", "Course Title": "FINANCIAL ACCOUNTING I", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "ACCOUNTING PRIN-(CONDENSED)(3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "01/01/2017", "Effective Date": "01/01/2017", "Discontinue Date": "", "Date SCNS Approved": "4/10/2018", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE PROVIDES AN UNDERSTANDING OF THE FUNDAMENTALS OF \nACCOUNTING INCLUDING ADJUSTING ENTRIES, INVENTORIES, AND THE FINANCIAL \nSTATEMENTS.  IT IS AN INTRODUCTION TO ACCOUNTING PRINCIPLES, EMPHASIZING\n ON THE OPERATION OF A BUSINESS AS A SOLE PROPRIETORSHIP OR CORPORATION. \nTHE COURSE COVERS THE COMPLETE ACCOUNTING CYCLE FOR MERCHANDISING \nAND SERVICE ACTIVITIES. STUDENTS LEARN THE IMPORTANCE OF THE GENERALLY \nACCEPTED ACCOUNTING PRINCIPLES (GAAP), AS WELL AS PREPARING JOURNAL \nENTRIES, LEDGER, AND TRIAL BALANCE.", "Objectives / Learning Outcome(s) / Major Topics": "PURPOSE: THE PURPOSE OF THIS COURSE IS TO TEACH STUDENTS HOW TO PREPARE AND ANALYZE ACCOUNTING INFORMATION AS A MEASUREMENT SYSTEM THAT IS USED TO IDENTIFY, RECORD, AND COMMUNICATE RELEVANT INFORMATION FOR BETTER DECISION-MAKING.\n\nCOURSE OBJECTIVES:  AT THE END OF THE COURSE, STUDENTS WHO COMPLETED ALL ASSIGNMENTS AND PARTICIPATED IN CLASS AND GROUP DISCUSSIONS SHOULD BE ABLE TO:\n•\tDISCUSS THE TYPES OF ORGANIZATIONS THAT USE ACCOUNTING TO GENERATE INFORMATION ABOUT THEIR BUSINESS ACTIVITIES.\n•\tDESCRIBE THE PURPOSE OF ACCOUNTING AND ITS ROLE IN BOTH INTERNAL AND EXTERNAL BUSINESS TRANSACTIONS.\n•\tDESCRIBE THE REASONS FOR THE IMPORTANCE OF ETHICS IN ACCOUNTING\n•\tPREPARE BUSINESS TRANSACTIONS TO DETERMINE THEIR EFFECTS ON THE ACCOUNTING EQUATION.\n•\tPREPARE, REVIEW, AND ANALYZE FINANCIAL STATEMENTS.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}