{"Course ID": "217654", "Institution": "ERAU - EMBRY-RIDDLE AERONAUTICAL UNIVERSITY", "Course Name": "ASC 3479 - HUMAN FACTORS AND SYSTEM SAFETY", "Course Title": "HUMAN FACTORS AND SYSTEM SAFETY", "Discipline": "128 - AERONAUTICAL SCIENCE", "Prefix": "ASC - AVIATION SCIENCE: GENERAL", "Level": "3", "Statewide Course": "HUMAN FACTORS AND SYSTEM SAFETY", "Lab Code": " ", "Honors Course": "NO", "Add Date": "09/22/2016", "Effective Date": "09/22/2016", "Discontinue Date": "", "Date SCNS Approved": "10/31/2016", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "HF 300 HUMAN FACTORS I: PRINCIPLES & FUNDAMENTALS", "Corequisites": "NONE", "Course Description": "THIS COURSE EMPHASIZES THE INTEGRATION OF HUMAN FACTORS IN ALL PHASES OF A SYSTEM'S LIFE-CYCLE. ACCIDENT PREVENTION, BEGINNING WITH SYSTEMS ENGINEERING TOGETHER WITH SOUND MANAGEMENT, ARE COMBINED IN THIS COURSE TO ENABLE THE STUDENT TO FULLY COMPREHEND THE HUMAN'S VITAL ROLES IN PREVENTING ACCIDENTS. THE TOTAL PROGRAM, FROM BASIC DESIGN CONCEPTS THROUGH TESTING, MAINTENANCE/SYSTEMS MANAGEMENT, AND OPERATIONAL EMPLOYMENT, IS FULLY EXAMINED AND EVALUATED.", "Objectives / Learning Outcome(s) / Major Topics": "THE GOAL OF THIS COURSE IS TO EXPOSE THE STUDENT TO SYSTEMIC VIEW OF HOW HUMAN FACTORS ENGINEERING RELATES TO SYSTEMS. SPECIFICALLY IT WILL REQUIRE THE STUDENT TO READ, UNDERSTAND, AND BE ABLE TO APPLY THE CONCEPTS, THEORIES, AND PRINCIPLES OF SYSTEMS PSYCHOLOGY TO AVIATION AND AEROSPACE SYSTEMS. THE STUDENT WILL BE REQUIRED TO REVIEW THE ASSUMPTIONS AND LIMITATIONS OF THE ANALYTIC TOOLS USED TO INCORPORATE PEOPLE INTO COMPLEX SYSTEMS INCLUDING SYSTEMS TEST AND EVALUATION TOOLS. THIS COURSE IS EXPECTED TO PROMOTE THE APPLICATION OF HUMAN FACTORS CONCEPTS TO THE ANALYSIS, DESIGN, AND EVALUATION OF SYSTEM SAFETY. THIS WILL BE DONE BY EXPOSING STUDENTS TO THE RELEVANT PROCEDURES, TOOLS, AND ISSUES INVOLVED IN SYSTEM SAFETY.\n\nLEARNING OUTCOMES:\n\n1.DESCRIBE THE THEORETICAL UNDERPINNINGS OF SYSTEMS PSYCHOLOGY.\n2.IDENTIFY SYSTEMIC ISSUES AND PROBLEMS ADDRESSED BY THE SYSTEMS PSYCHOLOGY RESEARCHERS AND PRACTITIONERS.\n3.  READ AND UNDERSTAND THE KEY SYSTEMS PSYCHOLOGY RESEARCH PAPERS.\n4.   PERFORM RESEARCH ADDRESSING SYSTEMS PSYCHOLOGY ISSUES UTILIZING RELEVANT HUMAN FACTORS, EXPERIMENTAL, COGNITIVE, AND PERCEPTUAL PSYCHOLOGY LITERATURE.\n5.  DEMONSTRATE THE ABILITY TO CRITICALLY DISCUSS DESIGN AND EVALUATION FROM A SYSTEMS PERSPECTIVE.\n6.   DEMONSTRATE THE ABILITY TO MAKE A PROFESSIONAL QUALITY PRESENTATION (S) ADDRESSING SYSTEMS PSYCHOLOGY BASED ON THE RELEVANT THEORY AND RESEARCH.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}