{"Course ID": "158915", "Institution": "PSC - POLK STATE COLLEGE", "Course Name": "ACG 2072 - ACCOUNTING FOR PROFESSIONALS", "Course Title": "ACCOUNTING FOR PROFESSIONALS", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "COST ACCOUNTING FOR BUSINESS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "02/08/2008", "Effective Date": "02/08/2008", "Discontinue Date": "", "Date SCNS Approved": "3/4/2008", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.A.S.A.S.", "Prerequisites": "MAT 1033 OR MTB 1103 OR APPROPRIATE PLACEMENT SCORE", "Corequisites": "NONE", "Course Description": "THIS IS A SURVEY COURSE OF FINANCIAL ACCOUNTING WITH THE MAJOR EMPHASIS ON THE STUDY OF COST ACCOUNTING FOR MANUFACTURING AND NON-MANUFACTURING ENTITIES.  STUDENTS WILL STUDY DEBITS, CREDITS, JOURNAL ENTRIES, AND PREPARATION OF FINANCIAL STATEMENTS.  STUDY OF COST ACCOUNTING WILL CONCENTRATE ON COST TERMINOLOGY AND CONCEPTS.", "Objectives / Learning Outcome(s) / Major Topics": "POLK COMMUNITY COLLEGE IS QUALITY-DRIVEN EDUCATIONAL INSTITUTION PROVIDING DEGREE, CAREER, AND LIFELONG LEARNING PROGRAMS WITHIN AN ENVIRONMENT OF EXCELLENCE AND COMMITMENT TO STUDENT SUCCESS.  AS SUCH, PCCS A.S. DEGREE PROGRAM OUTCOMES ADDRESS COMPETENCE IN CAREER AREAS.  A PRIMARY FOCUS OF THIS COURSE IS COMPETENCE RELATED TO THE FOLLOWING PROGRAM OUTCOME(S):  APPLY ACCOUNTING CONCEPTS IN ORDER TO CONDUCT PRICE-COST ANALYSES AND MAKE APPROPRIATE PURCHASING AND INVENTORY CONTROL DECISIONS.\n\nCOURSE OBJECTIVES:\nUPON SUCCESSFUL COMPLETION OF THIS COURSE, STUDENTS WILL BE ABLE TO:\nDEFINE BASIC TERMS AND CONCEPTS USED IN ACCOUNTING THEORY. \nDEVELOP AN UNDERSTANDING OF VARIOUS BUSINESS TRANSACTIONS AND HOW THESE TRANSACTIONS ARE ACCOUNTED FOR BY BUSINESS ENTITIES\nUNDERSTAND THE FORMULATION OF FINANCIAL STATEMENTS AND HOW THEY ARE UTILIZED BY BUSINESS ENTITIES\nUNDERSTAND THE NATURE OF COSTS \nUNDERSTAND THE USES OF COST ALLOCATION \nDEMONSTRATE THE ABILITY TO USE COST INFORMATION TO MAKE A VARIETY OF MANAGEMENT DECISIONS", "Textbook(s)": "SURVEY OF ACCOUNTING, CARL S. WARREN  THIRD EDITION THOMPSON SOUTH WESTERN\n\nPRINCIPLES OF COST ACCOUNTING, EDWARD J. VANDERBECK 14TH EDITION THOMPSON SOUTH WESTERN", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}