{"Course ID": "198840", "Institution": "PHSC - PASCO-HERNANDO STATE COLLEGE", "Course Name": "ACG 2450 - MICROCOMPUTERS IN ACCOUNTING", "Course Title": "MICROCOMPUTERS IN ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "BASIC COMPUTER AUGMENTED ACCOUNTING", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/20/2012", "Effective Date": "07/01/2021", "Discontinue Date": "", "Date SCNS Approved": "6/12/2012", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.", "Prerequisites": "ACG 2021", "Corequisites": "NONE", "Course Description": "THIS COURSE PROVIDES AN OVERVIEW OF ACCOUNTING SOFTWARE APPLICATIONS IN BUSINESS ORGANIZATIONS. THE STUDENT WILL PROGRESSIVELY WORK THROUGH AN ACCOUNTING CYCLE FOR A BUSINESS USING POPULAR ACCOUNTING SOFTWARE. SPECIFIC APPLICATIONS WILL INCLUDE THE DESIGN AND SETUP OF AN ACCOUNTING INFORMATION SYSTEM FOR A NEW COMPANY, RECORDING ACCOUNTING TRANSACTIONS, AND THE CREATION AND ANALYSIS OF VARIOUS REPORTS AND FINANCIAL STATEMENTS. TRANSACTIONAL AND REPORTING AREAS WILL INCLUDE BANKING, CUSTOMERS, SALES, VENDORS, PURCHASES, INVENTORY, EMPLOYEES, AND PAYROLL. THE COURSE IS TAUGHT USING QUICKBOOKS ONLINE ACCOUNTING SOFTWARE AND WILL PREPARE STUDENTS TO SIT FOR THE INTUIT QUICKBOOKS CERTIFIED USER EXAMINATION FOR QUICKBOOKS ONLINE.  45 CLASS HOURS.", "Objectives / Learning Outcome(s) / Major Topics": "COURSE OBJECTIVES:   \n\n1.\tTHE STUDENT WILL BE ABLE TO UTILIZE KNOWLEDGE OF THE IMPORTANCE OF MICROCOMPUTERS IN ACCOUNTING. \nA.\tLIST AND EXPLAIN THE BASIC HARDWARE AND SOFTWARE COMPONENTS NEEDED FOR A MICROCOMPUTER ACCOUNTING SYSTEM. \nB.\tEXPLAIN THE PRACTICAL GUIDELINES FOR PURCHASING ACCOUNTING SOFTWARE, MAKING CONVERSIONS TO THE NEW SOFTWARE AND ESTABLISHING CONTROLS. \nC.\tEXPLAIN THE DIFFERENCES AND SIMILARITIES BETWEEN A MANUAL ACCOUNTING INFORMATION SYSTEM AND A COMPUTERIZED ACCOUNTING INFORMATION SYSTEM. \n\n2.\tTHE STUDENT WILL BE ABLE TO UTILIZE KNOWLEDGE OF MICROCOMPUTER ACCOUNTING SOFTWARE. \nA.\tDEMONSTRATE THE ABILITY TO PROPERLY DESIGN THE ACCOUNTING INFORMATION SYSTEM OF A NEW OR EXISTING BUSINESS.  \nB.\tDEMONSTRATE THE ABILITY TO RECORD ACCOUNTING TRANSACTIONS PROPERLY ACCORDING TO SPECIFIC ACCOUNTING SOFTWARE APPLICATION INSTRUCTIONS.  \nC.\tDEMONSTRATE THE ABILITY TO POST ACCOUNTING TRANSACTIONS TO ACCOUNTS IN THE GENERAL LEDGER AND SUBSIDIARY LEDGERS. \nD.\tDEMONSTRATE THE ABILITY TO PREPARE A GENERAL JOURNAL, GENERAL LEDGER, TRIAL BALANCE, AND OTHER INFORMATIONAL SCHEDULES COMMON TO ACCOUNTANTS AND BUSINESS. \nE.\tDEMONSTRATE THE ABILITY TO PREPARE AND ENTER APPROPRIATE ADJUSTING JOURNAL ENTRIES. \nF.\tDEMONSTRATE THE ABILITY TO PREPARE A PAYROLL FOR A SERIES OF PAY PERIODS INCLUDING THE PREPARATION OF (A) PAYROLL REGISTER, (B) INDIVIDUAL EARNINGS, AND (C) PAY CHECKS. \nG.\tDEMONSTRATE THE ABILITY TO COMPLETE QUARTERLY AND ANNUAL FEDERAL PAYROLL TAX RETURNS INCLUDING (A) FORM 941 AND (B) FORM 940. \nH.\tDEMONSTRATE THE ABILITY TO ENTER SALES AND PURCHASE ACCOUNTING TRANSACTIONS LEADING TO PROPER ENTRIES AND OPERATION OF A PERPETUAL INVENTORY SYSTEM\nI.\tDEMONSTRATE THE ABILITY TO OPERATE VARIOUS AUXILIARY ACCOUNTING MODULES INCLUDING BANKING, CUSTOMERS, SALES, VENDORS, PURCHASES, INVENTORY, EMPLOYEES, JOB COST CENTERS, ORDER PROCESSING, INSURANCE, AND DEPRECIATION.\nJ.\tDEMONSTRATE THE ABILITY TO MAINTAIN PROPERTY, PLANT, AND EQUIPMENT ACCOUNTING RECORDS INCLUDING PURCHASES AND DISPOSITIONS.  \nK.\tDEMONSTRATE THE ABILITY TO PROPERLY CLOSE THE ACCOUNTING RECORDS AT THE END OF AN ACCOUNTING PERIOD.  \n\n3.\tSTUDENTS WILL BE ABLE TO UTILIZE KNOWLEDGE OF MICROCOMPUTER ACCOUNTING SOFTWARE IN PREPARING REPORTS AND MAKING BUSINESS DECISIONS. \nA.\tDEMONSTRATE THE ABILITY TO PREPARE AND PRINT THE FOUR BASIC FINANCIAL STATEMENTS IN ACCORDANCE WITH GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP). \nB.\tDEMONSTRATE THE ABILITY TO USE RESEARCH TECHNIQUES TO FIND DETAILED ACCOUNTING INFORMATION WITHIN THE COMPUTERIZED ACCOUNTING INFORMATION SYSTEM. \nC.\tDEMONSTRATE THE ABILITY TO EXAMINE ALL REPORTS AND MAKE NECESSARY CORRECTIONS. \nD.\tDEMONSTRATE THE ABILITY TO OPERATE VARIOUS AUXILIARY ACCOUNTING MODULES IN APPLYING FINANCIAL STATEMENT ANALYSIS TECHNIQUES.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}