{"Course ID": "31046", "Institution": "PHSC - PASCO-HERNANDO STATE COLLEGE", "Course Name": "ACG 2071 - PRINCIPLES OF MANAGERIAL ACCOUNTING", "Course Title": "PRINCIPLES OF MANAGERIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "MANAGERIAL ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "08/01/2001", "Discontinue Date": "", "Date SCNS Approved": "12/8/1992", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.", "Prerequisites": "ACT 2021", "Corequisites": "NONE", "Course Description": "THE EMPHASIS OF THIS COURSE IS ON MANAGERIAL ACCOUNTING CONCEPTS AND SYSTEMS.  TOPICS INCLUDE PLANNING AND CONTROL, DECENTRALIZED OPERATIONS, ANALYSES FOR DECISION-MAKING, FINANCIAL ANALYSIS FOR MANAGEMENT, AND MODERN USES OF MANAGERIAL ACCOUNTING.", "Objectives / Learning Outcome(s) / Major Topics": "MAJOR LEARNING OUTCOMES:\n1.DISTINGUISH BETWEEN FINANCIAL ACCOUNTING AND MANAGERIAL ACCOUNTING.\n2.PERFORM FUNCTIONS RELATED TO VARIOUS ASPECTS OF MANAGERIAL ACCOUNTING.  SUCH FUNCTIONS TO INCLUDE THOSE ASSOCIATED WITH COST ACCOUNTING, PLANNING AND CONTROL, AND DECENTRALIZED OPERATIONS.\n3.PREPARE MANAGEMENT REPORTS.\n4.IDENTIFY AND CORRECTLY APPLY TERMINOLOGY RELATED TO MANAGERIAL ACCOUNTING.\n5.PERFORM FINANCIAL STATEMENT ANALYSIS AND OTHER ANALYTICAL PROCEDURES RELATED TO DECISION MAKING.\n6.IDENTIFY AND CORRECTLY APPLY FUNDAMENTALS OF FOREIGN EXCHANGE, INTERNATIONAL ACCOUNTING STANDARDS, AND CONSOLIDATED REPORTS.\n\nCOURSE OBJECTIVES:\n1.THE STUDENT WILL DEMONSTRATE THE ABILITY TO DISTINGUISH BETWEEN FINANCIAL ACCOUNTING AND MANAGERIAL ACCOUNTING, AS MEASURED BY THE ABILITY TO:\n1.1CHOOSING THE APPROPRIATE RESPONSE WHEN GIVEN QUESTIONS THAT REQUIRE THE ABILITY TO DISTINGUISH BETWEEN FINANCIAL AND MANAGERIAL ACCOUNTING TOPICS OR REPORTS.\n2.THE STUDENT WILL DEMONSTRATE THE ABILITY TO PERFORM FUNCTIONS RELATED TO VARIOUS ASPECTS OF MANAGERIAL ACCOUNTING.  SUCH FUNCTIONS TO INCLUDE THOSE ASSOCIATED WITH COST ACCOUNTING, PLANNING AND CONTROL, AND DECENTRALIZED OPERATIONS, AS MEASURED BY THE ABILITY TO:\n2.1PERFORM ANALYSIS OF NON-FINANCIAL DATA SUCH AS HOTEL OCCUPANCY RATES.\n2.2CALCULATE TOTAL MANUFACTURING COSTS.\n2.3CALCULATE COST OF GOODS MANUFACTURED.\n2.4CALCULATE COST OF GOODS SOLD.\n2.5CALCULATE NET INCOME OR LOSS.\n2.6CALCULATE UNIT COST OF PRODUCTION.\n2.7CALCULATE AND APPLY OVERHEAD RATES.  INDICATE UNDER OR OVER APPLIED AND CORRECT DISPOSITION.\n2.8DETERMINE BALANCES IN VARIOUS MANUFACTURING INVENTORY ACCOUNTS.\n2.9CALCULATE UNITS TO BE ACCOUNTED FOR, STARTED AND COMPLETED, AND EQUIVALENT UNITS OR PRODUCTION.\n2.10USE BACKFLUCH COSTING TO ACCOUNT FOR RAW IN PROCESS, FINISHED GOODS AND COST OF GOODS SOLD.\n2.11CALCULATE BREAK-EVEN POINT FOR UNITS AND IN DOLLARS.  CALCULATE AMOUNTS REQUIRED FOR A SPECIFIC PROFIT LEVEL.\n2.12CALCULATE BUDGETED AMOUNTS AS DIRECTED.\n2.13CALCULATE COSTS AND VARIANCES USING A STANDARD COST SYSTEM.  INDICATE AS FAVORABLE OR UNFAVORABLE.\n2.14PERFORM INCREMENTAL ANALYSIS FOR DECISIONS SUCH AS MAKE OR BUY, APPROPRIATE SPLIT-OFF POINT, AND DISCONTINUANCE OR OPERATIONS.\n2.15PERFORM CAPITAL BUDGETING ANALYSIS.\n2.16EVALUATE QUALITY AS A PERCENT OF SALES.  CALCULATE THE COSTS OF CONFORMANCE AND NONCONFORMANCE AS PERCENT OF SALES.\n2.17CALCULATE GAIN OR LOSS ON CURRENCY EXCHANGE.\n2.18PERFORM ELEMENTARY CONSOLIDATED STATEMENT ELIMINATIONS.\n3.THE STUDENT WILL DEMONSTRATE THE ABILITY TO PREPARE MANAGEMENT REPORTS, AS MEASURED BY THE ABILITY TO:\n3.1PREPARE REPORTS AS HOMEWORK ASSIGNMENTS.\n4.THE STUDENT WILL DEMONSTRATE THE ABILITY TO IDENTIFY AND CORRECTLY APPLY TERMINOLOGY RELATED TO MANAGERIAL ACCOUNTING, AS MEASURED BY THE ABILITY TO:\n4.1CORRECTLY USE TERMINOLOGY TO PERFORM CALCULATIONS AND PREPARE REPORTS AS DIRECTED.\n4.2ANSWER MULTIPLE-CHOICE AND MATCHING QUESTIONS.\n5.THE STUDENT WILL DEMONSTRATE THE ABILITY TO PERFORM FINANCIAL STATEMENT ANALYSIS AND OTHER ANALYTICAL PROCEDURES RELATED TO DECISION MAKING, AS MEASURED BY THE ABILITY TO:\n5.1PERFORM STANDARD FINANCIAL STATEMENT ANALYSIS.\n6.THE STUDENT WILL DEMONSTRATE THE ABILITY TO IDENTIFY AND CORRECTLY APPLY FUNDAMENTALS OF FOREIGN EXCHANGE, INTERNATIONAL ACCOUNTING STANDARDS, AND CONSOLIDATED REPORTS, AS MEASURED BY THE ABILITY TO:\n6.1CALCULATE GAIN OR LOSS ON CURRENCY EXCHANGE.\n6.2PERFORM ELEMENTARY CONSOLIDATED STATEMENT ELIMINATIONS.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}