{"Course ID": "226236", "Institution": "SFC - SANTA FE COLLEGE", "Course Name": "ACG 3111 - INTERMEDIATE ACCOUNTING 2", "Course Title": "INTERMEDIATE ACCOUNTING 2", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "INTERMEDIATE ACCOUNTING II(2 OF 2)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/20/2018", "Effective Date": "08/20/2018", "Discontinue Date": "", "Date SCNS Approved": "4/10/2018", "Term Type": "SEMESTER", "Course Credits": "4.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG3101", "Corequisites": "NONE", "Course Description": "THIS SECOND COURSE IN THE TWO COURSE INTERMEDIATE ACCOUNTING SEQUENCE EXPANDS ON THE TOPICS COVERED IN ACG3101 AND PRESENTS THEM WITHIN THE CONCEPTUAL FRAMEWORK DETERMINED BY GENERALLY ACCEPTED ACCOUNTING PRINCIPLES. THIS COURSE FOCUSES ON FINANCIAL ACCOUNTING AND THE USE OF GENERAL ACCEPTED ACCOUNTING PRINCIPLES IN THE PREPARATION OF FINANCIAL STATEMENTS. THE STUDY OF FINANCIAL ACCOUNTING THEORY AND PRACTICE RELATING TO THE FOLLOWING TOPICS: INVESTMENTS, CURRENT LIABILITIES & CONTINGENCIES, BONDS & LONG-TERM NOTES, LEASES, INCOME TAXES, PENSIONS & OTHER POSTRETIREMENT BENEFIT PLANS, SHAREHOLDERS’ EQUITY, SHARE-BASED COMPENSATION AND EARNINGS PER SHARE, ACCOUNTING CHANGES AND ERROR CORRECTIONS, THE STATEMENT OF CASH FLOWS. THE USE OF TECHNOLOGY AS WELL AS PRESENT VALUE AND FUTURE VALUE APPLICATIONS WILL ALSO BE EXAMINED.", "Objectives / Learning Outcome(s) / Major Topics": "1.\tCREATE AND INTERPRET FINANCIAL STATEMENTS USING GENERALLY ACCEPTED ACCOUNTING PRINCIPLES.\n2.\tUNDERSTAND THE PRIMARY DIFFERENCES BETWEEN GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP) IN THE UNITED STATES AND INTERNATIONAL FINANCIAL REPORTING STANDARDS (IFRS).\n3.\tCOMPREHEND AND APPLY TIME VALUE OF MONEY CONCEPTS TO VARIOUS ACCOUNTING MEASUREMENT AND REPORTING SITUATIONS. \n4.\tUTILIZE FINANCIAL RATIO ANALYSIS TECHNIQUES IN ORDER TO EVALUATE THE LIQUIDITY, LONG-TERM SOLVENCY, PROFITABILITY AND CASH FLOW ADEQUACY OF AN ORGANIZATION. \n5.\tUSE TECHNOLOGY TO SOLVE A VARIETY OF ACCOUNTING PROBLEMS", "Textbook(s)": "TBA", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}