{"Course ID": "226241", "Institution": "SFC - SANTA FE COLLEGE", "Course Name": "ACG 4501 - GOVERNMENTAL AND NOT-FOR-PROFIT ACCOUNTING", "Course Title": "GOVERNMENTAL AND NOT-FOR-PROFIT ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "GOV & INSTITUTIONAL ACC (3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/20/2018", "Effective Date": "08/20/2018", "Discontinue Date": "", "Date SCNS Approved": "4/10/2018", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG3101 AND ACG3111", "Corequisites": "NONE", "Course Description": "AN EXAMINATION OF BUDGETING, ACCOUNTING, REPORTING STANDARDS AND PRACTICES FOR GOVERNMENTAL, NOT-FOR-PROFIT ENTITIES, COLLEGES AND UNIVERSITIES, HOSPITALS, AND OTHER HEALTH CARE PROVIDERS", "Objectives / Learning Outcome(s) / Major Topics": "1.\tIDENTIFY AND EXPLAIN THE CHARACTERISTICS THAT DISTINGUISH GOVERNMENTAL, NOT-FOR-PROFIT ENTITIES, COLLEGES AND UNIVERSITIES, HOSPITALS, AND OTHER HEALTH CARE PROVIDERS FROM PROFIT ENTITIES.\n2.\tIDENTIFY THE AUTHORITATIVE BODIES RESPONSIBLE FOR SETTING FINANCIAL REPORTING STANDARDS FOR GOVERNMENTAL, NOT-FOR-PROFIT ENTITIES, COLLEGES AND UNIVERSITIES, HOSPITALS, AND OTHER HEALTH CARE PROVIDERS.\n3.\tCONTRAST AND COMPARE THE OBJECTIVES OF FINANCIAL REPORTING FOR GOVERNMENTAL, NOT-FOR-PROFIT ENTITIES, COLLEGES AND UNIVERSITIES, HOSPITALS, AND OTHER HEALTH CARE PROVIDERS.\n4.\tEXPLAIN HOW MANAGEMENT DISCUSSING AND ANALYSIS, BASIC FINANCIAL STATEMENTS, AND REPORTING SUPPLEMENTARY INFORMATION OF STATE AND LOCAL GOVERNMENTS RELATE TO THEIR COMPREHENSIVE ANNUAL FINANCIAL REPORTS.\n5.\tEXPLAIN THE DIFFERENT OBJECTIVES, MEASUREMENT FOCUS, AND BASIS OF ACCOUNTING OF THE GOVERNMENT-WIDE FINANCIAL STATEMENTS AND FUND FINANCIAL STATEMENTS OF STATE AND LOCAL GOVERNMENTS.", "Textbook(s)": "COPLEY: ESSENTIALS OF ACCOUNTING FOR GOVERNMENTAL AND NOT-FOR-PROFIT ORGANIZATIONS, 13E, MCGRAW HILL", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}