{"Course ID": "226255", "Institution": "SFC - SANTA FE COLLEGE", "Course Name": "ACG 3101 - INTERMEDIATE ACCOUNTING 1", "Course Title": "INTERMEDIATE ACCOUNTING 1", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "INTERMEDIATE ACCTING I(1 OF 2) 3 CREDITS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/21/2018", "Effective Date": "08/21/2018", "Discontinue Date": "", "Date SCNS Approved": "4/10/2018", "Term Type": "SEMESTER", "Course Credits": "4.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG2001, ACG2011, AND ACG2021", "Corequisites": "NONE", "Course Description": "THIS COURSE IS THE FIRST OF A TWO COURSE SEQUENCE THAT EXPANDS ON THE TOPICS COVERED IN ACG2001 & ACG2011 (ACCOUNTING PRINCIPLES I & II) AND ACG2021 (FINANCIAL ACCOUNTING) AND PRESENTS THEM WITHIN A CONCEPTUAL FRAMEWORK DETERMINED BY GENERALLY ACCEPTED ACCOUNTING PRINCIPLES. THIS COURSE FOCUSES ON THE OBJECTIVE OF FINANCIAL REPORTING AND THE USE OF GENERAL ACCEPTED ACCOUNTING PRINCIPLES IN THE PREPARATION OF FINANCIAL STATEMENTS. THE STUDY OF THE FINANCIAL ACCOUNTING ENVIRONMENT, THE DEVELOPMENT OF ACCOUNTING STANDARDS, ALONG WITH THE FINANCIAL ACCOUNTING THEORY AND PRACTICE ASSOCIATED WITH THE RECOGNITION AND MEASUREMENT OF MONETARY ASSETS, REVENUES, INVENTORIES, PLANT ASSETS, INTANGIBLE ASSETS. THE USE OF TECHNOLOGY AS WELL AS FUTURE VALUE AND PRESENT VALUE APPLICATIONS ARE ALSO EXAMINED.", "Objectives / Learning Outcome(s) / Major Topics": "1.\tUNDERSTAND AND DESCRIBE THE ACCOUNTING ENVIRONMENT AND THE PRIMARY OBJECTIVE OF FINANCIAL REPORTING. \n2.\tCOMPREHEND HOW TO APPLY GENERALLY ACCEPTED ACCOUNTING PRINCIPLES IN ORDER TO ANALYZE AND RECORD BUSINESS TRANSACTIONS AND PREPARE FINANCIAL STATEMENTS.\n3.\tUSE TECHNOLOGY AND AN UNDERSTANDING OF THE CONCEPTUAL FRAMEWORK TO INTERPRET, ANALYZE AND COMMUNICATE QUANTITATIVE DATA PERTAINING TO VARIOUS BALANCE SHEET ACCOUNTS.   \n4.\tUNDERSTAND THE PRIMARY DIFFERENCES BETWEEN GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP) IN THE UNITED STATES AND INTERNATIONAL FINANCIAL REPORTING STANDARDS (IFRS).\n5.\tUSE FINANCIAL RATIO ANALYSIS TECHNIQUES TO EVALUATE THE LIQUIDITY, LONG-TERM SOLVENCY AND PROFITABILITY OF AN ORGANIZATION.", "Textbook(s)": "TBA", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}