{"Course ID": "10514", "Institution": "SFSC - SOUTH FLORIDA STATE COLLEGE", "Course Name": "ACG 2450C - ACCOUNTING FOR THE MICROCOMPUTER", "Course Title": "ACCOUNTING FOR THE MICROCOMPUTER", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "BASIC COMPUTER AUGMENTED ACCOUNTING", "Lab Code": "COMBINED", "Honors Course": "NO", "Add Date": "", "Effective Date": "08/26/2013", "Discontinue Date": "", "Date SCNS Approved": "12/11/1985", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.A.A.", "Prerequisites": "ACG 2001 OR ACG 2021", "Corequisites": "NONE", "Course Description": "THIS COURSE OFFERS AN OVERVIEW OF ACCOUNTING SOFTWARE APPLICATIONS IN BUSINESS ORGANIZATIONS. YOU WILL PROGRESSIVELY WORK THROUGH ACCOUNTING CYCLES FOR SERVICE AND MERCHANDISING BUSINESSES USING THE POPULAR ACCOUNTING SOFTWARE QUICKBOOKS. TRANSACTIONAL AND REPORTING AREAS WILL INCLUDE BANKING, CUSTOMERS, SALES, VENDORS, PURCHASES, INVENTORY, EMPLOYEES, PAYROLL, AND TAX REPORTS. SPECIFIC APPLICATIONS WILL INCLUDE DESIGN AND SETUP OF AN ACCOUNTING SYSTEM FOR A NEW BUSINESS. YOU WILL RECORD TRANSACTIONS, CREATE VARIOUS REPORTS AND FINANCIAL STATEMENTS. FURTHER MANAGERIAL APPLICATION INCLUDES FINANCIAL STATEMENT ANALYSIS, BUDGETING, AND ESTIMATES.", "Objectives / Learning Outcome(s) / Major Topics": "UPON SUCCESSFUL COMPLETION OF THIS COURSE, YOU SHOULD BE ABLE TO:\n1.IDENTIFY KEY DIFFERENCES BETWEEN MANUAL AND COMPUTERIZED ACCOUNTING SYSTEMS;\n2.DEMONSTRATE HOW TO CARE FOR AND HANDLE THE COMPUTER HARDWARE AND SOFTWARE;\n3.ENTER DATA INTO THE PROPER JOURNALS AND LEDGERS;\nA.GENERAL JOURNAL\nB.ACCOUNTS RECEIVABLE JOURNAL\nC.AC COUNTS PAYABLE JOURNAL\nD.PAYROLL JOURNAL\nE.GENERAL LEDGER\n4.PERFORM THE NECESSARY OPERATING PROCEDURES IN THE ACCOUNTING CYCLE FOR A SERVICE BUSINESS;\n5.PERFORM THE NECESSARY OPERATING PROCEDURES IN THE ACCOUNTING CYCLE FOR A MERCHANDISING BUSINESS;\n6.PREPARE ADJUSTING, CLOSING AND REVERSING ENTRIES;\n7.DESCRIBE AND USE A VOUCHER SYSTEM;;\n8.ANALYZE FINANCIAL STATEMENTS AND UTILIZE MANAGERIAL BUDGETING AND ESTIMATE CONCEPTS\n9.SET UP A NEW COMPUTERIZED ACCOUNTING SYSTEM FOR A BUSINESS.", "Textbook(s)": "DONNA KAY, COMPUTER ACCOUNTING WITH QUICKBOOKS (CURRENT EDITION), MCGRAW HILL.", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}