{"Course ID": "151855", "Institution": "SFSC - SOUTH FLORIDA STATE COLLEGE", "Course Name": "ACG 2021 - FINANCIAL ACCOUNTING", "Course Title": "FINANCIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "ACCOUNTING PRIN-(CONDENSED)(3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "03/08/2007", "Effective Date": "03/08/2007", "Discontinue Date": "", "Date SCNS Approved": "3/21/2007", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.A.A.", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE IS AN ACCELERATED ALTERNATIVE OF ACG 2001 AND ACG 2011.  IT IS AN INTRODUCTION TO FINANCIAL ACCOUNTING PRINCIPLES AND PROCEDURES.  THE PREPARATION, ANALYSIS AND INTERPRETATION OF FINANCIAL STATEMENTS ARE EMPHASIZED.", "Objectives / Learning Outcome(s) / Major Topics": "THE STUDENT WILL BE ABLE TO:\n1.IDENTIFY, MEASURE AND COMMUNICATE ECONOMIC INFORMATION THROUGH THE PROCESS OF ACCOUNTING;\n2.INTERPRET AND EXPLAIN FINANCIAL STATEMENTS PREPARED ACCORDING TO GAAP (GENERALLY ACCEPTED ACCOUNTING PRINCIPLES);\n3.APPLY FINANCIAL ACCOUNTING CONCEPTS AND PRINCIPLES AS DIRECTED BY THE FASB (FINANCIAL ACCOUNTING STANDARDS BOARD);\n4.EXPLAIN THE SARBANES-OXLEY ACT OF 2002 AND ITS IMPACT ON BUSINESS AND ACCOUNTING;\n5.READ AN ANNUAL REPORT AND EXTRACT DATA PERTAINING TO ACCOUNTING CONCEPTS AND OBJECTIVES;\n6.PREPARE THE FINANCIAL STATEMENTS REQUIRED BY PUBLICLY HELD COMPANIES;\n7.COMPLETE ALL STEPS IN THE ACCOUNTING CYCLE INCLUDING ADJUSTING AND CLOSING ENTRIES;\n8.COMPUTE ENDING INVENTORY AND COST OF GOODS SOLD USING APPROVED ACCOUNTING METHODS;\n9.EXPLAIN THE COMPONENTS OF INTERNAL CONTROLS;\n10.EXPLAIN AND PERFORM CONTROLS OVER CASH;\n11.RECORD TRANSACTIONS AND MAINTAIN ACCOUNTS FOR LONG  INVESTMENTS AND RECEIVABLES;\n12.COMPUTE THE COST AND RECORD THE TRANSACTIONS FOR OPERATING ASSETS;\n13.COMPUTE AND RECORD THE SYSTEMATIC AND RELATIONAL ALLOCATION OF OPERATING ASSETS;\n14.PREPARE APPROPRIATE JOURNAL ENTRIES FOR CURRENT AND LONG-TERM LIABILITIES AND CONTINGENCIES;\n15.COMPUTE THE TIME VALUE OF MONEY;\n16.PREPARE, INTERPRET AND EXPLAIN THE COMPONENTS OF STOCKHOLDERS EQUITY; AND\n17.EVALUATE COMPANIES LIQUIDITY, PROFITABILITY, AND SOLVENCY USING RATIO ANALYSIS, HORIZONTAL AND VERTICAL ANALYSIS.", "Textbook(s)": "FINANCIAL ACCOUNTING  THE IMPACT ON DECISION MAKERS, PORTER AND NORTON, THOMSON PUBLISHING, 5TH EDITION (OR NEWEST EDITION) \nTHOMSON NOW:  HOMEWORK AND ONLINE LEARNING SYSTEM\nINTERNET ACCESS FOR COURSE MANAGEMENT SYSTEM AND THOMSON NOW", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}