{"Course ID": "191749", "Institution": "SFSC - SOUTH FLORIDA STATE COLLEGE", "Course Name": "ACG 3024 - ACCOUNTING FOR MANAGERS AND INVESTORS (NON-MAJORS)", "Course Title": "ACCOUNTING FOR MANAGERS AND INVESTORS (NON-MAJORS)", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "ACCTG: MANAGERS & INVESTORS(NON-MAJORS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/27/2012", "Effective Date": "08/19/2016", "Discontinue Date": "", "Date SCNS Approved": "1/10/2012", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "HIGHER LEVEL MATH WITH A GRADE OF C OR HIGHER.", "Corequisites": "NONE", "Course Description": "THIS COURSE ADDRESSES THE USE OF ACCOUNTING INFORMATION BY NON-FINANCIAL MANAGERS.  EMPHASIS IS PLACED ON THE INTERPRETATION OF ACCOUNTING INFORMATION AND THE LANGUAGE OF FINANCIAL ACCOUNTING TO EFFECTIVELY PARTICIPATE IN ACTIVITIES SUCH AS PLANNING, INVESTMENT, CONTROL, AND MANAGERIAL DECISION MAKING.", "Objectives / Learning Outcome(s) / Major Topics": "UPON SUCCESSFUL COMPLETION OF THIS COURSE, YOU SHOULD BE ABLE TO:\n1.EXAMINE THE BASIC CONCEPTS OF FINANCIAL AND MANAGERIAL ACCOUNTING; \n2.EXAMINE ETHICAL PRACTICES IN ACCOUNTING AND EXPLAIN THEIR SIGNIFICANCE IN ESTABLISHING A VIABLE FINANCIAL MANAGEMENT STRATEGY; \n3.PREPARE, ANALYZE, AND INTERPRET FINANCIAL STATEMENTS FOR VARIOUS ORGANIZATIONS; \n4.CALCULATE FINANCIAL RATIOS AS TOOLS FOR THE ANALYSIS OF FINANCIAL PERFORMANCE; \n5.PREPARE AND EXPLAIN AN OPERATING BUDGET AND A CAPITAL EXPENSE BUDGET; \n6.UTILIZE THE TOOLS OF ACCOUNTING TO SOLVE PROBLEMS AND MAKE MANAGERIAL DECISIONS; AND\n7.CORRELATE THE INTERRELATIONSHIP BETWEEN PLANNING, DIRECTING, BUDGETING, AND FINANCIAL CONTROLS.", "Textbook(s)": "EDMONDS, OLDS, MCNAIR, AND TSAY. SURVEY OF ACCOUNTING WITH CONNECT PLUS. LOOSE LEAF. MCGRAW-HILL. ISBN: 1259184854/9781259184857. 4TH EDITION.", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}