{"Course ID": "244923", "Institution": "SFSC - SOUTH FLORIDA STATE COLLEGE", "Course Name": "ACG 2100 - INTERMEDIATE ACCOUNTING I", "Course Title": "INTERMEDIATE ACCOUNTING I", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "INTERMEDIATE ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/21/2020", "Effective Date": "08/21/2020", "Discontinue Date": "", "Date SCNS Approved": "3/23/2020", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.A.A.", "Prerequisites": "ACG 2011 OR ACG 2021 WITH A GRADE OF C OR HIGHER", "Corequisites": "NONE", "Course Description": "THIS COURSE IS A REVIEW OF ACCOUNTING PRINCIPLES INCLUDING ADVANCED WORK IN THE STUDY OF FINANCIAL STATEMENTS AND REPORTING. ACCOUNTING PROCEDURES AND THE FINANCIAL STATEMENT PRESENTATION OF CASH, TEMPORARY INVESTMENTS, RECEIVABLES, PLANT ASSETS, AND INVESTMENTS IN STOCKS AND BONDS WILL ALSO BE INCLUDED.", "Objectives / Learning Outcome(s) / Major Topics": "1.\tEXPLAIN THE UNDERLYING CONCEPTS IN FINANCIAL REPORTING;\n2.\tIDENTIFY, EXPLAIN, AND IMPLEMENT THE BASIC STEPS IN THE ACCOUNTING CYCLE;\n3.\tDESCRIBE THE SPECIFIC ELEMENTS OF THE BALANCE SHEET; \n4.\tEXPLAIN THE PURPOSE OF AN INCOME STATEMENT AND DEFINE ITS ELEMENTS;\n5.\tDEFINE AND IDENTIFY DIFFERENT TYPES OF RECEIVABLES;\n6.\tDETERMINE THE EXPENDITURES INCLUDED IN THE COST OF INVENTORY AND THE FLOW OF COSTS;\n7.\tIDENTIFY THE COSTS TO BE INCLUDED IN THE ACQUISITION OF PROPERTY, PLANT, AND EQUIPMENT;\n8.\tEXPLAIN THE ISSUED INVOLVED IN SELECTING DEPRECIATION METHODS AND THEIR DISCLOSURE;\n9.\tACCOUNT FOR INVESTMENTS IN DEBT AND EQUITY SECURITIES;\n10.\tEXPLAIN THE GAAP FOR PENSION PLANS, INCLUDING COMPUTING PENSION EXPENSE AND RECOGNIZING PENSION LIABILITIES AND ASSETS; AND\n11.\tDEMONSTRATE AN UNDERSTANDING ON THE DEFINITION OF A LEASE AND HOW TO ACCOUNT FOR AND CLASSIFY THEM.", "Textbook(s)": "CENGAGE UNLIMITED", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}