{"Course ID": "6693", "Institution": "SFSC - SOUTH FLORIDA STATE COLLEGE", "Course Name": "ACG 2011 - FINANCIAL ACCOUNTING II", "Course Title": "FINANCIAL ACCOUNTING II", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "PRINCIPLES OF ACCOUNTING II", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "08/21/2020", "Discontinue Date": "", "Date SCNS Approved": "2/5/1982", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.A.S.A.S.A.A.", "Prerequisites": "ACG 2001 WITH A GRADE OF C OR HIGHER", "Corequisites": "NONE", "Course Description": "A CONTINUATION OF FINANCIAL ACCOUNTING I.  THIS COURSE COVERS FASB CONCEPTS AND PRONOUNCEMENTS AS THEY PERTAIN TO BUSINESS ENTITIES, SECURITY TRANSACTIONS, AND THE STATEMENT OF CASH FLOWS. THE PREPARATION, INTERPETATION, AND ANALYSIS OF FINANCIAL STATEMENTS FOR CORPORATIONS IS EMPHASIZED.", "Objectives / Learning Outcome(s) / Major Topics": "THE STUDENT WILL BE ABLE TO:\n1.DETERMINE THE PROPER METHOD OF ACCOUNTING FOR INVESTMENTS;\n2.USE SUBSIDIARY LEDGERS TO ACCOUNT FOR RECEIVABLES\n3.COMPUTE BAD DEBT EXPENSE USING THE ALLOWANCE METHOD\n4.COMPUTE AND JOURNALIZE INTEREST BEARING NOTES RECEIVABLE;\n5.EXPLAIN HOW THE USE OF CREDIT CARDS AND DISCOUNTED NOTES ARE USED TO ACCELERATE THE INFLOW OF CASH;\n6.COMPUTE THE VALUE OF FIXED AND INTANGIBLE ASSETS;\n7.DESCRIBE THE BALANCE SHEET PRESENTATION OF FIXED AND INTANGIBLE ASSETS;\n8.COMPUTE DEPRECIATION AND AMORTIZATION METHODS UNDER FASB AND THE IRC RULES;\n9.EXPLAIN INTERNAL CONTROL OF ASSETS;\n10.IDENTIFY THE COMPONENTS OF CURRENT LIABILITIES AND THERE BALANCE SHEET PRESENTATION;\n11.DETERMINE HOW AND WHEN TO ACCOUNT FOR CONTINGENT LIABILITIES;\n12.SOLVE TIME VALUE OF MONEY PROBLEMS;\n13.ILLUSTRATE THE ACCOUNTING FOR LONG-TERM LIABILITIES INCLUDING BONDS, AND CAPITAL LEASES;\n14.COMPARE AND CONTRACT THE EQUITY SECTION OF CORPORATIONS, PROPRIETORSHIPS AND PARTNERSHIPS;\n15.DISCUSS THE TYPES OF STOCK OWNERSHIP, AND THE RIGHTS OF STOCKHOLDERS;\n16.ILLUSTRATE THE ACCOUNTING FOR CAPITAL STOCK ISSUANCE AND REPURCHASE;\n17.PRODUCE A BALANCE SHEET CONTAINING TWO MAJOR SECTIONS OF STOCKHOLDERS EQUITY;\n18.ILLUSTRATE THE ACCOUNTING FOR CHANGES IN THE APPROPRIATED AND UNAPPROPRIATED RETAINED EARNINGS ACCOUNTS;\n19.EXPLAIN THE EFFECTS OF CASH DIVIDENDS, STOCK DIVIDENDS AND STOCK SPLITS ON STOCKHOLDERS EQUITY;\n20.COMPUTE CORPORATE INCOME TAXES AND EXPLAIN TIMING DIFFERENCE BETWEEN TAX RECORDS AND FINANCIAL STATEMENTS;\n21.COMPUTE EARNINGS PER SHARE;\n22.COMPUTE EQUITY PER SHARE;\n23.EXPLAIN COMPREHENSIVE INCOME;\n24.CONSTRUCT A STATEMENT OF CASH FLOWS USING BOTH DIRECT AND INDIRECT METHODS; AND\n25.ANALYZE CORPORATE ANNUAL REPORTS USING ANALYTICAL PROCEDURES TO ASSESS SOLVENCY AND PROFITABILITY.", "Textbook(s)": "PORTER AND NORTON. FINANCIAL ACCOUNTING, 5TH EDITION SOUTHWESTERN/THOMSON PUBLISHING.\nTHOMSONNOW HOMEWORK ASSISTANCE AND CALCULATOR", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}