{"Course ID": "234106", "Institution": "CF - COLLEGE OF CENTRAL FLORIDA", "Course Name": "ACG 4631 - AUDITING", "Course Title": "AUDITING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "AUDITING NON-MAJORS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2019", "Effective Date": "08/01/2019", "Discontinue Date": "", "Date SCNS Approved": "2/6/2019", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG3024 FINANCIAL STATEMENT ANALYSIS FOR MANAGERS", "Corequisites": "NONE", "Course Description": "THIS COURSE PROVIDES AN INTRODUCTION TO AUDITING AND THE AUDIT PROCESS. TOPICS INCLUDE PROFESSIONAL ETHICS, AUDIT EVIDENCE AND DOCUMENTATION, INTERNAL CONTROL, BUSINESS RISKS, AND AUDIT PLANNING. SPECIAL EMPHASIS IS GIVEN TO AUDITING PROCEDURES FOR CASH, RECEIVABLES, INVENTORIES, PLANT ASSETS, LIABILITIES, STOCKHOLDERS’ EQUITY, REVENUES, COST OF GOODS SOLD, AND OTHER EXPENSES.", "Objectives / Learning Outcome(s) / Major Topics": "1.\tDEVELOP A THOROUGH UNDERSTANDING OF THE ATTEST FUNCTION.\n2.\tUNDERSTAND GENERALLY ACCEPTED AUDITING STANDARDS AND THE PROFESSIONAL AND ETHICAL RESPONSIBILITIES OF THE INDEPENDENT PUBLIC ACCOUNTANT.\n3.\tUNDERSTAND RISK ASSESSMENT AND ITS IMPORTANCE IN THE AUDIT FUNCTION.\n4.\tDEMONSTRATE THE ABILITY TO PLAN AND DOCUMENT THE PLANNING OF THE AUDIT INCLUDING THE INITIAL RISK ASSESSMENT, CALCULATION OF MATERIALITY AND PREPARATION OF AUDIT PROGRAMS.\n5.\tUNDERSTAND THE CONCEPTS, PROCESSES AND ASSESSMENT OF INTERNAL CONTROL.\n6.\tDEMONSTRATE KNOWLEDGE OF THE SUBSTANTIATION OF BALANCES AND COLLECTION OF AUDIT EVIDENCE AND PREPARATION OF AUDIT WORK PAPERS.\n7.\tUNDERSTAND AND DEMONSTRATE THE ABILITY TO REPORT THE RESULTS OF THE AUDIT.\n8.\tHAVE KNOWLEDGE OF OTHER ATTESTATION AND ASSURANCE SERVICES PERFORMED BY CPAS AS WELL AS OTHER TYPES OF SERVICES, WHICH INDEPENDENT AUDITORS MAY OR MAY NOT PERFORM.\n9.\tDEMONSTRATE THE ABILITY TO RESEARCH AUDITING AND ACCOUNTING ISSUES AND RESPOND TO CURRENT DEVELOPMENTS AND CHANGES IN THE ACCOUNTING AND AUDITING PROFESSION DUE TO LEGISLATION, NEW PRONOUNCEMENTS BY REGULATORY AND STANDARD-SETTING BODIES AND FORCES OF CURRENT EVENTS IN THE BUSINESS WORLD.\n10.\tDEVELOP AN UNDERSTANDING OF THE ETHICAL DECISIONS THAN AN AUDITOR MUST MAKE IN THE CONDUCT OF THE AUDIT FROM THE CLIENT ACCEPTANCE PHASE THROUGHOUT THE AUDIT TO THE REPORTING PROCESS.", "Textbook(s)": "TITLE:\tPRINCIPLES OF AUDITING\nAUTHOR:\tWHITTINGTON, PANNY\nPUBLISHER:\tMCGRAW HILL\nISBN:\t9781259916984*CONNECT ACCESS", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}