{"Course ID": "234103", "Institution": "CF - COLLEGE OF CENTRAL FLORIDA", "Course Name": "ACG 3131 - ACCOUNTING THEORY", "Course Title": "ACCOUNTING THEORY", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "FINANCIAL ACCOUNTING CONCEPTS AND ANALYSIS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2019", "Effective Date": "08/01/2019", "Discontinue Date": "", "Date SCNS Approved": "2/6/2019", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG3024 FINANCIAL STATEMENT ANALYSIS FOR MANAGERS", "Corequisites": "NONE", "Course Description": "THIS COURSE PROVIDES FOR THE PREPARATION AND UNDERSTANDING OF FINANCIAL INFORMATION. TOPICS INCLUDE ACCOUNTING THEORY AND PRACTICE, THE CONCEPTUAL FRAMEWORK OF UNITED STATES (U.S.) GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP), RECOGNITION OF ECONOMIC TRANSACTIONS, THE PREPARATION AND ANALYSIS OF FINANCIAL STATEMENTS AND THE RELATED DISCLOSURES. THE COURSE FOCUSES ON THE ROLE OF ACCOUNTING AS AN INFORMATION SYSTEM AND THE MEASUREMENT, RECOGNITION, PRESENTATION, AND DISCLOSURE OF ECONOMIC TRANSACTIONS FOCUSING ON THE FOLLOWING: BASIC FINANCIAL STATEMENTS, TIME VALUE OF MONEY, CASH AND RECEIVABLES, INVENTORIES, PROPERTY, PLANT, AND EQUIPMENT, DEPRECIATION AND IMPAIRMENT, AND CURRENT LIABILITIES AND CONTINGENCIES.", "Objectives / Learning Outcome(s) / Major Topics": "1.\t    DETERMINE WHAT ECONOMIC EVENTS REQUIRE RECOGNITION IN FINANCIAL STATEMENTS USING FINANCIAL ACCOUNTING THEORY IN ACCORDANCE WITH U.S. GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP).\n2.\tMEASURE ECONOMIC EVENTS USING SUITABLE VALUATION METHODS INCLUDING CONSIDERATION OF UNITED STATES AND INTERNATIONAL STANDARDS.\n3.\tDEMONSTRATE THE ABILITY TO RECORD AND DISCLOSE COMPLEX FINANCIAL EVENTS IN ACCORDANCE WITH U.S. GAAP FOR ASSETS, REVENUES, EXPENSES, GAINS AND LOSSES. \n4.\tPREPARE BALANCE SHEETS, INCOME AND EQUITY STATEMENTS USING GAAP STANDARDS AND PROCEDURES.\n5.\tANALYZE INFORMATION IN FINANCIAL REPORTS FOR ITS VALUE IN STAKEHOLDER DECISION-MAKING.\n6.\tDEMONSTRATE UNDERSTANDING OF ETHICAL CONSIDERATIONS IN PREPARING AND REPORTING ACCOUNTING INFORMATION. \n7.\tCREATE COMMUNICATIONS, BOTH ORAL AND WRITTEN, TO CONVEY ACCOUNTING INFORMATION IN A CROSS-FUNCTIONAL DECISION-MAKING ENVIRONMENT.", "Textbook(s)": "TITLE:\tINTERMEDIATE ACCOUNTING\nAUTHOR:\tSPICELAND, NELSON, THOMAS\nPUBLISHER:\tMCGRAW HILL\nISBN:\t9781259722660", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}