{"Course ID": "218988", "Institution": "FLPOLY - FLORIDA POLYTECHNIC UNIVERSITY", "Course Name": "ACG 2020 - ACCOUNTING FOR MANAGERS", "Course Title": "ACCOUNTING FOR MANAGERS", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "ACCOUNTING FOR MANAGERS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/20/2017", "Effective Date": "08/20/2017", "Discontinue Date": "", "Date SCNS Approved": "3/2/2017", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE IS DESIGNED TO ENABLE THE STUDENT TO UNDERSTAND AND APPLY THE FUNDAMENTAL CONCEPTS AND PROCEDURES OF BOTH FINANCIAL AND MANAGERIAL AC-COUNTING. TOPICS INCLUDE BASIC ACCOUNTING TERMINOLOGY, FINANCIAL STATEMENT ANALYSIS AND INTERPRETATION, INTERNAL CONTROL, COST BEHAVIOR, COST-VOLUME-PROFIT ANALYSIS, BUDGETING, AND THE USE OF ACCOUNTING DATA IN MAKING INFORMED, ETH-ICAL DECISIONS.", "Objectives / Learning Outcome(s) / Major Topics": "OBJECTIVES:\nINTRODUCE ACCOUNTING AS THE \"LANGUAGE OF BUSINESS\" AND TO TEACH STUDENTS TO APPLY ACCOUNTING THEORY, STANDARDS, PRINCIPLES AND PROCEDURES TO PRACTI-CAL ACCOUNTING PROBLEMS.\nFAMILIARIZE STUDENTS WITH THE WAY ACCOUNTING INFORMATION NEEDED BY MANAG-ERS FOR PLANNING, CONTROL, & DECISION MAKING IS COLLECTED AND ASSEMBLED.\nSTUDENTS WILL BE ABLE TO PROVIDE EVIDENCE OF UNDERSTANDING BY COMPLETING A FINAL PAPER AND PRESENTATION BASED ON A CURRENT ARTICLE REGARDING A TOPIC WHICH WAS PRESENTED DURING THE COURSE.\n\nLEARNING OUTCOMES:\nIDENTIFY THE INFORMATION CONVEYED IN EACH OF THE FOUR BASIC FINANCIAL STATEMENTS AND THE WAY THAT IT IS USED BY DIFFERENT DECISION MAKERS.\n\nIDENTIFY WHAT CONSTITUTES A BUSINESS TRANSACTION AND APPLY TRANSACTION ANALYSIS TO RECORD THE EFFECTS OF THOSE TRANSACTIONS.\n\nPREPARE BASIC FINANCIAL STATEMENTS BASED UPON GENER-ALLY ACCEPTED ACCOUNTING PRINCIPLES.\n\nDESCRIBE COMMON FINANCIAL STATEMENT RELATIONSHIPS USED IN FINANCIAL ANALYSIS.\n\nPREPARE AN INCOME STATEMENT FOR A MANUFACTURING FIRM.\n\nDETERMINE PRODUCT COSTS USING JOB-ORDER COSTING AND ACTIVITY-BASED COSTING.\n\nTO WRITE ABOUT AND PRESENT A CONCEPT OF ACCOUNTING IN AN INFORMATIVE AND ENGAGING MANNER.", "Textbook(s)": "FINANCIAL & MANAGERIAL ACCOUNTING INFORMATION FOR DECISIONS (MCGRAW-HILL) (6TH ED) (2016) BY WILD\nISBN: 9780078025761", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}