{"Course ID": "114818", "Institution": "FSWSC - FLORIDA SOUTHWESTERN STATE COLLEGE", "Course Name": "ACG 2930 - SPECIAL TOPICS/CAPSTONE--ACCOUNTING", "Course Title": "SPECIAL TOPICS/CAPSTONE--ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "SPECIAL TOPICS/SEMINARS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "08/20/2014", "Discontinue Date": "", "Date SCNS Approved": "1/24/1994", "Term Type": "SEMESTER", "Course Credits": "1.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.", "Prerequisites": "ACG2021 OR (ACG1001 & ACG2011), ACG2071, ACG2450 OR CGS1000, ACG2500, MAN2021, MTB 1103, TAX2000, SLS1331, ECO2013, & ECO2023, OR PERMISSION OF THE DEAN", "Corequisites": "NONE", "Course Description": "REQUIRED & DESIGNED FOR STUDENTS PREP TO GRADUATE & TRANSITION TO EMPLOYMENT AND/OR CONTINUING ED. CAPSTONE WILL PROVIDE THE OPPORT FOR STUDENTS TO DEMONSTRATE WHAT THEY HAVE LEARNED IN A.S. ACCOUNTING PROGRAM & GAUGE THEIR ABILITY TO APPLY IT. STUDENTS WILL ENGAGE IN ACTIVE DISCUSSIONS ON ACCOUNTING & TAX RELATED TOPICS/ISSUES, PART THOSE RELATED TO CURRENT EVENTS. STUDENT WILL WRITE A SHORT PAPER ON A CONTEMP ACCOUNTING TOPIC/ISSUE; PREPARE A COVER LETTER & RESUME SPECIFICALLY FOR AN ACCOUNTING RELATED POSITION POSTED LOCALLY, NATIONALLY, OR INTERNATIONALLY. STUDENTS NOT WORKING IN AN ACCOUNTING RELATED FIELD OR WHO DESIRE TO IMPROVE THEIR CURRENT POSITIONS WILL BE ENCOURAGED TO APPLY FOR THE POSITIONS THEY FIND. SUCCESSFUL COMPLETION OF THE COURSE REQUIRES DEMONSTRATING LEARNING OUTCOMES FROM CORE COURSES BY PASSING THE COMPREHENSIVE EXAM AT END OF COURSE. STUDENTS MUST PASS THIS CLASS WITH A GRADE OF \"D\" OR HIGHER IN ORDER TO EARN THE ACCOUNTING TECHNOLOGY, A.S. DEGREE.", "Objectives / Learning Outcome(s) / Major Topics": "TOPIC OUTLINE:\n--WEEKLY DISCUSSION TOPICS ON CURRENT TAX AND ACCOUNTING EVENTS AND CONCEPTS.\n--SHORT PAPER ON ASSIGNED ACCOUNTING TOPIC.\n--COVER LETTER AND RESUME FOR POSTED DEGREE-RELATED POSITION.\n--COMPREHENSIVE EXAMINATION.\nLEARNING OUTCOMES:\n1.  DEFINE AND DESCRIBE KEY TERMS AND CONCEPTS PRESENTED IN PREVIOUS BUSINESS, COMPUTER, AND ACCOUNTING COURSES.\n2. ANALYZE, DISCUSS AND APPLY PROGRAM MATERIAL TO CLASS DISCUSSIONS.\n3. DEMONSTRATE USE OF ACCOUNTING PRINCIPLES AND CONCEPTS AS THEY RELATE TO A CONTEMPORARY ACCOUNTING TOPIC.\n4. PREPARE A RESUME AND COVER LETTER FOR AT LEAST ONE ACCOUNTING-RELATED POSITION.", "Textbook(s)": "NONE", "Transfer Status": "NOT AUTOMATICALLY TRANSFERABLE", "Transaction Type": ""}