{"Course ID": "187155", "Institution": "FSWSC - FLORIDA SOUTHWESTERN STATE COLLEGE", "Course Name": "ACG 3341 - COST ACCOUNTING", "Course Title": "COST ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "COST ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "03/01/2011", "Effective Date": "06/19/2014", "Discontinue Date": "8/1/2023", "Date SCNS Approved": "1/7/2011", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2071 WITH A GRADE OF \"C\" OR HIGHER", "Corequisites": "NONE", "Course Description": "THIS COURSE PROVIDES A STUDY OF THE RELATIONSHIP OF COST ACCOUNTING TO THE CONTROL AND DECISION-MAKING FUNCTIONS OF MANAGEMENT.  EMPHASIS IS PLACED ON THE REVIEW OF ACCOUNTING FOR COSTS FOLLOWED BY A DETAILED CONSIDERATION OF PRODUCT COSTING FOR BOTH JOB ORDER, PROCESS COST, AND ACTIVITY BASED COSTING SYSTEMS.  MAJOR AREAS OF INSTRUCTION INCLUDE THE ACCUMULATION OF COST DATA WITH DETAILED COVERAGE OF MATERIALS, LABOR AND FACTORY OVERHEAD, JOB ORDER AND PROCESS COSTING, ACTIVITY BASED COSTING, BUDGETING, AND STANDARD COSTS.", "Objectives / Learning Outcome(s) / Major Topics": "TOPIC OUTLINE:\nCOST DATA; JOB ORDER AND PROCESS COST SYSTEMS;\nACTIVITY BASED COSTING;\nBUDGETING AND STANDARD COSTS;\nLABOR AND FACTORY OVERHEAD;\nCOST CONTROL AND DECISION MAKING IN MANAGEMENT.\nLEARNING OUTCOMES:\n1. EVALUATE THE ELEMENTS OF COST BY EXPLAINING HOW COSTS ARE ACCUMULATED. \n2. SUMMARIZE COSTS FLOW THROUGHOUT THE PRODUCTION PROCESS GIVEN SPECIFIC CASE STUDIES.\n3. ANALYZE MATERIAL CONTROL PROCEDURES.\n4. CALCULATE MATERIALS ISSUED FOR THE PRODUCTION PROCESS BY APPLYING COST ACCOUNTING PRINCIPLES AND PROCEDURES.\n5. IDENTIFY AND COMPUTE LABOR COST IN A MANUFACTURING ENVIRONMENT BY APPLYING COST ACCOUNTING PRINCIPLES AND PROCEDURES.\n6. CALCULATE AND BUDGET FACTORY OVERHEAD COSTS. \n7. GENERATE THE ACTUAL FACTORY OVERHEAD COSTS.\n8. APPLY COST ACCOUNTING PRINCIPLES AND PROCEDURES TO A GIVEN JOB ORDER COST SYSTEM.\n9. DIFFERENTIATE THE GENERAL PROCEDURES APPLICABLE TO PROCESS COST ACCOUNTING.\n10. CALCULATE AND APPLY THE PROCEDURES USED IN PROCESS COST ACCOUNTING UNDER THE FIRST-IN/FIRST-OUT METHOD OF ASSIGNING COST TO INVENTORIES.\n11. ANALYZE THE PURPOSES OF STANDARD COST ACCOUNTING.\n12. EVALUATE HOW STANDARD COSTS ARE USED FOR MATERIAL AND LABOR. \n13. ANALYZE MATERIAL AND LABOR VARIANCES.\n14. EVALUATE BUDGET AND VOLUME VARIANCES.\n15. APPLY THE TWO-VARIANCE METHOD AND THE THREE-VARIANCE METHOD OF CALCULATING AND ANALYZING FACTORY OVERHEAD.\n16. DIFFERENTIATE AND APPLY THE PROCEDURES OF COST ANALYSIS THAT ARE IMPLEMENTED IN THE MANAGEMENT DECISION-MAKING PROCESS.\n17. EVALUATE THE EFFECTS OF CHANGING PRICES, CONSTANT DOLLAR, AND CURRENT COST ACCOUNTING.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}