{"Course ID": "187153", "Institution": "FSWSC - FLORIDA SOUTHWESTERN STATE COLLEGE", "Course Name": "ACG 3103 - ACG 3103 INTERMEDIATE ACCOUNTING I", "Course Title": "ACG 3103 INTERMEDIATE ACCOUNTING I", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "INTERMEDIATE ACCOUNTING I(1 OF 3)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "03/01/2011", "Effective Date": "08/20/2014", "Discontinue Date": "8/1/2023", "Date SCNS Approved": "1/7/2011", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2011 WITH A MIN GRADE OF \"C\"", "Corequisites": "NONE", "Course Description": "THIS COURSE STUDIES THE ACCOUNTING MODEL, CONCEPTS, STANDARDS AND PRINCIPLES UNDERLYING THE MEASUREMENT AND REPORTING OF FINANCIAL POSITION, ALONG WITH FINANCIAL STATEMENT PREPARATION. THE MAJOR INSTRUCTIONAL EMPHASIS IS PLACED ON A SYSTEMATIC AND IN-DEPTH STUDY OF THE FINANCIAL STATEMENTS AND UNDERLYING RECORDS WITH SPECIAL ATTENTION GIVEN TO THE ELEMENTS COMPOSING WORKING CAPITAL, INVESTMENTS, AND ASSETS. THIS IS THE FIRST COURSE IN A SEQUENCE OF THREE COURSES: ACG 3103, ACG 3113, AND ACG 4123.", "Objectives / Learning Outcome(s) / Major Topics": "TOPIC OUTLINE: FINANCIAL REPORTING STANDARD SETTING; CONCEPTUAL FRAMEWORK; ACCOUNTING INFORMATION PROCESS; TIME VALUE OF MONEY; CURRENT ASSETS; PLANT, PROPERTY AND EQUIPMENT; OTHER ASSETS; FINANCIAL STATEMENTS. LEARNING OUTCOMES: 1. ANALYZE THE ISSUES AND DEVELOPMENT OF FINANCIAL ACCOUNTING STANDARD SETTING. 2. ASSESS THE OBJECTIVES, THE QUALITATIVE CHARACTERISTICS, THE ELEMENTS, AND THE BASIC CONCEPTS SUPPORTING THE CONCEPTUAL FRAMEWORK UNDERLYING FINANCIAL ACCOUNTING. 3. PREPARE GENERAL JOURNAL ENTRIES, POST TO THE LEDGER, COMPLETE WORKSHEETS, AND JOURNALIZE ADJUSTING, CLOSING, AND REVERSING ENTRIES. 4. APPLY THE CONCEPT OF THE TIME VALUE OF MONEY TO ACCOUNTING APPLICATIONS. 5. ANALYZE AND REPORT CASH, RECEIVABLES, INVENTORIES, AND OTHER CURRENT ASSETS. 6. PREPARE, GENERATE, AND EVALUATE REPORTS FOR THE ACQUISITION, USE, AND RETIREMENT OF OPERATIONAL ASSETS. 7. ANALYZE, RECORD, AND SUMMARIZE ACTIVITIES RELATED TO INTANGIBLE ASSETS AND DEFERRED CHARGES. 8. PREPARE AND ANALYZE FINANCIAL STATEMENTS TO INCLUDE AN INCOME STATEMENT, A RETAINED EARNINGS STATEMENT, A BALANCE SHEET, AND A STATEMENT OF CHANGES IN FINANCIAL POSITION.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}