{"Course ID": "110460", "Institution": "NWFSC - NORTHWEST FLORIDA STATE COLLEGE", "Course Name": "ACG 2021 - FINANCIAL ACCOUNTING", "Course Title": "FINANCIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "ACCOUNTING PRIN-(CONDENSED)(3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "03/01/2017", "Discontinue Date": "", "Date SCNS Approved": "7/31/1996", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.", "Prerequisites": "MAC 1105 C COLLEGE ALGEBRA, EQUIVALENT, OR HIGHER.", "Corequisites": "NONE", "Course Description": "THIS COURSE IS AN INTRODUCTION TO FINANCIAL ACCOUNTING THAT SPECIALIZES IN THE PROCESSES AND\nPRINCIPLES USED TO PREPARE FINANCIAL STATEMENTS. THIS COURSE WILL FOCUS ON THE PURPOSE AND\nCONTENT OF THE FOUR BASIC FINANCIAL STATEMENTS INCLUDING THE PREPARATION OF THESE\nSTATEMENTS AS WELL AS INTERPRETING INFORMATION FOR DECISION-MAKING.", "Objectives / Learning Outcome(s) / Major Topics": "1.\nTHE STUDENTS SHALL DEVELOP AN UNDERSTANDING OF THE FUNCTIONAL PRINCIPLES AND PROCEDURES IN\nDOUBLE\\ENTRY ACCOUNTING WITH EMPHASIS ON MANAGEMENTS USE OF ACCOUNTING INFORMATION.\n2.\nTHE STUDENTS SHALL DEVELOP AN UNDERSTANDING OF HOW DATA ARE ACCUMULATED AND USE CRITICAL\nTHINKING AND COMMUNICATION SKILLS IN PROBLEM-SOLVING.\n3.\nTHE STUDENTS SHALL DEVELOP AN UNDERSTANDING OF THE MEANING OF FINANCIAL DATA FOUND ON THE\nBUSINESS STATEMENTS AND DEVELOP INSIGHTS INTO WAYS COMPANIES USE ACCOUNTING INFORMATION\nTO MAKE DECISION AND PROBLEM\\SOLVING.\n4.\nSTUDENTS SHALL ACQUIRE CONCEPTS OF THE IMPORTANCE OF ACCURACY AND HONESTY IN THE KEEPING OF\nRECORDS.\n5.\nUNDERSTANDINGS AND ATTITUDES RELATED TO THE ORGANIZATION AND OPERATION OF THE PRIVATEENTERPRISE\nECONOMIC SYSTEM SHALL BE DEVELOPED BY STUDENTS.\n6.\nDESIRABLE BUSINESS ATTITUDES, WORK HABITS, AND REAL-WORLD SKILLS FOR SUCCESS IN BUSINESS\nOCCUPATION SHALL BE DEVELOPED BY STUDENTS.\n7.\nTHE STUDENTS, THROUGH AN EXPOSURE TO VARIOUS EXPERIENCES, SHALL DEVELOP INTEREST IN AN ATTITUDE\nFOR ACCOUNTING OR BUSINESS AS A CAREER.", "Textbook(s)": "TBD", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}