{"Course ID": "62935", "Institution": "FSU - FLORIDA STATE UNIVERSITY", "Course Name": "ACG 3341 - COST ACCOUNTING", "Course Title": "COST ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "COST ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "10/07/2021", "Discontinue Date": "", "Date SCNS Approved": "10/8/2021", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG2021; ACG2071; QMB3200 (TO ENROLL IN ACG 3341, STUDENTS MUST HAVE COMPLETED ACG 2021 AND ACG 2071, WITH A GRADE OF “B” OR BETTER (“B-” IS NOT ACCEPTABLE). ST", "Corequisites": "QMB3200", "Course Description": "THIS COURSE COVERS THE PLANNING AND CONTROL OF ECONOMIC ENTITIES THROUGH COST-VOLUME-PROFIT RELATIONSHIPS, JOB ORDER, AS WELL AS PROCESS AND STANDARD COST ACCOUNTING. EMPHASIS IS PLACED ON THE RELATIONSHIP BETWEEN ACCOUNTING SYSTEMS AND DECISION MAKING.", "Objectives / Learning Outcome(s) / Major Topics": "•\tDISTINGUISH BETWEEN DIRECT COSTS AND INDIRECT COSTS, VARIABLE COSTS AND FIXED COSTS, INVENTORIABLE COSTS FROM PERIOD COSTS.\n•\tCALCULATE STATIC BUDGETS AND STATIC-BUDGET VARIANCES, FLEXIBLE-BUDGET VARIANCES, SALES-VOLUME VARIANCES, PRICE VARIANCES, EFFICIENCY VARIANCES, VARIABLE OVERHEAD FLEXIBLE-BUDGET VARIANCE, THE VARIABLE OVERHEAD EFFICIENCY VARIANCE, AND THE VARIABLE OVERHEAD SPENDING VARIANCE, THE FIXED OVERHEAD FLEXIBLE-BUDGET VARIANCE, THE FIXED OVERHEAD SPENDING VARIANCE, AND THE FIXED OVERHEAD PRODUCTION-VOLUME VARIANCE.\n•\tCALCULATE THE COST OF PRODUCTS USING VARIOUS PRODUCT COSTING METHODS, SPECIFICALLY ABSORPTION, VARIABLE, AND THROUGHPUT COSTING METHODS;\n•\tDISTINGUISH BETWEEN RELEVANT AND IRRELEVANT INFORMATION AND MAKE SOUND BUSINESS DECISIONS USING MANAGERIAL ACCOUNTING INFORMATION;\n•\tUSE INCREMENTAL ANALYSIS IN MAKING SHORT-TERM DECISIONS SUCH AS MAKE-OR-BUY AND SPECIAL ORDER DECISIONS. \n•\tFORMULATE AND SOLVE LINEAR-PROGRAMMING PROBLEMS.\n•\tDISTINGUISH JOB COSTING FROM PROCESS COSTING, AND ACTUAL COSTING FROM NORMAL COSTING.\n•\tDISTINGUISH BETWEEN SIMPLE AND ACTIVITY-BASED COSTING SYSTEMS.\n•\tACCOUNT FOR SPOILAGE, REWORK, AND SCRAP.\n•\tALLOCATE SUPPORT DEPARTMENT COSTS USING DIRECT, STEP-DOWN, AND RECIPROCAL METHODS; COMMON COSTS USING THE STAND-ALONE AND THE INCREMENTAL METHODS; AND BUNDLED REVENUES TO THE INDIVIDUAL PRODUCTS.\n•\tIDENTIFY THE SPLITOFF POINT IN JOINT-COST SITUATION AND ALLOCATE JOINT COSTS USING VARIOUS METHODS (SALES VALUE AT SPLIT-OFF, PHYSICAL MEASURE, NET REALIZABLE VALUE (NRV), AND CONSTANT GROSS MARGIN NRV).\n•\tIDENTIFY AND CATEGORIZE COSTS OF QUALITY;\n•\tUSE THE THEORY OF CONSTRAINTS AND THROUGHPUT ANALYSIS IN DECISION MAKING;\n•\tUSE THE EOQ AND JIT MODELS OF INVENTORY MANAGEMENT;\nEVALUATE INVESTMENT PROJECTS USING DISCOUNTED CASH FLOW AND OTHER TECHNIQUES", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}