{"Course ID": "244033", "Institution": "DSC - DAYTONA STATE COLLEGE", "Course Name": "ACG 3341 - COST ACCOUNTING", "Course Title": "COST ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "COST ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "04/01/2020", "Effective Date": "04/01/2020", "Discontinue Date": "", "Date SCNS Approved": "1/7/2020", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG3113", "Corequisites": "NONE", "Course Description": "THIS COURSE PROVIDES A STUDY OF THE RELATIONSHIP OF COST ACCOUNTING TO THE CONTROL AND DECISION-MAKING FUNCTIONS OF MANAGEMENT. EMPHASIS IS PLACED ON THE REVIEW OF ACCOUNTING FOR COSTS FOLLOWED BY A DETAILED CONSIDERATION OF PRODUCT COSTING FOR BOTH JOB ORDER, PROCESS COST, AND ACTIVITY-BASED COSTING SYSTEMS.", "Objectives / Learning Outcome(s) / Major Topics": "1.\tEVALUATE THE ELEMENTS OF COST BY EXPLAINING HOW COSTS ARE ACCUMULATED.\n2.\tSUMMARIZE COST FLOW THROUGHOUT THE PRODUCTION PROCESS GIVEN SPECIFIC CASE STUDIES. \n3.\tANALYZE MATERIAL CONTROL PROCEDURES.\n4.\tCALCULATE MATERIALS ISSUED FOR THE PRODUCTION PROCESS BY APPLYING COST ACCOUNTING PRINCIPLES AND PROCEDURES.\n5.\tIDENTIFY AND COMPUTE LABOR COST IN A MANUFACTURING ENVIRONMENT BY APPLYING COST ACCOUNTING PRINCIPLES AND PROCEDURES. \n6.\tCALCULATE BUDGET AND ACTUAL FACTORY OVERHEAD COSTS. \n7.\tAPPLY COST ACCOUNTING PRINCIPLES AND PROCEDURES TO A GIVEN JOB ORDER COST SYSTEM.\n8.\tDIFFERENTIATE THE GENERAL PROCEDURES APPLICABLE TO PROCESS COST ACCOUNTING.\n9.\tDIFFERENTIATE AND APPLY THE PROCEDURES OF COST ANALYSIS THAT ARE IMPLEMENTED IN THE MANAGEMENT DECISION-MAKING PROCESS.\n10.\tASSESS THE EFFECTS OF CHANGING PRICES, CONSTANT DOLLAR, AND CURRENT COST ACCOUNTING.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}