{"Course ID": "33929", "Institution": "SJRSC - ST. JOHNS RIVER STATE COLLEGE", "Course Name": "ACG 2071 - PRINCIPLES OF MANAGERIAL ACCOUNTING", "Course Title": "PRINCIPLES OF MANAGERIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "MANAGERIAL ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "03/03/2006", "Discontinue Date": "", "Date SCNS Approved": "11/18/1996", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "T.C.A.S.A.A.", "Prerequisites": "PREREQUISITE: ACG 2021 WITH A GRADE OF C OR HIGHER.", "Corequisites": "NONE", "Course Description": "THIS COURSE IS DESIGNED TO FAMILIARIZE THE STUDENT WITH THE THEORY, LOGIC AND CONCEPTS USED IN MANAGERIAL ACCOUNTING. COURSE CONTENT INCLUDES: JOB-ORDER COSTING, PROCESS COSTING, COST- VOLUMEPROFIT RELATIONSHIPS, DEPARTMENTAL  ACCOUNTING, PROFIT PLANNING, STANDARD COSTS, FLEXIBLE BUDGETS, DECENTRALIZED OPERATIONS, PRICING, AND CAPITAL BUDGETING DECISIONS. EMPHASIS IS PLACED ON\nCOMPREHENSION OF MANAGERIAL ACCOUNTING PRINCIPLES AND CONCEPTS IN ADDITION TO MASTERY OF ACCOUNTING SKILLS.", "Objectives / Learning Outcome(s) / Major Topics": "UPON SUCCESSFUL COMPLETION OF THIS COURSE, THE STUDENT SHOULD BE ABLE TO:\n1.PREPARE JOB AND PROCESS COST REPORTS\n2.USE COST ACCOUNTING TO AID THE MANAGERIAL DECISION-MAKING PROCESS\n3.PRODUCE COST, FLEXIBLE, AND CAPITAL BUDGETS AS WELL AS OVERHEAD ANALYSIS, AND USE THEM IN THE MANAGERIAL DECISION-MAKING PROCESS\n4.ANALYZE AND CLASSIFY COST BUDGET PATTERNS AS FIXED OR VARIABLE\n5.COLLECT, RECORD AND ANALYZE ACCOUNTING DATA TO EVALUATE ALTERNATIVES IN THE DECISION MAKING PROCESS.\n6.IDENTIFY, RECORD AND EVALUATE VARIOUS COST ACCOUNTING SYSTEMS.\n7.PREPARE A COST OF GOODS MANUFACTURED STATEMENT.\n8.ARTICULATE THE ADVANTAGES AND THE LIMITATIONS OF ACCOUNTING DATA AS A FACILITATOR FOR BUSINESS DECISION MAKING", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}