{"Course ID": "155064", "Institution": "RU - RASMUSSEN UNIVERSITY", "Course Name": "ACG 2104 - INTERMEDIATE ACCOUNTING I", "Course Title": "INTERMEDIATE ACCOUNTING I", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "INTERMEDIATE ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "10/02/2006", "Effective Date": "10/02/2006", "Discontinue Date": "", "Date SCNS Approved": "10/19/2007", "Term Type": "QUARTER", "Course Credits": "4.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE REVIEWS ACCOUNTING PROCEDURES, AND THEN EXPANDS TO SPECIALIZED TREATMENT OF FINANCIAL STATEMENTS, CASH AND TEMPORARY ASSETS, RECEIVABLES, INVENTORIES (GENERAL AND ESTIMATING PROCEDURES), CURRENT LIABILITIES, INCOME-TAX PROCEDURES IN ACCOUNTING, AND THE ACQUISITION, USE, AND RETIREMENT OF LONG-TERM PLANT ASSETS.", "Objectives / Learning Outcome(s) / Major Topics": "IDENTIFY THE OBJECTIVES OF FINANCIAL REPORTING AND EXAMINE THE REASONING BEHIND THE DEVELOPMENT OF GAAP. \nIDENTIFY THE SPECIFIC ELEMENTS OF A BALANCE SHEET AND PREPARE A BALANCE SHEET WITH PROPER CLASSIFICATIONS. \nIDENTIFY THE SPECIFIC COMPONENTS OF AN INCOME STATEMENT. DEFINE THE CONCEPTS OF INCOME AND HOW INCOME IS MEASURED. \nIDENTIFY THE SPECIFIC COMPONENTS INCLUDED IN THE STATEMENT OF CASH FLOWS AND PREPARE A STATEMENT OF CASH FLOWS WITH PROPER CLASSIFICATIONS. \nRECORD AND ANALYZE THE COMPLEXITIES OF COST-OF-GOODS-SOLD AND INVENTORY IDENTIFICATION AND VALUATION.\nRECORD AND ANALYZE INVESTMENTS IN NONCURRENT OPERATING ASSETS, DEBT, AND EQUITY SECURITIES.\nIDENTIFY THE PRIMARY CRITERIA FOR REVENUE RECOGNITION, AND RECORD JOURNAL ENTRIES FOR LONG-TERM CONSTRUCTION-TYPE CONTRACTS, CONTRACTS USING PERCENTAGE-OF-COMPLETION, AND COMPLETED-CONTRACT METHOD.", "Textbook(s)": "SPICELAND, J. DAVID, SEPE, JAMES, & TOMASSINI, LAWRENCE A. (2005).  INTERMEDIATE ACCOUNTING (4TH ED.).  MCGRAW-HILL/IRWIN.  ISBN:  0072994029.", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}