{"Course ID": "155066", "Institution": "RU - RASMUSSEN UNIVERSITY", "Course Name": "ACG 1015 - ACCOUNTING II", "Course Title": "ACCOUNTING II", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "1", "Statewide Course": "ACCOUNTING II", "Lab Code": " ", "Honors Course": "NO", "Add Date": "10/02/2006", "Effective Date": "10/02/2006", "Discontinue Date": "", "Date SCNS Approved": "10/19/2007", "Term Type": "QUARTER", "Course Credits": "4.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE IS A CONTINUATION OF ACCOUNTING I WITH ADDITIONAL CONCERN WITH FINANCIAL-STATEMENT ANALYSIS FOR PARTNERSHIPS AND CORPORATIONS. THE COURSE WILL EMPHASIZE VALUING ASSETS, INCLUDING PROPERTY PLANT EQUIPMENT, INVENTORY, AND ACCOUNTS RECEIVABLE, AND WILL ADDRESS THE CLASSIFICATION OF ACCOUNTS, NOTES, PAYROLL LIABILITIES, AND MONTHLY ADJUSTMENTS.", "Objectives / Learning Outcome(s) / Major Topics": "1.DIFFERENTIATE AND COMPUTE DEFERRAL AND ACCRUAL ADJUSTMENTS.\n2.COMPUTE MATURITY DATE, INTEREST, MATURITY VALUE, AND DISCOUNTS ON NOTES PAYABLE AND NOTES RECEIVABLE. RECORD RELATED TRANSACTIONS IN A JOURNAL AND REGISTER, INCLUDING WRITE-OFFS OF UNCOLLECTIBLE ACCOUNTS.\n3.PREPARE AND RECORD PAYROLL ACCOUNTING ENTRIES FOR EMPLOYEE EARNING, DEDUCTION AND NET PAY. \n4.VALUATE ENDING INVENTORIES USING THE FOLLOWING:  SPECIFIC IDENTIFICATION, AVERAGE COST, FIRST-IN, FIRST-OUT, LAST-IN, FIRST-OUT, LOWER OF COST OR MARKET GROSS PROFIT, AND RETAIL WITH PERIODIC AND PERPETUAL ENTRIES.\n5.COMPUTE AND RECORD DEPRECIATION BY VARIOUS METHODS, RECORD DISPOSALS OF FIXED ASSETS, AND ACCOUNT FOR INTANGIBLES.\n6.DEVELOP A WORKING KNOWLEDGE OF PARTNERSHIP ACCOUNTING, INCLUDING FORMATION, DIVISION OF INCOME, AND LIQUIDATION.", "Textbook(s)": "FUNDAMENTAL ACCOUNTING PRINCIPLES, 17TH EDITION; LARSON, WILD, AND CHIAPETTA; MCGRAW HILL;  ISBN: 0-07-294660-1", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}