{"Course ID": "155136", "Institution": "RU - RASMUSSEN UNIVERSITY", "Course Name": "ACG 4250 - INTERNATIONAL ACCOUNTING", "Course Title": "INTERNATIONAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "INTERNATIONAL ACCOUNTING", "Lab Code": " ", "Honors Course": "NO", "Add Date": "04/01/2007", "Effective Date": "04/01/2007", "Discontinue Date": "", "Date SCNS Approved": "10/25/2007", "Term Type": "QUARTER", "Course Credits": "4.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE INCLUDES A STUDY OF THE INTERNATIONAL DIMENSION OF FINANCIAL REPORTING AND ANALYSIS. IT PROVIDES STUDENTS WITH AN OVERVIEW OF THE ACCOUNTING PRACTICES OF MULTINATIONAL ENTERPRISES AND THE PREPARATION AND PRESENTATION OF FINANCIAL STATEMENTS IN DIFFERENT NATIONS. TOPICS COVERED INCLUDE INTERNATIONAL CORPORATE TAXATION, TRANSFER PRICING, FOREIGN CURRENCY TRANSLATION, FINANCIAL DISCLOSURE, AND INTERNATIONAL ACCOUNTING HARMONIZATION.", "Objectives / Learning Outcome(s) / Major Topics": "1.DEMONSTRATE AN UNDERSTANDING OF HARMONIZATION AND STANDARDIZATION.\n2.CONVERT FUNCTIONAL GLOBAL CURRENCIES AND DEMONSTRATE THEIR PROPER PRESENTATION.\n3.RESEARCH FINANCIAL ACCOUNTING STANDARDS BOARD PRONOUNCEMENTS REGARDING FOREIGN INVESTMENT FINANCIAL REPORTING AND APPLY THOSE RULES GIVEN A SET OF FACTS.\n4.DEMONSTRATE AND IDENTIFY ACCEPTED PRESENTATION OF CONSOLIDATED FINANCIAL STATEMENTS OF MULTI-NATIONAL ENTERPRISES.\n5.DEMONSTRATE THE ABILITY TO ANALYZE AND COMPARE U.S. AND FOREIGN FINANCIAL STATEMENTS.\n6.DEMONSTRATE KNOWLEDGE OF THE HISTORICAL BASIS FOR DIVERSITY IN FINANCIAL REPORTING ACROSS COUNTRIES, AND APPLY THE INSTITUTIONAL AND REGULATORY STRUCTURES IN ACCOUNTING THAT HAVE DEVELOPED IN RESPONSE TO GLOBAL FINANCIAL MARKETS.\n7.COMPARE AND CONTRAST THE ACCOUNTING INFORMATION SYSTEMS IN MULTINATIONAL ENTERPRISES. \n8.DISCUSS THE MARKET RISKS OF EXPOSURE TO FOREIGN CURRENCY TRANSLATIONS AND HYPERINFLATION. \n9.GIVEN A SET OF FACTS, CREATE A SOUND BUSINESS STRATEGY FOR A TRANSNATIONAL OR MULTINATIONAL ENTITY. \n10.THROUGH ANALYSES OF CURRENT EVENTS, DEMONSTRATE AN UNDERSTANDING OF THE INTERNATIONAL ACCOUNTING STANDARDS AND THE ROLE OF THE INTERNATIONAL ACCOUNTING STANDARDS BOARD.", "Textbook(s)": "SAUDAGARAN, SHAHROKH M. (2004).  INTERNATIONAL ACCOUNTING:  A USER PERSPECTIVE (2ND ED.).  THOMSON LEARNING.  \nISBN-10: 0324186207\nISBN-13: 9780324186208", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}