{"Course ID": "155134", "Institution": "RU - RASMUSSEN UNIVERSITY", "Course Name": "ACG 2930 - ACCOUNTING CAPSTONE", "Course Title": "ACCOUNTING CAPSTONE", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "SPECIAL TOPICS/SEMINARS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "10/02/2006", "Effective Date": "10/02/2006", "Discontinue Date": "", "Date SCNS Approved": "10/25/2007", "Term Type": "QUARTER", "Course Credits": "2.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE WILL BE A SYNTHESIS OF THE ACCOUNTING, BUSINESS, AND GENERAL EDUCATION COURSES OFFERED IN THE ACCOUNTING AS DEGREE PROGRAM. A STUDY OF EMERGING ISSUES AND TIMELY TOPICS IN FINANCIAL ACCOUNTING, PROFESSIONAL ETHICS, AND TRANSFERABLE SKILLS NECESSARY FOR THE SUCCESS OF AN ACCOUNTING GRADUATE, AND ACCOUNTING CAREERS WILL BE DISCUSSED. THIS COURSE FOCUSES ON RESEARCH, CASE ANALYSIS, AND INTER-PERSONAL COMMUNICATION AND CLASS PRESENTATIONS.", "Objectives / Learning Outcome(s) / Major Topics": "1.IDENTIFY NECESSARY SKILLS REQUIRED TO MEET CURRENT AND FUTURE DEMANDS FOR THE ACCOUNTING PROFESSIONAL.\n2.DETERMINE THROUGH GROUP, AND SELF-ASSESSMENT KNOWLEDGE AND SKILL LEVELS OBTAINED TO MEET MARKET DEMANDS.\n3.DESCRIBE THE OPPORTUNITIES AVAILABLE WITHIN THE ACCOUNTING PROFESSION, AND DETERMINE THROUGH RESEARCH WHAT ACCOUNTING CAREERS ARE BEST SUITED FOR THE ACCOUNTING GRADUATE.\n4.DEFINE THE ETHICS THAT ARE SPECIFIC TO THE ACCOUNTING PROFESSIONAL AND RECOGNIZE THE IMPORTANCE TO THE CREDIBILITY OF THE PROFESSION AS A WHOLE.\n5.RECOGNIZE HOW EFFECTIVE WRITING IS USED WITHIN THE FIELD OF ACCOUNTING AND APPLY CERTAIN TECHNIQUES USING CASE STUDIES, AND GROUP ACTIVITIES.\n6.PREPARE AND COMPLETE FINANCIAL STATEMENTS USING GENERALLY ACCEPTED ACCOUNTING PRINCIPLES. \n7.IDENTIFY THE ACCOUNTING CONCEPTS RELATED TO PROPER CLASSIFICATION AND PRESENTATION OF BALANCE SHEET, INCOME STATEMENT, AND CASH FLOW STATEMENTS. \n8.COMPLETE A PROJECT USING SPREADSHEET SOFTWARE THAT WILL DEMONSTRATE THE STUDENTS ABILITY TO MANAGE, MANIPULATE AND PRESENT ACCURATE FINANCIAL INFORMATION IN PROPER ACCOUNTING FORMAT.", "Textbook(s)": "MAY, CLAIRE B., & MAY, GORDON S. (2005).  EFFECTIVE WRITING:  A HANDBOOK FOR ACCOUNTANTS (7TH ED.).  PRENTICE HALL.  ISBN:  0131496816.\n\nSTUART, IRIS, & STUART, BRUCE (2003).  ETHICS IN THE POST-ENRON AGE.  SOUTH-WESTERN.  ISBN:  0324191936.", "Transfer Status": "NOT AUTOMATICALLY TRANSFERABLE", "Transaction Type": ""}