{"Course ID": "155131", "Institution": "RU - RASMUSSEN UNIVERSITY", "Course Name": "ACG 4402 - ACCOUNTING INFORMATION SYSTEMS", "Course Title": "ACCOUNTING INFORMATION SYSTEMS", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "OPEN", "Lab Code": " ", "Honors Course": "NO", "Add Date": "04/01/2007", "Effective Date": "04/01/2007", "Discontinue Date": "", "Date SCNS Approved": "10/25/2007", "Term Type": "QUARTER", "Course Credits": "4.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "AN ADVANCED COURSE THAT FURTHER DEVELOPS AN UNDERSTANDING OF THE ELEMENTS, RELATIONSHIPS, AND ISSUES ASSOCIATED WITH MANUAL AND COMPUTERIZED ACCOUNTING INFORMATION SYSTEMS. PRACTICAL APPLICATION USING SPREADSHEETS, DATABASES, AND GENERAL LEDGER SOFTWARE.", "Objectives / Learning Outcome(s) / Major Topics": "1.CONSTRUCT AND ANALYZE BUSINESS PROCESSES WITHIN AN ACCOUNTING INFORMATION SYSTEM.\n2.SELECT AND INTEGRATE APPROPRIATE AND EFFECTIVE USE OF TECHNOLOGY FOR MANAGING ACCOUNTING AND FINANCIAL INFORMATION FLOWS AND PRESENTATION.\n3.CONSTRUCT AND ASSESS THROUGH AND VALID ACCOUNTABILITY PROCESSES AND  ALL NECESSARY ACCOUNTING SYSTEM DOCUMENTATION PROCEDURES.\n4.EXAMINE SPECIAL TOPICS IN ACCOUNTING INFORMATION SYSTEMS TO INCLUDE THE IMPACT OF GLOBALIZATION AND A MULTINATIONAL BUSINESS PRESENCE.\n5.PREPARE AN EMERGENCY SUCCESSION PLAN FOR A BUSINESS INFORMATION SYSTEM BASED UPON VARIOUS DISASTER SCENARIOS.\n6.INTEGRATE SOFTWARE APPLICATIONS SUCH AS SPREADSHEETS, DATABASES, AND GENERAL LEDGER SOFTWARE INTO THE INFORMATION SYSTEM IN AN EFFICIENT AND COST EFFECTIVE MANNER..\n7.GIVEN A COMPREHENSIVE SET OF FACTS, EVALUATE AND RECOMMEND A VIABLE INFORMATION SYSTEMS SOLUTION FOR ACCOUNTING AND FINANCIAL DATA.", "Textbook(s)": "BODNAR AND HOPWOOD (2004).  ACCOUNTING INFORMATION SYSTEMS (9TH ED.).  PEARSON-PRENTICE HALL.  ISBN:  0130082058.\n\nOWEN, G. (2003).  EXCEL AND ACCESS FOR ACCOUNTING.  SOUTHWEST LEARNING.\nISBN: 0324068573.", "Transfer Status": "NOT A VALID CODE", "Transaction Type": ""}