{"Course ID": "187144", "Institution": "RU - RASMUSSEN UNIVERSITY", "Course Name": "ACG 1022 - FINANCIAL ACCOUNTING II", "Course Title": "FINANCIAL ACCOUNTING II", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "1", "Statewide Course": "ACCOUNTING PRIN-(CONDENSED)(4 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2010", "Effective Date": "08/01/2010", "Discontinue Date": "", "Date SCNS Approved": "1/7/2011", "Term Type": "QUARTER", "Course Credits": "4.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE IS A FURTHER CONTINUATION OF FINANCIAL ACCOUNTING I AND WILL STRESS FINANCIAL STATEMENT\nANALYSIS FOR PARTNERSHIPS AND CORPORATIONS. IT WILL ALSO EMPHASIZE CORPORATE ACCOUNTING, CORPORATE\nISSUING AND INVESTING IN DEBT AND EQUITY SECURITIES, FINANCIAL AND CASH-FLOW ANALYSIS, AND DECISION MAKING.\nTHE COURSE WILL INCLUDE MANUFACTURING ACCOUNTING METHODS USED FOR BUDGETING AND FORECASTING.", "Objectives / Learning Outcome(s) / Major Topics": "AT THE CONCLUSION OF THIS COURSE, STUDENTS WILL BE ABLE TO:\nCOMPUTE AND RECORD DEPRECIATION BY VARIOUS METHODS AND RECORD DISPOSALS OF FIXED ASSETS, AND ACCOUNTING FOR INTANGIBLES.\nDEVELOP A WORKING KNOWLEDGE OF PARTNERSHIP ACCOUNTING, INCLUDING FORMATION, DIVISION OF INCOME, AND LIQUIDATION. \nRECORD ENTRIES FOR CORPORATIONS, INCLUDING STOCK AND BOND ISSUANCE, TREASURY STOCK, AND DIVIDENDS.  \nANALYZE AND RECORD INVESTMENTS IN STOCKS AND BONDS.\nPERFORM RATIO ANALYSIS ON FINANCIAL STATEMENTS.\nPREPARE CASH-FLOW STATEMENTS AND ANALYSIS.\nPREPARE RETAINED EARNING STATEMENTS.\nRESEARCH, PREPARE, AND ANALYZE COMPARATIVE FINANCIAL DATA FOR A CORPORATION. PRESENT FINANCIAL ANALYSIS TO A BUSINESS AUDIENCE.\nPREPARE FINANCIAL STATEMENTS AND RECORD ENTRIES FOR A MANUFACTURING BUSINESS. \nPREPARE A MASTER BUDGET WITH INDIVIDUAL BUDGET COMPONENTS THAT INCLUDE AN OPERATING BUDGET, CAPITAL EXPENDITURES BUDGET, AND A FINANCIAL BUDGET.", "Textbook(s)": "FINANCIAL ACCOUNTING. WAYBRIGHT & KEMP. ISBN: 978-0-13-606048-2. PUBLISHER: PRENTICE HALL. COPYRIGHT: 2010.", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}