{"Course ID": "187146", "Institution": "RU - RASMUSSEN UNIVERSITY", "Course Name": "ACG 3151 - INTERMEDIATE FINANCIAL REPORTING III", "Course Title": "INTERMEDIATE FINANCIAL REPORTING III", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "FINANCIAL ACCOUNTING III", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2010", "Effective Date": "08/01/2010", "Discontinue Date": "", "Date SCNS Approved": "1/7/2011", "Term Type": "QUARTER", "Course Credits": "4.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "INTERMEDIATE FINANCIAL REPORTING III FOCUSES ON TOPICS IN FINANCIAL ACCOUNTING MEASUREMENT, INCLUDING REPORTING OF INCOME TAXES, ACCOUNTING CHANGES AND CORRECTION OF ERRORS, REVENUE MEASUREMENT, LEASES, PENSIONS, CASH FLOW, FINANCIAL STATEMENT ANALYSIS, INTERIM FINANCIAL REPORTS, AND REPORTING FOR SEGMENTS OF A BUSINESS ENTERPRISE.", "Objectives / Learning Outcome(s) / Major Topics": "APPLY CURRENT ACCOUNTING CONCEPTS, PRINCIPLES, AND STANDARDS (GAAP AND IFRS) TO BUSINESS AND EXAMINE THE ETHICAL IMPLICATIONS TO REAL-WORLD SCENARIOS AND PROBLEMS.\nDEMONSTRATE A PROFICIENCY IN USING THE ACCOUNTING STANDARDS CODIFICATION.\nEXAMINE THE CRITERIA AND CONDITIONS USED TO CLASSIFY LEASES AND IDENTIFY CIRCUMSTANCES THAT MOTIVATE LEASING. \nDETERMINE THE PURPOSE OF THE STATEMENT OF CASH FLOWS AND PREPARE A CASH FLOW STATEMENT USING THE INDIRECT AND DIRECT METHOD. \nDEMONSTRATE THE RECORDING OF MISCELLANEOUS TOPICS, INCLUDING ACCOUNTING CHANGES, ERROR CORRECTIONS, AND PRIOR-PERIOD ADJUSTMENTS.\nAPPLY ACCOUNTING PROCEDURES WITH RESPECT TO DEFERRED TAX RECOGNITION, VALUATION, AND INCOME TAX ALLOCATION.\nANALYZE THE DIFFERENCE BETWEEN THE EMPLOYERS PENSION PLAN AND THE ACCOUNTING FOR THE PENSION FUND AND EXPLAIN THE ALTERNATIVE MEASURES FOR VALUING THE PENSION OBLIGATION.\nEXAMINE THE USE OF NOTES IN FINANCIAL STATEMENT PREPARATION AND DESCRIBE THE REQUIREMENTS FOR MAJOR BUSINESS SEGMENTS AND INTERIM REPORTING.\nEVALUATE THE CURRENT INTERNATIONAL ACCOUNTING ENVIRONMENT AND IDENTIFY THE KEY PARTICIPANTS.\nDEMONSTRATE PROFICIENCY IN APPLYING PROPER ACCOUNTING CONCEPTS TO COMPLEX ACCOUNTING ISSUES.", "Textbook(s)": "INTERMEDIATE ACCOUNTING, 14TH EDITION\nBY DONALD E. KIESO, JERRY J. WEYGANDT, TERRY D. WARFIELD\nISBN 978-0-470-58723-2\nFEBRUARY 2011, 2012", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}