{"Course ID": "187147", "Institution": "RU - RASMUSSEN UNIVERSITY", "Course Name": "ACG 3642 - ADVANCED AUDITING CONCEPTS AND STANDARDS", "Course Title": "ADVANCED AUDITING CONCEPTS AND STANDARDS", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "AUDITING II(2 OF 2)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2010", "Effective Date": "08/01/2010", "Discontinue Date": "", "Date SCNS Approved": "1/7/2011", "Term Type": "QUARTER", "Course Credits": "4.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE INCLUDES A STUDY OF AUDITING STANDARDS AND PROCEDURES AND AN INTEGRATION OF PROFESSIONAL \nETHICS WITHIN THE ACCOUNTING DISCIPLINE. EMPHASIS IS PLACED ON ANALYTICAL THINKING, EVALUATION OF\nBUSINESS RISKS, AND INTERNAL CONTROL PRACTICES AND A THOROUGH STUDY OF SARBANES OXLEY AND OTHER RELEVANT LAWS AND REGULATIONS AS THEY RELATE TO PUBLICLY TRADED COMPANIES.", "Objectives / Learning Outcome(s) / Major Topics": "GIVEN ACCESS TO THE INTERNET, OTHER COMPUTER TECHNOLOGY, AND CLASSROOM MATERIAL, STUDENTS WILL BE ABLE TO:\n1.EXAMINE THE PROFESSIONAL PRACTICE OF AUDITING.\n2.IDENTIFY VARIOUS TYPES OF ATTESTATION SERVICES. \n3.GIVEN A SET OF FACTS, CREATE APPROPRIATE STEPS IN PLANNING AN AUDIT. \n4.PREPARE AUDIT REPORTS IN A MANNER CONSISTENT WITH ACCEPTED AUDITING STANDARDS. \n5.IDENTIFY AND EVALUATE REPORTABLE CONDITIONS AND MATERIAL WEAKNESSES IN INTERNAL CONTROL AND HOW INFORMATION TECHNOLOGY AFFECTS CONTROL RISK. \n6.IDENTIFY AND APPLY AUDITING PROCEDURES IN A BUSINESS ENVIRONMENT.\n7.DEMONSTRATE THE USE OF AUDITING JUDGMENT WITHIN AN ETHICAL ENVIRONMENT.\n8.APPLY RISK THEORY TO UNIQUE BUSINESS ENVIRONMENTS.\n9.ASSESS AND APPLY ADVANCED AUDITING TECHNIQUES USED IN BUSINESS.\n10.VALIDATE AND PRESENT COMPLETED AUDIT FINDINGS TO BUSINESS STAKEHOLDERS.\n11.DEMONSTRATE AN UNDERSTANDING OF THE LEGAL LIABILITY AND PROFESSIONAL ETHICAL BEHAVIOR OF AUDITORS BY ANALYZING AND RESPONDING TO CASE STUDIES TO INCLUDE ALL RAMIFICATIONS AND APPLICATION OF SARBANES-OXLEY.", "Textbook(s)": "ARENS, ELDER, BEASLEY.  AUDITING AND ASSURANCE SERVICES AND ACL SOFTWARE AND CASE BUNDLED (13TH ED).  PEARSON/PRENTICE HALL. ISBN:  13: 9780558701567.", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}