{"Course ID": "187145", "Institution": "RU - RASMUSSEN UNIVERSITY", "Course Name": "ACG 4201 - ADVANCED FINANCIAL ACCOUNTING", "Course Title": "ADVANCED FINANCIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "ADVANCED ACCOUNTING I(3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2010", "Effective Date": "08/01/2010", "Discontinue Date": "", "Date SCNS Approved": "1/7/2011", "Term Type": "QUARTER", "Course Credits": "4.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE FOCUSES ON THE IMPORTANCE OF THE OPERATIONAL FUNCTIONS IN ORGANIZATIONS TODAY TO INCLUDE BUSINESS COMBINATIONS AND THE RELATED FINANCIAL ACCOUNTING TRANSACTIONS NECESSARY, SEGMENT REPORTING, OUTPUT PLANNING, INTERNATIONAL TRANSACTION ACCOUNTING, FOREIGN CURRENCY TRANSACTIONS, INVENTORY CONTROL, SCHEDULING, AND QUALITY CONTROL. AN INTERWEAVING EMPHASIS WILL BE PLACED ON QUALITY AND ITS IMPACT IN SECURING A STRATEGIC ADVANTAGE FOR MANUFACTURING AND SERVICE ENTITIES.", "Objectives / Learning Outcome(s) / Major Topics": "GIVEN ACCESS TO THE INTERNET, OTHER COMPUTER TECHNOLOGY, AND CLASSROOM MATERIAL, STUDENTS WILL BE ABLE TO:\nILLUSTRATE THE REASONS BUSINESS COMBINATIONS OCCUR AND THE ACCOUNTING IMPLICATIONS OF SUCH TRANSACTIONS. \nCREATE JOURNAL ENTRIES NECESSARY FOR A GIVEN BUSINESS COMBINATION UNDER GENERALLY ACCEPTED ACCOUNTING PRINCIPLES. \nPREPARE CONSOLIDATED FINANCIAL STATEMENTS FOR A PARENT COMPANY AND SUBSIDIARY AS OF THE DATE OF A BUSINESS COMBINATION. \nPREPARE CONSOLIDATED FINANCIAL STATEMENTS ONE YEAR OR MORE FOLLOWING A BUSINESS COMBINATION, RECOGNIZING THE EFFECTS OF INTER-COMPANY TRANSACTIONS AND EVENTS. \nMEASURE AND RECORD EQUITY TRANSACTIONS BY A SUBSIDIARY OR OTHER INVESTEE COMPANY ON THE GENERAL LEDGER OF THE PARENT/INVESTOR CORPORATION. \nANALYZE THE DEVELOPMENT OF INTERNATIONAL ACCOUNTING STANDARDS AND THE IMPLICATIONS FOR U.S. CORPORATIONS. \nEXPLAIN THE BUSINESS PURPOSES OF DERIVATIVES AND HEDGING ACTIVITIES. \nMEASURE AND RECORD TRANSACTIONS DENOMINATED IN CURRENCIES OTHER THAN THE U.S. DOLLAR. \nCONVERT FINANCIAL STATEMENTS OF SUBSIDIARY COMPANIES FROM A LOCAL CURRENCY TO THE U.S. DOLLAR, IN ACCORDANCE WITH U.S. GAAP. \nEXPLAIN THE REQUIREMENTS FOR INTERIM FINANCIAL REPORTING AND SEGMENT DISCLOSURES IN FINANCIAL REPORTS OF PUBLICLY-OWNED COMPANIES. \n\nIDENTIFY AND DISCUSS THE UNIQUE CHARACTERISTICS OF A PARTNERSHIP AND COMPARE AND CONTRAST IT WITH A CORPORATE ORGANIZATION.", "Textbook(s)": "FISCHER, TAYLOR, AND CHENG.  FUNDAMENTALS OF ADVANCED ACCOUNTING (FIRST ED.).  CENGAGE.  ISBN:  10: 0324378904; 13: 978-0324378900.", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}