{"Course ID": "62851", "Institution": "PBSC - PALM BEACH STATE COLLEGE", "Course Name": "ACG 2100 - INTERMEDIATE ACCOUNTING", "Course Title": "INTERMEDIATE ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "INTERMEDIATE ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "08/15/2004", "Discontinue Date": "", "Date SCNS Approved": "6/11/1986", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.", "Prerequisites": "ACG 2071: MANAGERIAL ACCOUNTING", "Corequisites": "NONE", "Course Description": "CONCEPTUAL FRAMEWORK FOR FINANCIAL ACCOUNTING AND REPORTING PROVIDING IN DEPTH EXAMINATION OF THE ACCOUNTING PROCESS AND THE CONTENT OF FINANCIAL STATEMENTS, INCLUDING CASH, SHORT TERM INVESTMENTS, RECEIVABLES, INVENTORIES, CURRENT LIABILITIES, PLANT AND INTANGIBLE ASSETS AND LONG TERM INVESTMENTS. THIS COURSE MAY NOT BE TRANSFERABLE.", "Objectives / Learning Outcome(s) / Major Topics": "COURSE CORE OBJECTIVES\n\nREVIEW OF FINANCIAL ACCOUNTING, PLUS IN-DEPTH EXAMINATION OF BALANCE SHEET AND INCOME STATEMENT ITEMS HIGHLIGHTING RECENT FASB ANNOUNCEMENTS.\n\nCOURSE CORE OUTLINE\n\n1.\tOVERVIEW OF ACCOUNTING AND ITS THEORETICAL FOUNDATION.\n\n\t  A.\tTHE ACCOUNTING PROFESSION: HISTORICAL DEVELOPMENT, - ASSOCIATIONS AND REGULATIONS.\n\n\t  B.\tREVIEW OF THE ACCOUNTING PROCESS: PROCEDURES FOR COLLECTING, CLASSIFYING, RECORDING, SUMMARIZING AND INTERPRETING BUSINESS TRANSACTIONS.\n\nC.\tTHE CONCEPTUAL FRAMEWORK: OBJECTIVES, CHARACTERISTICS, AND ELEMENTS OF ACCOUNTING INFORMATION.  FASB AND CURRENT ISSUES.\n\n\t  D.\tFINANCIAL STATEMENT CONTENT: MEASURING AND REPORTING INCOME, REPORTING CHANGES IN RETAINED EARNINGS, PURPOSE AND CONTENT OF THE BALANCE SHEET.\n\n2.\tWORKING CAPITAL COMPONENTS:  CURRENT ASSETS AND CURRENT LIABILITIES.\n\nA.\tCASH AND TEMPORARY INVESTMENTS.\n\nB.\tRECEIVABLES: NATURE AND COMPOSITION - BALANCE SHEET PRESENTATION.\n\n\t  C.\tINVENTORIES: COST, ESTIMATION AND VALUATION PROCEDURES.\n\n\t  D.\tCURRENT LIABILITIES: MEASUREMENT, CLASSIFICATION, AND ESTIMATION.\n\n3.\tPLANT AND INTANGIBLE ASSETS, LONG-TERM INVESTMENTS.\n\n\t  A.\tPLANT AND INTANGIBLE ASSETS: ACQUISITION, SUBSEQUENT COSTS, EVALUATING GOODWILL - DEPRECIATION AND AMORTIZATION - EXCHANGES AND DISPOSITIONS.\n\n\t  B.\tLONG-TERM INVESTMENTS: IN DEBT AND EQUITY SECURITIES - IN OTHER ASSETS.\n\n4.\tLONG-TERM LIABILITIES.\n\n\t  A.\tREVIEW OF ACCOUNTING FOR LONG-TERM LIABILITIES.\n\n\t  B.\tBONDS: NATURE, KINDS, ACCOUNTING FOR ISSUANCE, CONVERSION, RETIREMENT, REFUNDING, VALUATION AND DEBT RESTRUCTURING.\n\n\t  C.\tPRESENT VALUE: CONCEPTS AND APPLICATION TO LIABILITIES.\n\n5.\tOWNERS EQUITY.\n\n\t  A.\tCONTRIBUTION CAPITAL: NATURE AND CLASSIFICATION OF CAPITAL STOCK - ISSUING STOCK - RIGHTS AND OPTIONS - TREASURY STOCK - RETIREMENTS AND CONVERSIONS - STOCK SPLITS - BALANCE SHEET PRESENTATION AND DISCLOSURES.\n\n\t  B.\tRETAINED EARNINGS: ADDITIONS AND DEDUCTIONS - REPORTING BOOK VALUE PER SHARE - ANALYSIS AND CORRECTION OF ERRORS.\n\n6.         FINANCIAL REPORTING.\n\n\t  A.\tSTATEMENT OF CASH FLOWS: NATURE AND PURPOSE - DIRECT AND INDIRECT REPORTING ALTERNATIVES - PREPARATION OF STATEMENT.\n\nSPECIAL REQUIREMENTS\n\nNONE.", "Textbook(s)": "SKOUSEN, K.F., STICE, E.K., & STICE J.D. (2000) INTERMEDIATE ACCOUNTING. (14TH ED.) CINCINNATI,\nOHIO: SOUTH WESTERN COLLEGE PUBLISHERS", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}