{"Course ID": "209056", "Institution": "KU - KEISER UNIVERSITY", "Course Name": "ACG 2450 - INTEGRATED ACCOUNTING", "Course Title": "INTEGRATED ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "BASIC COMPUTER AUGMENTED ACCOUNTING", "Lab Code": " ", "Honors Course": "NO", "Add Date": "07/28/2014", "Effective Date": "07/28/2014", "Discontinue Date": "", "Date SCNS Approved": "7/29/2014", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE IS AN INTEGRATION OF TRADITIONAL ACCOUNTING CONCEPTS WITH COMPUTERIZED ACCOUNTING PROCEDURES. SOFTWARE WILL BE USED TO COMPLETE AN ACCOUNTING CYCLE FOR BOTH A SERVICE AND MERCHANDISING BUSINESS.  TOPICS INCLUDE: JOURNAL ENTRIES, ACCOUNTS RECEIVABLE, ACCOUNTS PAYABLE, FINANCIAL STATEMENTS ALONG WITH FIXED ASSETS, PAYROLL TRANSACTIONS, AND BASIC FINANCIAL STATEMENT ANALYSIS.", "Objectives / Learning Outcome(s) / Major Topics": "COMPLETION OF THE ACCOUNTING CYCLE USING SOFTWARE FOR A SERVICE COMPANY\nCOMPLETION OF THE ACCOUNTING CYCLE USING SOFTWARE FOR A MERCHANDISING COMPANY\nBASIC FINANCIAL STATEMENT ANALYSIS \nUPON COMPLETION OF THE COURSE, STUDENTS ARE ABLE TO:\n1.RECORD BUSINESS TRANSACTION FOR A SERVICE COMPANY USING ACCOUNTING SOFTWARE\n2.COMPLETE THE ACCOUNTING CYCLE FOR A SERVICE COMPANY USING SOFTWARE\n3.RECORD BUSINESS TRANSACTION FOR A MERCHANDISING COMPANY USING ACCOUNTING SOFTWARE\n4.COMPLETE THE ACCOUNTING CYCLE FOR A MERCHANDISING  COMPANY USING SOFTWARE\n5.IMPROVE RESEARCH, PROBLEM SOLVING AND COMMUNICATION SKILLS WHILE PERFORMING BASIC FINANCIAL STATEMENT ANALYSIS\n6.DISCUSS PRINCIPLES OF ETHICAL AND PROFESSIONAL BUSINESS CONDUCT", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}