{"Course ID": "10935", "Institution": "CFK - THE COLLEGE OF THE FLORIDA KEYS", "Course Name": "ACG 2021 - FINANCIAL ACCOUNTING", "Course Title": "FINANCIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "ACCOUNTING PRIN-(CONDENSED)(3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "08/19/2021", "Discontinue Date": "", "Date SCNS Approved": "3/11/2022", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.A.S.", "Prerequisites": "GEB1011 OR FSS2251 WITH A GRADE OF C OR HIGHER.", "Corequisites": "NONE", "Course Description": "MAJOR TOPICS COVERED IN ACG 2021 ARE AS FOLLOWS: BASIC STRUCTURE OF ACCOUNTING, ACCOUNTING FOR MERCHANDISING ENTERPRISES, ACCOUNTING SYSTEMS, ACCOUNTING PRINCIPLES, PARTNERSHIPS, AND CORPORATIONS.", "Objectives / Learning Outcome(s) / Major Topics": "UPON COMPLETION OF THIS COURSE, STUDENT WILL BE ABLE TO:\n1. IDENTIFY THE ACCOUNTING EQUATION.\n2. APPLY THE PROPER RULES FOR DEBITING AND CREDITING WHEN MAKING GENERAL JOURNAL ENTRIES.\n3. UNDERSTAND THE ACCOUNTING CYCLE, INCLUDING THE PREPARATION OF A TRIAL BALANCE, PREPARING ADJUSTING ENTRIES, COMPLETING A WORKSHEET AND PREPARATION OF THE FINANCIAL STATEMENTS.\n4. UNDERSTAND THE PROPER ACCOUNTING FOR A MERCHANDISING OPERATION, INCLUDING THE CALCULATION OF COST OF GOODS SOLD AND PREPARATION OF A MULTI-STEP INCOME STATEMENT.\n5. DETERMINE THE ENDING INVENTORY VALUES UNDER VARIOUS ASSUMPTIONS (SUCH AS LIFO, FIFO, OR AVERAGE COSTING) UNDER BOTH THE PERIODIC AND PERPETUAL INVENTORY SYSTEMS.\n6. UNDERSTAND AND APPLY THE OBJECTIVES AND ELEMENTS OF INTERNAL CONTROL.\n7. UNDERSTAND AND APPLY THE ACCOUNTING FOR UNCOLLECTIBLE RECEIVABLES.\n8. DETERMINE THE PROPER VALUATION AND PRESENTATION OF CURRENT ASSETS, LONG-TERM ASSETS, CALCULATION OF DEPRECIATION, CURRENT AND LONG-TERM LIABILITIES (INCLUDING VALUATION AND PRESENTATION OF BONDS PAYABLE), AND STOCKHOLDERS' EQUITY ACCOUNTS.\n9. UNDERSTAND VALUING AND REPORTING INVESTMENTS IN THE FINANCIAL STATEMENTS.\n10. PREPARE A STATEMENT OF CASH FLOWS USING THE DIRECT AND INDIRECT METHODS.\n11. USE VARIOUS FINANCIAL RATIOS OT ANALYZE AN ORGANIZATION'S FINANCIAL STATEMENTS.", "Textbook(s)": "FINANCIAL & MANAGERIAL ACCOUNTING, 13TH EDITION\nPUBLISHER CENGAGE\nAUTHORS WARREN, REEVE & DUCHAC\nISBN 9781305516717", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}