{"Course ID": "214957", "Institution": "CFK - THE COLLEGE OF THE FLORIDA KEYS", "Course Name": "ACG 3024 - ACCOUNTING FOR NON-FINANCIAL MAJORS", "Course Title": "ACCOUNTING FOR NON-FINANCIAL MAJORS", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "ACCTG: MANAGERS & INVESTORS(NON-MAJORS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2016", "Effective Date": "08/01/2016", "Discontinue Date": "", "Date SCNS Approved": "2/18/2016", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE ADDRESSED THE USE OF ACCOUNTING INFORMATION BY NON-FINANCIAL MANAGERS. EMPHASIS IS PLACED ON THE INTERPRETATION OF ACCOUNTING INFORMATION AND THE LANGUAGE OF FINANCIAL ACCOUNTING TO EFFECTIVELY PARTICIPATE IN ACTIVITIES SUCH AS PLANNING, INVESTMENT, INTERNAL CONTROL, AND MANAGERIAL DECISION MAKING.", "Objectives / Learning Outcome(s) / Major Topics": "UPON SUCCESSFUL COMPLETION OF THIS COURSE, STUDENT WILL BE ABLE TO:\n1. EXPLAIN THE BASIC CONCEPTS OF FINANCIAL AND MANAGERIAL ACCOUNTING.\n2. DISCUSS ETHICAL PRACTICES IN ACCOUNTING AND EXPLAIN THEIR SIGNIFICANCE IN ESTABLISHING A VIABLE FINANCIAL MANAGEMENT STRATEGY.\n3. PREPARE, ANALYZE, AND INTERPRET FINANCIAL STATEMENTS FOR VARIOUS ORGANIZATIONS.\n4. CALCULATE FINANCIAL RATIOS AS TOOLS FOR THE ANALYSIS OF FINANCIAL PERFORMANCE.\n5. PREPARE AND EXPLAIN AN OPERATING BUDGET AND A CAPITAL EXPENSE BUDGET.\n6. USE THE TOOLS OF ACCOUNTING TO SOLVE PROBLEMS AND MAKE MANAGERIAL DECISIONS.\n7. DISCUSS THE INTERRELATIONSHIP BETWEEN PLANNING, DIRECTING, BUDGETING, AND FINANCIAL CONTROLS.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}