{"Course ID": "137027", "Institution": "SSCF - SEMINOLE STATE COLLEGE OF FLORIDA", "Course Name": "ACG 2071 - PRINCIPLES OF MANAGERIAL ACCOUNTING", "Course Title": "PRINCIPLES OF MANAGERIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "MANAGERIAL ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "03/04/1992", "Effective Date": "05/01/2019", "Discontinue Date": "", "Date SCNS Approved": "5/31/2005", "Term Type": "SEMESTER", "Course Credits": "3.00", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.A.", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE INTRODUCES THE STUDENT TO THE USE OF ACCOUNTING INFORMATION BY MANAGERS. TOPICS INCLUDE THE USE OF ACCOUNTING INFORMATION FOR PLANNING AND CONTROL, CAPITAL INVESTMENT, PERFORMANCE EVALUATION, DECISION-MAKING, AND THE STATEMENT OF CASH FLOWS, ALONG WITH FINANCIAL STATEMENT ANALYSIS.", "Objectives / Learning Outcome(s) / Major Topics": "PREPARE A STATEMENT OF CASH FLOWS.\nPERFORM A DISCOUNTED CASH FLOW ANALYSIS WITH A FOCUS ON CAPITAL BUDGETING.\nCALCULATE VARIOUS FINANCIAL RATIOS.\nDISTINGUISH BETWEEN FINANCIAL ACCOUNTING AND MANAGERIAL ACCOUNTING AND UNDERSTAND THE BASIC TERMINOLOGY INVOLVED IN ACCOUNTING FOR COSTS.\nCALCULATE COSTS AND JOURNALIZE TRANSACTIONS USING THE JOB ORDER COST SYSTEM.\nCALCULATE COSTS AND JOURNALIZE TRANSACTIONS USING THE PROCESS COST SYSTEM.\nCALCULATE OVERHEAD USING ACTIVITY-BASED COSTING.\nPREPARE THE MASTER BUDGET WITH SUPPORTING BUDGETS.\nCALCULATE TOTAL VARIANCES FOR DIRECT MATERIALS, DIRECT LABOR AND FACTORY OVERHEAD.\nCALCULATE THE BREAK-EVEN POINT AND OTHER STATISTICS USING COST-VOLUME-PROFIT ANALYSIS.\nPREPARE FINANCIAL STATEMENTS FOR A FIRM WHERE PRODUCTION AND SALES ARE NOT EQUAL USING ABSORPTION COSTING AND VARIABLE COSTING.\nDISTINGUISH BETWEEN CENTRALIZED AND DECENTRALIZED OPERATIONS AND BETWEEN COST CENTERS, PROFIT CENTERS AND INVESTMENT CENTERS.\nPREPARE AN INCOME STATEMENT THROUGH CONTRIBUTION MARGIN.\nUSE RATE OF RETURN ON INVESTMENT, PROFIT MARGIN AND INVESTMENT TURNOVER TO ANALYZE THE PERFORMANCE OF INVESTMENT CENTERS.\nMAKE OPERATING DECISIONS BASED ON DIFFERENTIAL ANALYSIS.\nCALCULATE PRODUCT PRICE USING THE COST-PLUS APPROACH BASED ON TOTAL COST, PRODUCT COST AND VARIABLE COST.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}