{"Course ID": "168056", "Institution": "SSCF - SEMINOLE STATE COLLEGE OF FLORIDA", "Course Name": "ACG 2360 - COST ACCOUNTING", "Course Title": "COST ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "BASIC COST ACCOUNTING-CONDENSED", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2008", "Effective Date": "08/01/2008", "Discontinue Date": "", "Date SCNS Approved": "10/7/2009", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.", "Prerequisites": "ACG 2021 AND ACG 2071 WITH A GRADE OF C OR HIGHER.", "Corequisites": "NONE", "Course Description": "THIS COURSE IS A STUDY OF THE FUNDAMENTAL OF COST ACCOUNTING WIHTIN AN INDUSTRIAL ORGANIZATION. THE ACCOUNTING FUNCTIONS RELATIVE TO MATERIALS, LABOR AND FACTORY OVERHEAD ARE TREATED IN DETAIL. JOB ORDER AND PROCESS COST SYSTEMS ARE FULLY EXPLORED. STANDARD COST SYSTEMS, BUDGETING AND MANAGERIAL CONTROL FUNCITONS ARE ALSO DISCUSSED.", "Objectives / Learning Outcome(s) / Major Topics": "1. UNDERSTAND THE SIGNIFICANT CHANGES TAKING PLACE IN THE BUSINESS ENVIRONMENT AND HOW FINANCIAL, MANAGEMENT AND COST ACCOUNTING RELATE TO EACH OTHER.\n2. UNDERSTAND THE PRIMARY FACTORS IN DETERMINING AN ORGANIZATION'S STRATEGIES, WHY THE FIRM'S STRATEGIES SHOULD CHANGE AND HOW ACCOUNTING RELATES TO ORGANIZATIONAL STRATEGIES.\n3. UNDERSTAND THE DESIGN AND USE OF ACTIVITY-BASED COSTING SYSTEMS.\n4. UNDERSTAND THE BASIC CHARACTERISTICS OF PRODUCT QUALITY AND SERVICE QUALITY, THE TYPES OF COST AND HOW THOSE COSTS ARE RELATED.\n5. UNDERSTAND HOW COSTS ARE CLASSIFIED, WHY SUCH CLASSIFICATION ARE USEFUL AND THE ASSUMPTIONS MADE RELATIVE TO COST BEHAVIOR.\n6. UNDERSTAND HOW AND WHY COST IS ALLOCATED TO PRODUCTS AND SERVICES.\n7. UNDERSTAND PROCESS COSTING AND COST OF PRODUCTION REPORT USING AVERAGE COSTING AND FIFO COSTING METHODS.\n8. UNDERSTNAD WHY LOST UNITS, NORMAL AND ABNORMAL, OCCUR IN MANUFACTURING PROCESS.\n9. UNDERSTAND COSTING FOR JOINT PRODUCTS AND BY-PRODUCTS.\n10. UNDERSTAND STANDARD COSTING, SETTING AND ANALYZING VARIANCES.\n11. UNDERSTAND FACTORY OVERHEAD AND OVERHEAD VARIANCES.\n12. UNDERSTAND COST-VOLUME PROFIT ANALYSIS AND BREAK-EVEN.\n13. UNDERSTAND CONTROL AND COSTING OF INVENTORY AND PRODUCTION.\n14. UNDERSTAND WHY BUDGETING IS IMPORTANT.", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}