{"Course ID": "209055", "Institution": "SSCF - SEMINOLE STATE COLLEGE OF FLORIDA", "Course Name": "ACG 3131 - INTERMEDIATE ACCOUNTING I", "Course Title": "INTERMEDIATE ACCOUNTING I", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "FINANCIAL ACCOUNTING CONCEPTS AND ANALYSIS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "01/01/2015", "Effective Date": "01/01/2015", "Discontinue Date": "", "Date SCNS Approved": "7/29/2014", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE DEALS WITH FINANCIAL ACCOUNTING PRACTICE AND THEORY, INCLUDING GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP); THE CONCEPTUAL FRAMEWORK; ACCOUNTING INFORMATION SYSTEMS, INCLUDING FINANCIAL STATEMENT REPORTING AND DISCLOSURES; THE TIME VALUE OF MONEY; CASH CONTROLS; AND ACCOUNTING AND REPORTING FOR CASH, RECEIVABLES, INVENTORIES, AND LONG-TERM ASSETS.", "Objectives / Learning Outcome(s) / Major Topics": "MEASURABLE COURSE OBJECTIVES:(UPON SUCCESSFUL COMPLETION OF THIS COURSE THE STUDENT WILL BE ABLE TO :)\n\n1.THE STUDENT SHOULD BE ABLE TO UNDERSTAND THE THEORY, OBJECTIVES AND CONCEPTUAL FRAMEWORK UNDERLYING FINANCIAL STATEMENT REPORTING AND BE ABLE TO EXPLAIN THESE CONCEPTS TO OTHER ACCOUNTANTS, MANAGERS AND BUSINESS PEOPLE. THE STUDENT WILL ALSO NEED TO UNDERSTAND THE ORGANIZATIONS (THE AUTHORITY) THAT SET ACCOUNTING STANDARDS AND HOW THEY DEVELOP THE RULES (GENERALLY ACCEPTED ACCOUNTING PRINCIPLES -GAAP) THAT GUIDE PRACTITIONERS IN THE PREPARATION OF ANNUAL REPORTS AND FINANCIAL STATEMENTS.\n\n2.THE STUDENT SHOULD BE ABLE TO UNDERSTAND AND EXPLAIN TO OTHER ACCOUNTANTS, MANAGERS, AND BUSINESS PEOPLE THE ACCOUNTING PROCESS, AS WELL AS WHY AND HOW A TRIAL BALANCE IS USED IN THE FINANCIAL STATEMENT PREPARATION PROCESS. ADDITIONALLY, THE STUDENT SHOULD UNDERSTAND AND BE ABLE TO: \nCOMPLETE A MULTI-COLUMN WORKSHEET WITH ADJUSTMENTS. \nPREPARE FINANCIAL STATEMENTS FROM THE WORKSHEET DATA. \nJOURNALIZE AND POST THE ADJUSTING AND CLOSING ENTRIES. \nPREPARE A POST-CLOSING TRIAL BALANCE. \nPREPARE AND POST REVERSING ENTRIES. \nUTILIZE SPECIAL JOURNALS AND SUBSIDIARY LEDGERS WHERE APPROPRIATE. \nDIFFERENTIATE CASH BASIS FROM ACCRUAL BASIS ACCOUNTING.\n\n3.THE STUDENT SHOULD BE ABLE TO UNDERSTAND AND EXPLAIN TO OTHER ACCOUNTANTS, MANAGERS AND BUSINESS PEOPLE, THE INCOME STATEMENT AND THE RELATED STATEMENT OF STOCKHOLDERS' EQUITY.\n\n4.THE STUDENT SHOULD ALSO BE ABLE TO PREPARE THE INCOME STATEMENT AND THE RELATED STATEMENT OF STOCKHOLDERS' EQUITY, BE ABLE TO CATEGORIZE THE SECTIONS AND SUBSECTIONS AND DISTINGUISH AND REPORT REGULAR AND IRREGULAR INCOME STATEMENT ITEMS. THE STUDENT SHOULD BE ABLE TO PREPARE A RECONCILIATION OF RETAINED EARNINGS AND CALCULATE BASIC EARNINGS PER SHARE.\n\n5.THE STUDENT SHOULD BE ABLE TO UNDERSTAND AND EXPLAIN TO OTHER ACCOUNTANTS, MANAGERS, AND BUSINESS PEOPLE THE BALANCE SHEET, ITS ELEMENTS AND THE CLASSIFICATIONS OF ASSET, LIABILITY, AND EQUITY SUBSECTIONS. THE STUDENT SHOULD BE ABLE TO IDENTIFY THE LIMITATIONS OF BALANCE SHEET INFORMATION AND THE PURPOSE OF NOTES, SUPPORTING SCHEDULES, SUPPLEMENTAL INFORMATION AND DISCLOSURES.\n\n6.THE STUDENT SHOULD BE ABLE TO UNDERSTAND AND EXPLAIN TO OTHER ACCOUNTANTS, MANAGERS AND BUSINESS PEOPLE THE TIME VALUE OF MONEY CONCEPT. THE STUDENT SHOULD ALSO BE ABLE TO USE THE CONCEPT IN THE ANALYSIS AND RECORDING OF TRANSACTIONS, AND IN THE PREPARATION OF THE FINANCIAL STATEMENTS.\n\n7.THE STUDENT SHOULD BE ABLE TO UNDERSTAND AND EXPLAIN TO OTHER ACCOUNTANTS, MANAGERS AND BUSINESS PEOPLE THE CURRENT ASSETS, CASH AND RECEIVABLES. THE STUDENT SHOULD ALSO BE ABLE TO UNDERSTAND AND EXPLAIN THE MANAGEMENT OF CASH AND ACCOUNTS RECEIVABLE USING INTERNAL CONTROL SYSTEMS AND BANK RECONCILIATION OF CASH AND THE RECOGNITION TOOLS AS WELL AS THE VALUATION AND DISPOSITION OF ACCOUNTS AND NOTES RECEIVABLE.\n\n8.THE STUDENT SHOULD UNDERSTAND AND BE ABLE TO EXPLAIN TO OTHER ACCOUNTANTS, MANAGERS AND BUSINESS PEOPLE THE INFORMATION ABOUT A COMPANY'S INVENTORY TRANSACTIONS. THE STUDENT'S UNDERSTANDING AND EXPLANATION SHOULD INCLUDE THE VALUATION OF INVENTORY (COST BASIS APPROACH AND ADDITIONAL VALUATION APPROACHES); THE FLOW OF INVENTORY COSTS THROUGH THE ACCOUNTING SYSTEM AND THE EFFECT OF INVENTORY ON FINANCIAL STATEMENT REPORTING.\n\n9.THE STUDENT SHOULD UNDERSTAND AND BE ABLE TO EXPLAIN TO OTHER ACCOUNTANTS, MANAGERS AND BUSINESS PEOPLE THE INFORMATION ABOUT A COMPANY'S PROPERTY, PLANT AND EQUIPMENT (LONG-LIVED ASSET) TRANSACTIONS. THE STUDENT'S UNDERSTANDING AND EXPLANATION SHOULD INCLUDE THE ACQUISITION, DEPRECIATION AND DISPOSAL OF LONG-LIVED ASSETS ALONG WITH THEIR EFFECT ON FINANCIAL STATEMENT REPORTING.\n\n10.GIVEN A COMPANYS FINANCIAL STATEMENTS AND INTANGIBLE ASSETS TRANSACTIONS, THE STUDENT SHOULD BE ABLE TO UNDERSTAND AND EXPLAIN THEM TO OTHER ACCOUNTANTS, MANAGERS, AND BUSINESS PEOPLE. THEIR UNDERSTANDING AND EXPLANATION SHOULD INCLUDE CONCEPTS RELATING TO THE ACQUISITION, AMORTIZATION, AND DISPOSAL OF INTANGIBLE ASSETS  (ORGANIZATIONAL COST, PATENTS, FRANCHISES, R & D, GOODWILL, AND COMPUTER SOFTWARE COSTS, AMONG OTHERS) AND AN ANALYSIS OF THE EFFECT OF INTANGIBLE ASSETS ON FINANCIAL STATEMENT REPORTING.\n\n11.GIVEN A COMPANYS FINANCIAL STATEMENTS AND CURRENT AND LONG-TERM LIABILITY TRANSACTIONS, THE STUDENT SHOULD BE ABLE TO UNDERSTAND AND EXPLAIN THEM TO OTHER ACCOUNTANTS, MANAGERS, AND BUSINESS PEOPLE. THEIR UNDERSTANDING AND EXPLANATION SHOULD INCLUDE CONCEPTS RELATING TO THE BORROWING PROCESS (DEBT FINANCE), THE LEGAL BASICS OF DEBT AND TRANSACTIONS THAT BRING DEBT INTO THE COMPANYS FINANCIAL STRUCTURE (SALES TAXES, PAYROLL TAXES, WARRANTIES, CONTINGENCIES, PURCHASES ON CREDIT, BANK LOANS, BONDS, AND OTHERS) AND AN ANALYSIS OF THE EFFECT OF LIABILITIES ON FINANCIAL STATEMENT REPORTING.", "Textbook(s)": "INTERMEDIATE ACCOUNTING FIFTEENTH EDITION BY KIESO, WEYGANDT, AND WARFIELD 2013 ISBN 978-1-118-14727-6", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}