{"Course ID": "203670", "Institution": "IRSC - INDIAN RIVER STATE COLLEGE", "Course Name": "ACG 3173 - ACCOUNTING FOR DECISION MAKERS", "Course Title": "ACCOUNTING FOR DECISION MAKERS", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "FINANCIAL ANALYSIS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/15/2012", "Effective Date": "02/20/2021", "Discontinue Date": "", "Date SCNS Approved": "2/22/2021", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2071 WITH GRADE OF C OR HIGHER", "Corequisites": "NONE", "Course Description": "THIS COURSE IS A STUDY OF HOW TO ANALYZE FINANCIAL STATEMENTS TO DETERMINE THE FINANCIAL CONDITION OF A BUSINESS ENTERPRISE. STUDENTS LEARN HOW MANGERS USE FINANCIAL AND NON-FINANCIAL INFORMATION TO IMPROVE AN ORGANIZATION’S OPERATIONAL EFFECTIVENESS. CAPITAL BUDGETS, OPERATIONAL BUDGETS, AND INVESTMENT DECISIONS ARE REVIEWED.", "Objectives / Learning Outcome(s) / Major Topics": "1.\tEXPLAIN HOW ACCOUNTING AS A DISCIPLINE SUPPORTS EFFECTIVE DECISION MAKING.\n2.\tCONSTRUCT AND USE BUDGETS FOR FINANCIAL CONTROL, PLANNING, AND COORDINATION.\n3.\tDECONSTRUCT MAJOR FINANCIAL STATEMENTS SUCH AS INCOME STATEMENTS, BALANCE SHEETS, AND CASH FLOW STATEMENTS.\n4.\tANALYZE DATA FOUND ON FINANCIAL STATEMENTS TO MAKE ORGANIZATIONAL DECISIONS.\n5.\tPREPARE MANAGEMENT REPORTS USED IN THE DECISION MAKING PROCESS.\n6.\tCOMPUTE FINANCIAL RATIOS, COMMON SIZE FINANCIAL STATEMENTS, AND OTHER ANALYTIC MEASURES USED TO IMPROVE OPERATIONAL EFFECTIVENESS.\n7.\tANALYZE HISTORIC CORPORATE PERFORMANCE.\n8.\tRESEARCH ECONOMIC AND INDUSTRY CONDITIONS THAT AFFECT CORPORATE ANALYSIS.\n9.\tLOCATE AND ANALYZE CURRENT FINANCIAL STATEMENT DISCLOSURES.\n10.\tFORECAST FINANCIAL PERFORMANCE.", "Textbook(s)": "CHARLES H. GIBSON, FINANCIAL REPORTING AND ANALYSIS, SPECIAL EDITION FOR IR", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}