{"Course ID": "175989", "Institution": "SPC - ST. PETERSBURG COLLEGE", "Course Name": "ACG 3103 - INTERMEDIATE ACCOUNTING I", "Course Title": "INTERMEDIATE ACCOUNTING I", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "INTERMEDIATE ACCOUNTING I(1 OF 3)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "12/19/2009", "Effective Date": "12/19/2009", "Discontinue Date": "", "Date SCNS Approved": "1/26/2010", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2071 AND ADMISSION TO ACCOUNTING-AS OR ACG 2071 AND ADMISSION TO BUSINESS-BS PROGRAM", "Corequisites": "NONE", "Course Description": "THIS COURSE EMPHASIZES THE THEORETICAL ASPECTS AND FRAMEWORKS OF FINANCIAL ACCOUNTING. TOPICS INCLUDE FINANCIAL STATEMENTS PREPARATION, REVENUE RECOGNITION, PRESENT VALUE OF INVESTMENTS, AND THE STUDY OF ASSETS. THE ASSETS COMPONENT FOCUSES ON CURRENT ASSETS SUCH AS CASH, RECEIVABLES, AND INVENTORIES.", "Objectives / Learning Outcome(s) / Major Topics": "1.THE STUDENT WILL EXAMINE THE ORIGIN, PURPOSE, AND APPLICATION OF THE GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP) ALONG WITH THE STANDARDS SET BY THE FINANCIAL ACCOUNTING STANDARDS BOARD (FASB).\n\n2.THE STUDENT WILL COMPLETE THE ACCOUNTING CYCLE: JOURNALIZE, POST TO THE GENERAL LEDGER, TRIAL BALANCES, ADJUSTING ENTRIES, CLOSING ENTRIES AND PREPARATION OF FINANCIAL STATEMENTS.\n\n3.THE STUDENT WILL ILLUSTRATE THE CHARACTERISTICS AND INTERPRETATION OF THE BALANCE SHEET, INCOME STATEMENT, RETAINED EARNINGS STATEMENT, CASH FLOWS STATEMENT AS WELL AS THE PURPOSE OF FINANCIAL STATEMENT DISCLOSURES.\n\n4.THE STUDENT WILL DESCRIBE THE REVENUE RECOGNITION CONCEPT AS PART OF INCOME MEASUREMENT AND PROFITABILITY ANALYSIS. \n\n5.THE STUDENT WILL SOLVE PROBLEMS INVOLVING THE CONCEPTS OF THE TIME VALUE OF MONEY, DISTINGUISH BETWEEN SIMPLE AND COMPOUND INTEREST, SOLVE ANNUITY PROBLEMS, AND APPLY FUTURE CASH FLOWS TO PRESENT VALUE MEASUREMENT.\n\n6.THE STUDENT WILL IDENTIFY CASH, CASH RELATED ITEMS, AND THE ISSUES INVOLVING THE RECOGNITION AND VALUATION OF ACCOUNTS AND NOTES RECEIVABLE.\n\n7.THE STUDENT WILL CALCULATE THE ENDING INVENTORY AND COST OF GOODS SOLD UNDER THE DIFFERENT INVENTORY VALUATION METHODS (FIRST IN FIRST OUT (FIFO), LAST IN FIRST OUT (LIFO) AND AVERAGE).\n\n8.THE STUDENT WILL CALCULATE INVENTORIES UNDER THE PERPETUAL AND PERIODIC INVENTORY SYSTEMS.", "Textbook(s)": "SPICELAND, SEPE, NELSON, TOMASSINI, INTERMEDIATE ACCOUNTING, 5TH EDITION, MCGRAW-HILL IRWIN", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}