{"Course ID": "159495", "Institution": "CC - CHIPOLA COLLEGE", "Course Name": "ACG 3103 - FINANCIAL ACCOUNTING & REPORTING I", "Course Title": "FINANCIAL ACCOUNTING & REPORTING I", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "INTERMEDIATE ACCOUNTING I(1 OF 3)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "05/01/2008", "Effective Date": "05/01/2008", "Discontinue Date": "", "Date SCNS Approved": "3/27/2008", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2021", "Corequisites": "NONE", "Course Description": "REVIEW OF THE BASIC ACCOUNTING CYCLE, FINANCIAL STATEMENT PREPARATION, AND THE FRAMEWORK OF ACCOUNTING THEORY.  AN IN-DEPTH STUDY OF THE ACCOUNTING FOR CURRENT ASSETS, FIXED ASSETS, INCLUDING DEPRECIATION, AND INTANGIBLE ASSETS.  THIS COURSE IS DESIGNED FOR THE ACCOUNTING MAJOR AND THE GENERAL STUDENT OF BUSINESS INTERESTED IN THE UNDERLYING PRINCIPLES FOR RECORDING AND REPORTING OF FINANCIAL INFORMATION FOR GENERAL PURPOSE FINANCIAL STATEMENTS.\n\nTHE COURSE PRESENTS THE THEORETICAL SETTING FOR ACCOUNTING PRACTICES AND PROCEDURES.  WHEN ALTERNATIVE POSITIONS CAN BE TAKEN ON MATTERS OF THEORY AND PRACTICE, SUCH ALTERNATIVES AND THE POSITIONS OF LEADING AUTHORITIES ARE DISCUSSED.  IN ADDITION TO POINTING OUT THE CONFLICTS THAT EXIST WITHIN THE TRADITIONAL STRUCTURE OF ACCOUNTING, THE COURSE STRIVES TO PROVIDE THE STUDENT WITH AN ANALYTICAL BASIS FOR MAKING HIS/HER OWN EVALUATION OF CONTROVERSIAL AREAS.\n\n3 SEMESTER HOURS CREDIT.", "Objectives / Learning Outcome(s) / Major Topics": "STUDENT WILL BE ABLE TO:\n\n1. UNDERSTAND AND APPLY ACCOUNTING PRINCIPLES AND TECHNIQUES RELATED TO THE COURSE TOPICS.\n2. EVALUATE THE COSTS AND BENEFITS OF THE VARIOUS ACCOUNTING STANDARDS LEARNED IN THIS COURSE.\n3. DEVELOP BASIC ANALYTICAL SKILLS RELATED TO PUBLIC FINANCIAL STATEMENTS.\n4. ENHANCE WRITING SKILLS.\n5. DEVELOP INTERPERSONAL SKILLS AND COMMUNICATION SKILLS IN AN ACCOUNTING CONTEXT", "Textbook(s)": "1. INTERMEDIATE ACCOUNTING, 8TH EDITION, KIESO AND WEYGANDT, JOHN WILEY AND SONS.\n2. FINANCIAL ACCOUNTING OBJECTIVE QUESTIONS AND EXPLANATIONS, GLEIM AND COLLINS, ACCOUNTING PUBLICATIONS, INC.", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}