{"Course ID": "100828", "Institution": "USF - UNIVERSITY OF SOUTH FLORIDA", "Course Name": "ACG 4501 - GOVERNMENTAL/NOT-FOR-PROFIT ACCOUNTING", "Course Title": "GOVERNMENTAL/NOT-FOR-PROFIT ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "GOV & INSTITUTIONAL ACC (3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "08/01/2011", "Discontinue Date": "", "Date SCNS Approved": "3/22/1983", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 3113 (C OR BETTER)", "Corequisites": "ACG 3113 (C OR BETTER, MAY BE TAKEN DURING THE SAME TERM)", "Course Description": "APPLICATION OF FINANCIAL AND MANAGERIAL ACCOUNTING, AND AUDITING, PRINCIPLES AND THEORY TO BOTH GOVERNMENTAL AND NOT-FOR-PROFIT ENTITIES.", "Objectives / Learning Outcome(s) / Major Topics": "A. OBJECTIVES \n1. DEVELOP AN UNDERSTANDING OF THE ACCOUNTING PRINCIPLES AND PRACTICES APPLICABLE TO GOVERNMENT AND NOT-FOR-PROFIT ENTITIES, AND HOW THESE DIFFER FROM PRINCIPLES AND PRACTICES USED IN BUSINESS. 2. CONTINUE TO DEVELOP COMMUNICATION SKILLS.\nB. LEARNING OUTCOMES \nAT THE CONCLUSION OF THIS COURSE THE STUDENT SHOULD: 1. BE ABLE TO RECORD AND REPORT TRANSACTIONS FOR GOVERNMENT AND NOT-FOR-PROFIT ENTITIES. 2. UNDERSTAND THE IMPORTANCE OF MANAGEMENT AND COST ACCOUNTING CONCEPTS TO THE OPERATION OF GOVERNMENT AND NOT-FOR-PROFIT ENTITIES. 3. KNOW THE TYPES OF AUDITS APPLICABLE TO GOVERNMENTS AND NOT-FOR-PROFITS, AND THE REGULATORY ENTITIES INVOLVED IN ESTABLISHING AUDIT STANDARDS. 4. HAVE AN ELEMENTARY UNDERSTANDING OF THE AUDIT REGULATIONS APPLICABLE TO GOVERNMENT AND NOT-FOR-PROFIT AUDITS. 5. BE ABLE TO ANALYZE GOVERNMENTAL ACCOUNTING AND AUDITING PROBLEMS AND APPLY INFORMATION LEARNED IN THIS COURSE.\nC. MAJOR TOPICS \nGOVERNMENTAL AND NOT-FOR-PROFIT ACCOUNTING AND FINANCIAL REPORTING (INCLUDING: GENERAL, SPECIAL REVENUE, PROPRIETARY, AND FIDUCIARY FUNDS; CAPITAL ASSETS AND CAPITAL PROJECTS, LONG-TERM LIABILITIES AND DEBT SERVICE, BUDGETS, AUDITS, AND NOT-FOR-PROFIT ACCOUNTING.)", "Textbook(s)": "ACCOUNTING FOR GOVERNMENTAL AND NONPROFIT ENTITIES, BY EARL R. WILSON, JACQUELINE L. RECK, AND SUSAN C. KATTELUS, (15TH EDITION), MCGRAW-HILL/IRWIN, 2010.", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}