{"Course ID": "226049", "Institution": "USF - UNIVERSITY OF SOUTH FLORIDA", "Course Name": "ACG 3006 - PROFESSIONAL TOPICS IN ACCOUNTING", "Course Title": "PROFESSIONAL TOPICS IN ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "PROFESSIONAL TOPICS IN ACCOUNTING", "Lab Code": " ", "Honors Course": "NO", "Add Date": "03/01/2018", "Effective Date": "03/01/2018", "Discontinue Date": "", "Date SCNS Approved": "3/28/2018", "Term Type": "SEMESTER", "Course Credits": "2-3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2021, ACG 2071", "Corequisites": "NONE", "Course Description": "THE COURSE  WILL DEVELOP AN  IN-DEPTH  UNDERSTANDING  OF  THE  THEORETICAL FRAMEWORKS  USED  IN  FINANCIAL  REPORTING AND  USE THIS  UNDERSTANDING TO ANALYZE  AND SOLVE COMPLEX ANALYTICAL PROBLEMS IN FINANCIAL REPORTING.", "Objectives / Learning Outcome(s) / Major Topics": "COURSE OBJECTIVES:\n1.UNDERSTAND THE FINANCIAL REPORTING CONCEPTUAL FRAMEWORK, THE ELEMENTS OF THE FINANCIAL \nSTATEMENTS, AND UNDERLYING ASSUMPTIONS OF GAAP.\n2.UNDERSTAND  WHEN  ELEMENTS  SHOULD  BE  RECOGNIZED,  HOW  THEY  SHOULD  BE  MEASURED \nADJUSTED, REPORTED, AND DISCLOSED.\n3.UNDERSTAND  THE  PURPOSE,  COMPONENTS,  PREPARATION,  AND  INTERRELATIONSHIP  OF  THE  FOUR \nFINANCIAL STATEMENTS.\n4.APPLY KNOWLEDGE OF PRINCIPAL MANUFACTURING INVENTORY COST FLOW METHODS (JOB ORDER AND PROCESS \nCOSTING) AS WELL AS DEMONSTRATE UNDERSTANDING OF DIFFERENCE BETWEEN INVENTORY VALUATION FOR RETAIL \nAND MANUFACTURING COMPANIES. \n5.USE KNOWLEDGE TO ANALYZE COMPLEX FINANCIAL REPORTING CASES BY INFERRING BUSINESS TRANSACTIONS AND \nTRANSACTION AMOUNTS USING T-ACCOUNTS AND FULLY USING SIMPLE TECHNOLOGY APPLICATIONS TO RECORD \nEVENTS\nPROFESSIONAL  ACCOUNTING TOPICS IS  AN  ELECTIVE  COURSE IN  THE ACCOUNTING CURRICULUM.IT IS DESIGNED TO PROVIDE AN IN DEPTH UNDERSTANDING OF SELECTED ACCOUNTING CONCEPTS. STUDENTS WILL LEARN THE FOLLOWING IN THIS COURSE:\n\n1. FINANCIAL ACCOUNTING MEASUREMENT THEORY AND CONCEPTS.\n2. THE METHODOLOGY USED BY PROFESSIONAL ACCOUNTANTS IN APPLYING GENERALLY ACCEPTED ACCOUNTING PRINCIPLES TO BUSINESS TRANSACTIONS TO RECORD REGULAR EVENTS AND ADJUSTING ENTRIES.\n3. THE METHODOLOGY USED BY PROFESSIONAL ACCOUNTANTS TO CONSTRUCT FINANCIAL STATEMENTS FROM RECORDED TRANSACTIONS. \n4. ANALYTICAL SKILLS THROUGH THE SOLVING OF COMPLEX ACCOUNTING CASES AND PROBLEMS.\n5. RELATE INVENTORY COSTING ISSUES ENCOUNTERED IN FINANCIAL REPORTING TO ISSUES ENCOUNTERED IN COST ACCOUNTING.\nA FRAMEWORK FOR FINANCIAL ACCOUNTING\nTHE ACCOUNTING CYCLE: END OF THE PERIOD \nCASH AND INTERNAL CONTROLS\nRECEIVABLES AND SALES\nINVENTORY AND COST OF GOODS SOLD\nLONG TERM ASSETS: ACQUISITION, COST ALLOCATION, ASSET DISPOSITION\nCURRENT LIABILITIES\nTIME VALUE OF MONEY\nLONG TERM LIABILITIES\nSTOCKHOLDERS EQUITY: CONTRIBUTED CAPITAL, EARNED CAPITAL, ACCUMULATED OTHER COMPREHENSIVE INCOME\nNORTON CASE SUPPLEMENTAL ANALYTICAL CASE", "Textbook(s)": "SPICELAND, THOMAS AND HERMAN. FINANCIAL ACCOUNTING, 4TH ED. MCGRAW-HILL EDUCATION EDUCATION, NEW YORK.\nISBN 97812593079592.\nALVIN A. ARENS, D. DEWEY WARD & CAROL J. BORSUM. COMPUTERIZED ACCOUNTING USING QUICKBOOKS PRO 2015 4TH\nEDITION. ARMOND DALTON. ISBN. 9780912503592", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}