{"Course ID": "35364", "Institution": "USF - UNIVERSITY OF SOUTH FLORIDA", "Course Name": "ACG 3074 - MANAGERIAL ACCOUNTING FOR NON-BUSINESS MAJORS", "Course Title": "MANAGERIAL ACCOUNTING FOR NON-BUSINESS MAJORS", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "MANAGERIAL ACCOUNTING FOR ENGINEERS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "08/01/2018", "Discontinue Date": "", "Date SCNS Approved": "8/1/2018", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "YES", "Rule 6A-10.030 Writing": "YES", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THE STUDY OF THE USES OF ACCOUNTING DATA INTERNALLY BY MANAGERS IN PLANNING AND CONTROLLING THE AFFAIRS OF ORGANIZATIONS.", "Objectives / Learning Outcome(s) / Major Topics": "OBJECTIVES:\nSTUDENTS WILL: 1)\tUNDERSTAND HOW TO MEASURE BUSINESS ACTIVITIES, PROCESS THAT INFORMATION TO PREPARE FINANCIAL REPORTS, AND USE REPORTS TO MAKE BUSINESS DECISIONS. 2) READ AND INTERPRET FINANCIAL STATEMENTS FOR A PUBLICLY TRADED COMPANY. 3)\tLEARN CORE MANAGERIAL ACCOUNTING TECHNIQUES TO USE ACCOUNTING INFORMATION TO: A)\tCOLLECT COSTS AND DETERMINE PROFIT BY JOB B)\tANALYZE COST-VOLUME-PROFIT RELATIONSHIPS C)\tDEVELOP A BUDGET TO COORDINATE ACTIVITIES D)\tEVALUATE PERFORMANCE OF COMPANY MANAGEMENT E)\tMAKE DECISIONS\n\nLEARNING OUTCOMES:\nAFTER COMPLETING THIS COURSE, YOU SHOULD BE ABLE TO: 1.\tPREPARE VARIOUS FINANCIAL STATEMENTS USED FOR REPORTING BUSINESS ACTIVITY AND FOR MAKING BUSINESS DECISIONS. 2. IDENTIFY AND CRITICALLY INTERPRET RELEVANT INFORMATION CONTAINED IN FINANCIAL STATEMENTS TO MAKE INFORMED BUSINESS DECISIONS. 3.\tANALYZE INFORMATION CONTAINED IN BUSINESS REPORTS TO FORM OPINIONS AND MAKE CONCLUSIONS ABOUT A FIRM’S PROFITABILITY AND FINANCIAL STABILITY, INDEPENDENT OF ASSERTIONS MADE BY THE FIRM (I.E., DECLARATIONS BY MANAGEMENT AND BOARD MEMBERS). 4.\tDEMONSTRATE MANAGEMENT ACCOUNTING TECHNIQUES USED IN PLANNING AND DECISION MAKING, INCLUDING PREPARATION OF OPERATING PLANS, JOB COSTING, COST-VOLUME-PROFIT ANALYSIS, AND PERFORMANCE EVALUATION. 5.\tCRITICALLY INTERPRET QUANTITATIVE EVIDENCE (SUCH AS GRAPHS, TABLES, CHARTS) IN ORDER TO IDENTIFY FALSE CLAIMS, INCORRECT USE OF EVIDENCE, OR CONTRADICTORY STATEMENTS (ALSO INCLUDED IN LO 2,3). 6.\tREVISE SUBMITTED COURSEWORK BY INTEGRATING NEW SOURCES OF INFORMATION AND DETERMINING RELEVANCE OF EXISTING SOURCES. (ALSO INCLUDED IN LO 2,4) (PLEASE NOTE: TABLE 1. ATTACHED MAPS LEARNING OUTCOMES AND GENERAL EDUCATION COMPETENCIES TO ASSIGNMENTS)\n\nMAJOR TOPICS:\nFINANCIAL ACCOUNTING 1)\tFINANCIAL STATEMENTS AND FINANCIAL ACCOUNTING CONCEPTS 2)\tTRANSACTION ANALYSIS MANAGERIAL ACCOUNTING 3)\tCOST BEHAVIOR AND ANALYSIS 4) FINANCIAL PLANNING AND COORDINATION 5)\tPERFORMANCE EVALUATION 6)\tDECISION MAKING", "Textbook(s)": "FINANCIAL & MANAGERIAL ACCOUNTING (5TH EDITION) BY NOBLES / MADISON / MATSUMURA CUSTOM TEXT WITH ACCESS CODE. ISBN 9780133252965:", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}