{"Course ID": "59592", "Institution": "USF - UNIVERSITY OF SOUTH FLORIDA", "Course Name": "ACG 4351 - COST ACCOUNTING AND CONTROL II", "Course Title": "COST ACCOUNTING AND CONTROL II", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "COST ACCOUNTING II (2 OF 2)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "03/07/2006", "Discontinue Date": "", "Date SCNS Approved": "2/23/1990", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 3103 AND ACG 3341 WITH A GRADE OF C OR BETTER (NOT C -) IN EACH COURSE.", "Corequisites": "NONE", "Course Description": "APPLICATION OF THE MATERIAL COVERED IN ACG 3341 WITH SPECIFIC EMPHASIS ON COST ALLOCATIONS, PERFORMANCE MEASUREMENTS, ANALYSIS OF CURRENT COST ACCOUNTING SYSTEMS AND ACCOUNTING IN TODAYS ENVIRONMENT (GIVING CONSIDERATION TO THE INFLUENCES OF THE INTERNATIONAL ENVIRONMENT).", "Objectives / Learning Outcome(s) / Major Topics": "OBJECTIVES:\nTHE OBJECTIVES OF COST ACCOUNTING AND CONTROL II ARE TO PROVIDE EXPERIENCES THAT WILL ENHANCE THE STUDENTS' CRITICAL THINKING AND COMMUNICATION SKILLS AND TO ENABLE STUDENTS' TO UNDERSTAND: 1. HOW COST AND MANAGERIAL ACCOUNTING EVOLVED; 2. THE APPLICATION OF ACTIVITY-BASED COSTING AND ACTIVITY BASED MANAGEMENT, BOTH IN MANUFACTURING AND SERVICE INDUSTRIES, AND COMPREHEND THE SALIENT ISSUES AND RELEVANT CONTROVERSIES; 3. NEW TECHNIQUES IN MANAGEMENT ACCOUNTING SUCH AS THE BALANCED SCORECARD, TARGET COSTING, LIFE CYCLE COSTING, THEORY OF CONSTRAINTS, AND ECONOMIC VALUE ADDED. \n\nLEARNING OUTCOMES:\nAFTER COMPLETION OF THE COURSE, THE STUDENT SHOULD: 1. UNDERSTAND HOW COST AND MANAGERIAL ACCOUNTING EVOLVED; 2. UNDERSTAND THE APPLICATION OF ACTIVITY-BASED COSTING AND ACTIVITY BASED MANAGEMENT, BOTH IN MANUFACTURING AND SERVICE INDUSTRIES, AND COMPREHEND THE SALIENT ISSUES AND RELEVANT CONTROVERSIES; 3. UNDERSTAND NEW TECHNIQUES IN MANAGEMENT ACCOUNTING SUCH AS THE BALANCED SCORECARD, TARGET COSTING, LIFE CYCLE COSTING, THEORY OF CONSTRAINTS, AND ECONOMIC VALUE ADDED; 4. THINK CRITICALLY AND COMMUNICATE EFFECTIVELY. \n\nMAJOR TOPICS:\nHISTORY OF COST AND MANAGERIAL ACCOUNTING. REVIEW OF ACG 3341 TOPICS. THEORY OF CONSTRAINTS. TARGET COSTING. TRANSFER PRICING. CORPORATE GOVERNANCE. SUPPLY CHAIN LOGISTICS. TECHNOLOGY OF COST SYSTEMS. LEAN ACCOUNTING. GERMAN COST ACCOUNTING & RESOURCE CONSUMPTION ACCOUNTING. PERFORMANCE EVALUATION AND BALANCED NETS. LIFE-CYCLE COSTING. COST OF QUALITY (TQM, SIX SIGMA, ISO 9000, EVA).", "Textbook(s)": "THE DESIGN OF COST MANAGEMENT SYSTEMS BY COOPER AND KAPLAN.", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}