{"Course ID": "8872", "Institution": "USF - UNIVERSITY OF SOUTH FLORIDA", "Course Name": "ACG 2071 - PRINCIPLES OF MANAGERIAL ACCOUNTING", "Course Title": "PRINCIPLES OF MANAGERIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "MANAGERIAL ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "08/01/1996", "Discontinue Date": "", "Date SCNS Approved": "2/5/1982", "Term Type": "", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2021 WITH A GRADE OF \"C-\" OR BETTER", "Corequisites": "NONE", "Course Description": "A STUDY OF THE ACCOUNTANT'S ROLE IN ASSISTING MANAGEMENT IN THE PLANNING AND CONTROLLING OF BUSINESS ACTIVITIES.", "Objectives / Learning Outcome(s) / Major Topics": "OBJECTIVES:\n\nAS DECISION MAKERS WHO ACCOMPLISH GOALS AND OBJECTIVES THROUGH OTHERS, MANAGERS NEED FINANCIAL INFORMATION THAT IS TIMELY, RELEVANT, AND USEFUL FOR FORMULATING STRATEGIES AND POLICIES, MAKING NON-ROUTINE DECISIONS (E.G., ADDING OR DELETING A PRODUCT OR SERVICE, CHOOSING BETWEEN MAKING OR BUYING COMPONENT PARTS, DETERMINING WHETHER TO OUTSOURCE SERVICES, INVESTING IN LONG-LIVED ASSETS), AND PLANNING AND CONTROLLING ROUTINE OPERATIONS.  PUBLISHED FINANCIAL STATEMENTS ARE ALMOST ALWAYS INADEQUATE FOR MANAGEMENT DECISION MAKING BECAUSE FINANCIAL ACCOUNTING FOCUSES ON PAST, COMPLETED TRANSACTIONS AND IS CONSTRAINED BY OUTSIDER-ORIENTED GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP).\n\nIN MANAGEMENT ACCOUNTING, THESE CONSTRAINTS ARE DROPPED AND THE EMPHASIS IS SHIFTED TO THE KINDS OF PRESENT AND FUTURE-ORIENTED INFORMATION MANAGERS NEED TO MAKE SOUND STRATEGIC AND OPERATING DECISIONS.  IN THIS CONTEMPORARY MANAGEMENT ACCOUNTING COURSE, WE FOCUS ON USING ACCOUNTING INFORMATION FOR INTERNAL DECISION MAKING.  TOPICS COVERED WILL INCLUDE THE USE OF DIFFERENT COSTS FOR DIFFERENT PURPOSES, COST ACCUMULATION FOR PRODUCT COSTS VS. COST ACCUMULATION FOR MANAGEMENT PLANNING AND CONTROL, COST ALLOCATION, BUDGETING, COST BEHAVIOR, TRANSFER PRICING, AND THE USE OF COST, REVENUE, AND INVESTMENT INFORMATION FOR PERFORMANCE EVALUATION.  EMPHASIS WILL BE PLACED ON TECHNIQUES SUCH AS ACTIVITY-BASED COSTING AND ACTIVITY-BASED MANAGEMENT, JUST-IN-TIME, AND THE BALANCED SCORECARD.\n\nOUTCOMES:\n\nUPON COMPLETING THIS COURSE, STUDENTS SHOULD HAVE A GOOD UNDERSTANDING OF:\nMANAGEMENT DECISION-MAKING\nMANAGEMENT PLANNING AND CONTROL\nCOST ALLOCATION\nBUDGETING\nUSE OF COST REVENUE AND INVESTMENT INFORMATION FOR PERFORMANCE EVALUATION\n\nTOPICS:\n\nROLE, HISTORY AND DIRECTION OF MANAGEMENT ACCOUNTING / BASIC COST CONCEPTS\nACTIVITY BASED MANAGEMENT AND COSTING\nTRADITIONAL TOPICS:  JOB-ORDER COSTING, COST-VOLUME-PROFIT, RELEVANT COSTING\nTHEORY OF CONSTRAINTS\nCAPITAL INVESTMENT DECISIONS\nPERFORMANCE MEASUREMENTS INCLUDING THE BALANCED SCORECARD\nQUALITY COSTS AND PRODUCTIVITY", "Textbook(s)": "MANAGEMENT ACCOUNTING (6TH ED.) BY HANSEN & MOWEN, ITP/WEST\nMANAGEMENT ACCOUNTING STUDY GUIDE (6TH ED.)", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}