{"Course ID": "221344", "Institution": "AU - ATLANTIS UNIVERSITY", "Course Name": "ACG 1001 - PRINCIPLES OF ACCOUNTING", "Course Title": "PRINCIPLES OF ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "1", "Statewide Course": "PRINCIPLES OF ACCOUNTING I", "Lab Code": " ", "Honors Course": "NO", "Add Date": "01/07/2018", "Effective Date": "03/25/2022", "Discontinue Date": "", "Date SCNS Approved": "3/25/2022", "Term Type": "SEMESTER", "Course Credits": "3.00", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": "MATH", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "A.S.BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "PRINCIPLES OF ACCOUNTING FOCUSES ON WAYS IN WHICH ACCOUNTING PRINCIPLES ARE USED IN BUSINESS OPERATIONS. STUDENTS WILL LEARN ABOUT THE BASICS OF ACCOUNTING, INCLUDING HOW TO USE GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP), LEDGERS, AND JOURNALS. STUDENTS WILL ALSO BE INTRODUCED TO THE STEPS OF THE ACCOUNTING CYCLE, CONCEPTS OF ASSETS AND LIABILITIES, AND GENERAL INFORMATION ABOUT ACCOUNTING INFORMATION SYSTEMS. THIS COURSE ALSO PRESENTS BANK RECONCILIATION METHODS, BALANCE SHEETS, AND BUSINESS ETHICS", "Objectives / Learning Outcome(s) / Major Topics": "THE GRADUATE ANALYZES THE USE OF ACCOUNTING INFORMATION SYSTEMS FOR VARIOUS BUSINESS FUNCTIONS. \nTHE GRADUATE PERFORMS ACCOUNTING TASKS RELATED TO FINANCIAL ASSETS FOR BUSINESSES AND INDIVIDUALS. \nTHE GRADUATE USES ACCOUNTING PRINCIPLES TO ACCURATELY RECORD INFORMATION, POST AND MODIFY TRANSACTIONS, AND PREPARE VARIOUS FORMS USED IN ACCOUNTING.\nTHE GRADUATE PERFORMS ACCOUNTING TASKS RELATED TO FINANCIAL LIABILITIES FOR BUSINESSES AND INDIVIDUALS. \nTHE GRADUATE ANALYZES THE ROLE OF ACCOUNTING AND ITS APPLICATIONS IN VARIOUS FIELDS. \nTHE GRADUATE ANALYZES ACCOUNTING THEORY AND WHY IT IS IMPORTANT IN REAL-WORLD SITUATIONS.", "Textbook(s)": "COLLEGE ACCOUNTING. JAMES A. HEINTZ, ROBERT W. PARRY. SOUTH WESTERN COLLEGE PUBLISHING. ISBN 978-1305666160", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": "", "Credential": "ACADEMIC TRANSFER", "Credential Effective Date": "11/30/2017"}