{"Course ID": "177221", "Institution": "FNU - FLORIDA NATIONAL UNIVERSITY", "Course Name": "ACG 4651 - AUDITING", "Course Title": "AUDITING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "AUDITING-CONDENSED (3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "02/28/2010", "Effective Date": "02/28/2010", "Discontinue Date": "", "Date SCNS Approved": "4/20/2010", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 4101 INTERMEDIATE ACCOUNTING I; ACG 4111 INTERMEDIATE ACCOUNTING II & ACG 4213 INTERMEDIATE ACCOUNTING III", "Corequisites": "NONE", "Course Description": "THIS COURSE COVERS AUDITING ETHICS AND THE ROLE OF THE AUDITOR. IT INCLUDES THE TOOLS AND TECHNIQUES FOR CONDUCTING AN AUDIT, SAMPLING TECHNIQUES AND THEIR APPLICATIONS, AREAS TO BE AUDITED AND AUDIT REPORTING REQUIREMENTS. IT ALSO INCLUDES A REVIEW OF THE REQUIREMENTS FOR AUDITS OF PUBLIC COMPANIES UNDER THE  SARBANES-OXLEY ACT.", "Objectives / Learning Outcome(s) / Major Topics": "1. THE AUDIT PROFESSION, REPORTING REQUIREMENTS, AND LEGAL LIABILITY.\n2. THE CODE OF PROFESSIONAL STANDARDS AND ETHICAL STANDARDS.\n3. THE AUDIT PROCESS, PLANNING, MATERIALITY AND RISK ASSESSMENT AND THE USE OF TECHNOLOGY.\n4. THE APPLICATION OF AUDIT TECHNIQUES TO SALES AND COLLECTION CYCLES INCLUDING THE TEST OF CONTROLS.\n5. THE APPLICATION OF AUDIT TECHNIQUES TO OTHER CYCLES INCLUDING PAYROLL, PERSONNEL AND INVENTORY.\n6. HOW AUDITS ARE COMPLETED AND REPORTED.\n7. HOW THE NEW RULES UNDER SARBANES-OXLEY APPLY TO AUDITORS.\n\n1. UNDERSTAND AND APPLY THE ETHICAL AND PROFESSIONAL ROLES OF AN AUDITOR\n2. UNDERSTAND AND APPLY THE TOOLS AND TECHNIQUES FOR CONDUCTING AUDITS\n3. UNDERSTAND AND APPLY THE SPECIAL REQUIREMENT OF THE SABANES-OXLEY ACT FOR AUDITS OF PUBLIC COMPANIES \n4. APPRECIATE THE REQUIREMENTS OF CONDUCTING AND REPORTING AN AUDIT.", "Textbook(s)": "AUDITING AND ASSURANCE SERVICES  AN INTEGRATED APPROACH\n ARENS, ELDER & BEASLEY/PEARSON", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}