{"Course ID": "12378", "Institution": "UCF - UNIVERSITY OF CENTRAL FLORIDA", "Course Name": "ACG 2021 - PRINCIPLES OF FINANCIAL ACCOUNTING", "Course Title": "PRINCIPLES OF FINANCIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "2", "Statewide Course": "ACCOUNTING PRIN-(CONDENSED)(3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "05/01/2016", "Discontinue Date": "", "Date SCNS Approved": "12/3/1981", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "MAC 1105C WITH A \"C\" (2.0) OR BETTER.", "Corequisites": "NONE", "Course Description": "NATURE OF ACCOUNTING, FINANCIAL STATEMENTS, THE ACCOUNTING CYCLE, ASSETS, CURRENT LIABILITIES, LONG-TERM DEBT, AND OWNER'S EQUITY; ACCOUNTING FOR PROPRIETORSHIPS AND CORPORATIONS.", "Objectives / Learning Outcome(s) / Major Topics": "STUDENTS WILL DEVELOP THROUGHOUT THIS COURSE:/N1. AN UNDERSTANDING OF THE PROCESS OF MEASURING AND DOCUMENTING INDIVIDUAL BUSINESS TRANSACTIONS TO ALLOW FOR THE AGGREGATION OF INFORMATION./N2. AN APPRECIATION FOR HOW ACCOUNTING PRINCIPLES AND DIFFERENT ACCOUNTING TREATMENTS GUIDE THE RECORDING OF TRANSACTIONS TO ULTIMATELY PROVIDE CONSISTENCY AND DIFFERENCES IN THE FINANCIAL REPORTING./N/N3. THE ABILITY TO COMPLETE THE ACCOUNTING CYCLE TO CONSTRUCT FINANCIAL STATEMENTS THAT ARE USEFUL FOR DECISION-MAKING./N/N4. IDENTIFY COMMON FRAUD FOUND IN FINANCIAL REPORTING, AND INTERNAL CONTROLS THAT CAN REDUCE THE LIKELIHOOD OF FRAUD./N/N5. ANALYZE HOW TRANSACTIONS COMMON TO LARGE CORPORATIONS IMPACT EACH OF THE FINANCIAL STATEMENTS, WITH SPECIFIC EMPHASIS ON THE INCOME STATEMENT./N/N6. DEVELOP AN UNDERSTANDING OF THE INTERRELATIONSHIPS WITHIN THE FINANCIAL STATEMENTS.\n\nBLOCK 1/N ACCOUNTING CYCLE - THE PROCESS OF MEASURING/DOCUMENTING BUSINESS TRANSACTIONS THAT ALLOWS FOR AGGREGATION OF INFORMATION TO PREPARE FINANCIAL REPORTING TO PROVIDE COMMUNICATE WITH DECISION MAKERS (CHAPTERS 1 - 3)./N/NBLOCK 2/N/NINTERNAL CONTROLS - USED TO PROTECT COMPANY RESOURCES AND PRODUCE ACCURATE AND RELIABLE FINANCIAL REPORTING (CHAPTER 4)./NPART 1 - ACCOUNTING PRINCIPLES AND TREATMENTS - USED TO GUIDE THE MEASUREMENT OF BUSINESS TRANSACTIONS, WITH A MORE SIGNIFICANT FOCUS ON THE INCOME STATEMENT (CHAPTER 5 - 7)./N/NBLOCK 3/NPART 2 - ACCOUNTING PRINCIPLES AND TREATMENTS - USED TO GUIDE THE MEASUREMENT OF BUSINESS TRANSACTIONS, WITH A MORE SIGNIFICANT FOCUS ON THE INCOME STATEMENT (CHAPTER 8 - 10)./NSTATEMENT OF CASH FLOW - CHANGE IN ANNUAL CASH POSITION (CHAPTER 11).", "Textbook(s)": "REQUIRED MATERIALS/N/N/N/N/N/N1.   TEXTBOOK: FINANCIAL ACCOUNTING: MAKING THE CONNECTION, 1ST EDITION (2012), UCF CUSTOM EDITION. /N/N/N/N/N/NAUTHORS: SPICELAND, THOMAS, AND HERRMANN. PUBLISHER: MCGRAW-HILL (ISBN #9781259704277)./N/N/N/N/N/N2.   HOMEWORK WEBSITE ACCESS: WEBSITE ACCESS FOR HOMEWORK ASSIGNMENTS THROUGH MCGRAW HILLS /NWEBSITE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}