{"Course ID": "203485", "Institution": "EFSC - EASTERN FLORIDA STATE COLLEGE", "Course Name": "ACG 3024 - ACCOUNTING FOR MANAGERS", "Course Title": "ACCOUNTING FOR MANAGERS", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "ACCTG: MANAGERS & INVESTORS(NON-MAJORS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2013", "Effective Date": "05/02/2022", "Discontinue Date": "", "Date SCNS Approved": "5/20/2013", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "NONE", "Corequisites": "NONE", "Course Description": "THIS COURSE ADDRESSES THE USE OF ACCOUNTING INFORMATION BY NON-FINANCIAL MANAGERS. EMPHASIS IS PLACED ON THE INTERPRETATION OF ACCOUNTING INFORMATION IN ORDER FOR A MANAGER TO PARTICIPATE EFFECTIVELY IN DECISION MAKING. CONCEPTS INTRODUCED INCLUDE THE ACCOUNTING CYCLE, ACCOUNTING FOR MERCHANDISERS, CASH AND INTERNAL CONTROL, RECEIVABLES AND INVENTORY CONTROL, LONG-TERM ASSETS AND DEPRECIATION, RATIO ANALYSIS, BREAKEVEN AND COST-VOLUME PROFIT, BUDGETING, COST PLANNING AND CONTROL, AND CAPITAL BUDGETING.", "Objectives / Learning Outcome(s) / Major Topics": "1. EXPLAIN BASIC CONCEPTS OF FINANCIAL ACCOUNTING  (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING\n1.A. EXPLAIN THE ROLE OF ACCOUNTING IN SOCIETY \n1.B. EXPLORE REPORTING ENTITIES \n1.C.  EXPLAIN ELEMENTS OF THE ACCOUNTING EQUATION \n1.D. INTERPRET INFORMATION SHOWN IN THE ACCOUNTING EQUATION \n1.E. CLASSIFY BUSINESS EVENTS AS ASSET SOURCE, USE, OR EXCHANGE TRANSACTIONS \n1.F. PREPARE AN INCOME STATEMENT, BALANCE SHEET, AND STATEMENT OF CASH FLOWS USING ADJUSTED TRIAL BALANCE INFORMATION\n1.G. DISTINGUISH BETWEEN PERMANENT AND TEMPORARY ACCOUNTS\n1.H. RECORD BUSINESS EVENTS USING HORIZONTAL FINANCIAL STATEMENTS MODEL \n\n2. EXPLORE THE ACCOUNTING CYCLE  (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING\nLEARNING OBJECTIVES\n2.A. LIST ACCOUNTING CYCLE STEPS\n2.B. EXPLAIN ACCRUALS AND DEFERRALS \n2.C. EXPLAIN EFFECT OF RECEIVABLES AND PAYABLES ON FINANCIAL STATEMENTS\n2.D. EXPLAIN EFFECT OF SUPPLIES AND OTHER PREPAID ITEMS ON FINANCIAL STATEMENTS\n2.E. EXPLAIN EFFECT OF UNEARNED REVENUES ON FINANCIAL STATEMENTS \n2.F. PREPARE FINANCIAL STATEMENTS THAT INCLUDE ACCRUALS AND DEFERRALS \n\n3. EXPLORE ACCOUNTING FOR MERCHANDISING BUSINESSES  (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING \n3.A. EXPLORE INVENTORY TRANSACTIONS USING PERPETUAL INVENTORY SYSTEM\n3.B. EXPLAIN EFFECT OF PURCHASE RETURNS AND ALLOWANCES ON FINANCIAL STATEMENTS\n3.C. EXPLAIN EFFECT OF PURCHASE DISCOUNTS ON FINANCIAL STATEMENTS \n3.D. EXPLAIN EFFECT OF TRANSPORTATION COSTS ON FINANCIAL STATEMENTS \n3.E. PREPARE A SINGLE-STEP INCOME STATEMENT \n3.F. PREPARE A MULTIPLE-STEP INCOME STATEMENT \n\n4. EXPLAIN INTERNAL CONTROLS AND ETHICS IN ACCOUNTING FOR CASH (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING\nLEARNING OBJECTIVES\n4.A. IDENTIFY KEY ELEMENTS OF A STRONG INTERNAL CONTROL SYSTEM\n4.B. EXPLAIN IMPORTANCE OF CASH CONTROL IN AN ORGANIZATION \n4.C. PREPARE A BANK RECONCILIATION\n4.D. DISCUSS ROLE OF ETHICS IN FINANCIAL REPORTING\n4.E. DESCRIBE INDEPENDENT AUDITOR'S ROLE IN FINANCIAL REPORTING \n\n5. EXPLAIN IMPORTANCE OF RECEIVABLES AND INVENTORY COST FLOW (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\n5.A. EXAMINE ALLOWANCE METHOD AND ITS EFFECT ON FINANCIAL STATEMENTS \n5.B. DETERMINE UNCOLLECTIBLE ACCOUNTS EXPENSE USING PERCENT OF REVENUE METHOD \n5.C. DETERMINE UNCOLLECTIBLE ACCOUNTS EXPENSE USING PERCENT OF RECEIVABLES METHOD\n5.D. DETERMINE UNCOLLECTIBLE ACCOUNTS EXPENSE BY AGING ACCOUNTS RECEIVABLE \n5.E. EXPLAIN EFFECT OF NOTES RECEIVABLE AND ACCRUED INTEREST ON FINANCIAL STATEMENTS \n5.F.  EXPLORE EFFECT OF CREDIT CARD SALES ON FINANCIAL STATEMENTS \n5.G. CALCULATE INVENTORY USING SPECIFIC IDENTIFICATION, FIRST IN, FIRST OUT (FIFO), LAST IN, FIRST OUT (LIFO), AND WEIGHTED AVERAGE METHODS\n\n6. EXPLAIN ACCOUNTING FOR LONG-TERM ASSETS (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING\nLEARNING OBJECTIVES\n6.A. DETERMINE COST OF LONG-TERM OPERATIONAL ASSETS\n6.B. EXPLAIN ACCUMULATED DEPRECIATION \n6.C. CALCULATE STRAIGHT-LINE DEPRECIATION EXPENSE\n6.D. CALCULATE DOUBLE-DECLINING BALANCE DEPRECIATION EXPENSE\n6.E. CALCULATE UNITS-OF-PRODUCTION DEPRECIATION EXPENSE\n6.F. EXPLAIN EFFECT OF DIFFERENT DEPRECIATION METHODS ON BOOK VALUE \n6.G. EXPLAIN EFFECT OF REVISING DEPRECIATION ESTIMATES \n6.H. EXPLORE CAPITAL EXPENDITURES AND REVENUE EXPENDITURES \n6.I. EXPLORE INTANGIBLE ASSETS AND AMORTIZATION EXPENSE \n6.J. EXPLORE NATURAL RESOURCES AND DEPLETION EXPENSE  \n\n7. EXPLORE ACCOUNTING FOR LIABILITIES (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\n7.A. DISTINGUISH BETWEEN CURRENT LIABILITIES AND LONG-TERM LIABILITIES \n7.B. DEFINE CONTINGENT LIABILITIES \n7.C. DEFINE WARRANTY OBLIGATIONS AND INSTALLMENT NOTES \n7.D. DEFINE BONDS PAYABLE\n7.E. CONTRAST BONDS ISSUED AT FACE VALUE, PREMIUM, AND AT DISCOUNT \n7.F. CALCULATE BOND INTEREST EXPENSE USING STRAIGHT LINE AMORTIZATION\n7.G. PREPARE A CLASSIFIED BALANCE SHEET\n\n8. EXPLORE PROPRIETORSHIPS, PARTNERSHIPS, AND CORPORATIONS IN TODAY'S BUSINESS ENVIRONMENT (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\n8.A. IDENTIFY PRIMARY CHARACTERISTICS OF PROPRIETORSHIPS, PARTNERSHIPS, AND CORPORATIONS\n8.B. EXPLAIN CHARACTERISTICS OF CAPITAL STOCK \n8.C. DIFFERENTIATE BETWEEN COMMON AND PREFERRED STOCK \n8.D. EXPLAIN EFFECT OF PAYING CASH DIVIDENDS ON FINANCIAL STATEMENTS\n8.E. EXPLAIN EFFECT OF STOCK DIVIDENDS ON FINANCIAL STATEMENTS\n8.F.  EXPLAIN EFFECT OF STOCK SPLITS ON FINANCIAL STATEMENTS \n8.G. EXPLAIN EFFECT OF TREASURY STOCK TRANSACTIONS ON STOCKHOLDERS' EQUITY\n\n9. EXAMINE FINANCIAL STATEMENTS USING RATIO ANALYSIS  (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\nLINKED CORE ABILITIES: THINK CRITICALLY AND SOLVE PROBLEMS\n9.A. DIFFERENTIATE BETWEEN HORIZONTAL AND VERTICAL ANALYSIS \n9.B. CALCULATE LIQUIDITY RATIOS \n9.C. CALCULATE SOLVENCY RATIOS\n9.D. CALCULATE PROFITABILITY RATIOS\n9.E. INTERPRET LIQUIDITY, SOLVENCY, AND PROFITABILITY RATIOS \n\n10. EXPLAIN CONCEPTS ASSOCIATED WITH MANAGERIAL ACCOUNTING  (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\n10.A. CONTRAST MANAGERIAL AND FINANCIAL ACCOUNTING\n10.B. DIFFERENTIATE BETWEEN DIRECT COSTS AND INDIRECT COSTS OF A MANUFACTURED PRODUCT\n10.C. DEFINE DIRECT MATERIALS, DIRECT LABOR, AND FACTORY OVERHEAD \n10.D. DEFINE GENERAL, SELLING, AND ADMINISTRATIVE COSTS ASSOCIATED WITH A MANUFACTURED PRODUCT\n10 E. CONTRAST PRODUCT COSTS WITH PERIOD COSTS \n10.F. CONTRAST UPSTREAM, MIDSTREAM AND DOWNSTREAM COSTS IN MANUFACTURING, SERVICE, AND MERCHANDISING COMPANIES \n10.G. PREPARE A SCHEDULE OF COST OF GOODS MANUFACTURED AND SOLD \n10.H. EXPLAIN JUST-IN-TIME INVENTORY \n10.I. EXPLORE PROFESSIONAL ETHICS IN MANAGERIAL ACCOUNTING \n\n11. EXPLORE COST BEHAVIOR, OPERATING LEVERAGE, AND PROFITABILITY ANALYSIS (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING\n11.A. DESCRIBE FIXED, VARIABLE, AND MIXED COST BEHAVIOR \n11.B. DEMONSTRATE EFFECT OF OPERATING LEVERAGE ON PROFITABILITY\n11.C. GRAPH TOTAL FIXED COST AND FIXED COST PER UNIT\n11.D. GRAPH TOTAL VARIABLE COST AND VARIABLE COST PER UNIT \n11.E. EXPLAIN CONTRIBUTION MARGIN AND CONTRIBUTION MARGIN PERCENTAGE \n11.F. CALCULATE BREAK-EVEN POINT IN UNITS AND SALES DOLLARS \n11.G. CALCULATE SALES VOLUME REQUIRED TO ATTAIN TARGET PROFIT IN UNITS AND SALES DOLLARS \n11.H. CALCULATE MARGIN OF SAFETY IN UNITS, DOLLARS, AND PERCENTAGE\n\n12. EXAMINE COST ACCUMULATION, TRACING, AND ALLOCATION  (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING\n12.A. EXPLORE COST OBJECTS AND COST DRIVERS \n12.B. COMPARE DIRECT COSTS WITH INDIRECT COSTS \n12.C. ALLOCATE INDIRECT COSTS TO COST OBJECTS\n12.D. EXPLAIN COST DRIVER SELECTION PROCESS  \n\n13. EXPLORE RELEVANT INFORMATION FOR DECISION MAKING (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\n13.A. EXPLAIN CHARACTERISTICS OF RELEVANT INFORMATION \n13.B. EXPLAIN SUNK COSTS AND OPPORTUNITY COSTS \n13.C. EXPLORE SPECIAL ORDER DECISIONS IN MANUFACTURING  \n13.D. EXPLORE OUTSOURCING DECISIONS IN MANUFACTURING \n13.E. EXPLORE SEGMENT ELIMINATION DECISIONS \n13.F. EXPLORE ASSET REPLACEMENT DECISIONS \n\n14. EXPLORE PROFIT PLANNING AND COST CONTROL (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL CREATING\n14.A. DESCRIBE ORGANIZATIONAL BUDGETING PROCESSES \n14.B. PREPARE A SALES BUDGET AND SCHEDULE OF CASH RECEIPTS \n14.C. PREPARE AN INVENTORY PURCHASES BUDGET AND RELATED SCHEDULE OF CASH PAYMENTS\n14.D. PREPARE A SELLING AND ADMINISTRATIVE EXPENSE BUDGET, AND RELATED SCHEDULE OF CASH PAYMENTS\n14.E. PREPARE A CASH BUDGET \n14.F. PREPARE A PRO FORMA INCOME STATEMENT, BALANCE SHEET, AND STATEMENT OF CASH FLOW\n\n15. EXPLORE PERFORMANCE EVALUATION (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL EVALUATING\n15.A. DESCRIBE CONCEPT OF DECENTRALIZATION \n15.B.DESCRIBE BUDGETING PROCESS IN AN ORGANIZATION \n15.C. DISTINGUISH BETWEEN FLEXIBLE AND STATIC BUDGETS \n15.D. CLASSIFY VARIANCES AS FAVORABLE AND UNFAVORABLE\n15.E. EXPLORE SALES AND VARIABLE COST VOLUME VARIANCES\n15.F.  EXPLORE FLEXIBLE BUDGET VARIANCES \n15.G. EVALUATE INVESTMENTS USING RETURN ON INVESTMENT CALCULATIONS\n15.H. EVALUATE INVESTMENTS USING RESIDUAL INCOME CALCULATIONS \n\n16. EXAMINE PLANNING FOR CAPITAL INVESTMENTS (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL EVALUATING\n16.A. EXPLAIN TIME VALUE OF MONEY CONCEPT \n16.B. DETERMINE PAYBACK PERIOD AND ACCOUNTING RATE OF RETURN FOR INVESTMENT ALTERNATIVES \n16.C. DETERMINE NET PRESENT VALUE AND INTERNAL RATE OF RETURN OF INVESTMENT ALTERNATIVES  \n16.D. COMPARE CAPITAL INVESTMENT ALTERNATIVES USING PAYBACK, UNADJUSTED RATE OF RETURN, INTERNAL RATE OF RETURN, AND NET PRESENT VALUE", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}