{"Course ID": "217385", "Institution": "EFSC - EASTERN FLORIDA STATE COLLEGE", "Course Name": "ACG 3041 - APPLIED FINANCIAL ACCOUNTING", "Course Title": "APPLIED FINANCIAL ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "APPLIED FINANCIAL ACCOUNTING", "Lab Code": " ", "Honors Course": "NO", "Add Date": "01/01/2017", "Effective Date": "05/02/2022", "Discontinue Date": "", "Date SCNS Approved": "10/5/2016", "Term Type": "SEMESTER", "Course Credits": "3", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 2021, AND ACG 2100 WITH A GRADE OF \"C\" OR HIGHER", "Corequisites": "ACG 2071", "Course Description": "THIS COURSE REVIEWS FINANCIAL STATEMENTS AND FURTHER EXAMINES FINANCIAL ACCOUNTING STANDARDS WITH EMPHASIS ON REPORTING CASH, SHORT-TERM INVESTMENTS, RECEIVABLES, INVENTORIES, CAPITAL ASSETS, CURRENT LIABILITIES, CONTINGENCIES, BONDS, LEASES, PENSIONS, AND STOCKHOLDERS EQUITY.", "Objectives / Learning Outcome(s) / Major Topics": "1. EXPLORE THE STRUCTURE OF FINANCIAL ACCOUNTING (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING \n1.A. EXAMINE THE OBJECTIVE OF GENERAL PURPOSE FINANCIAL REPORTING\n1.B. EXPLORE THE ROLE OF THE FINANCIAL ACCOUNTING STANDARDS BOARD (FASB) IN SETTING ACCOUNTING STANDARDS\n1.C. EXPLORE THE ROLE OF THE SECURITIES AND EXCHANGE COMMISSION (SEC) IN SETTING ACCOUNTING STANDARDS\n1.D. OUTLINE THE ROLE OF THE INTERNATIONAL ACCOUNTING STANDARDS BOARD (IASB) IN SETTING INTERNATIONAL ACCOUNTING STANDARDS\n1.E. EXAMINE GENERALLY ACCEPTED ACCOUNTING PRINCIPLES (GAAP)\n1.F. SUMMARIZE THE FOUR BASIC FINANCIAL STATEMENTS (INCOME STATEMENT, RETAINED EARNINGS STATEMENT, BALANCE SHEET, AND STATEMENT OF CASH FLOWS)\n1.G. EXAMINE THE MAJOR ASSUMPTIONS OF FINANCIAL REPORTING\n1.H. EXPLAIN THE QUALITATIVE CHARACTERISTICS OF DECISION-USEFUL INFORMATION\n1.I. DESCRIBE THE RECOGNITION, MEASUREMENT AND DISCLOSURE CONCEPTS THAT GUIDE ACCOUNTING PRACTICE\n\n2.EXPLORE THE ACCOUNTING PROCESS (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING \n2.A. SUMMARIZE RULES OF DEBITS AND CREDITS\n2.B. CONTRAST ACCRUAL BASIS ACCOUNTING WITH CASH BASIS ACCOUNTING\n2.C. OUTLINE STEPS IN THE ACCOUNTING CYCLE\n2.D. SUMMARIZE GENERAL JOURNAL ENTRIES\n2.E. SUMMARIZE ADJUSTING JOURNAL ENTRIES\n2.F. PRODUCE INCOME STATEMENT, BALANCE SHEET, AND RETAINED EARNINGS STATEMENT\n2.G. EXPLAIN PURPOSE AND STEPS INVOLVED IN THE CLOSING PROCESS\n\n3. EXAMINE BALANCE SHEET AND FINANCIAL DISCLOSURES (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING \n3.A. SUMMARIZE PURPOSE AND USEFULNESS OF THE BALANCE SHEET\n3.B. EXPLORE ASSET, LIABILITY, AND EQUITY CLASSIFICATIONS\n3.C. EXPLAIN PURPOSE OF FINANCIAL STATEMENT DISCLOSURES\n3.D. OUTLINE PURPOSE OF THE AUDIT AND THE AUDIT REPORT\n\n4. EVALUATE THE INCOME STATEMENT AND STATEMENT OF CASH FLOWS  (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL EVALUATING \nLEARNING OBJECTIVES\n4.A. CRITIQUE SINGLE-STEP AND MULTIPLE-STEP INCOME STATEMENTS\n4.B. SUMMARIZE COMPONENTS OF INCOME FROM CONTINUING OPERATIONS\n4.C. ANALYZE DISCONTINUED OPERATIONS AND ITS INCOME STATEMENT PRESENTATION\n4.D. ASSESS EARNINGS PER SHARE AND REQUIRED EARNINGS PER SHARE DISCLOSURES\n4.E. APPRAISE NET INCOME AND COMPREHENSIVE INCOME\n4.F. CRITIQUE STATEMENT OF CASH FLOWS (DIRECT AND INDIRECT METHODS)\n4.G. ANALYZE COMPONENTS OF CASH FLOW FROM OPERATING ACTIVITIES\n4.H. ANALYZE COMPONENTS OF CASH FLOW FROM INVESTING ACTIVITIES\n4.I. ANALYZE COMPONENTS OF CASH FLOW FROM FINANCING ACTIVITIES\n4.J. SUMMARIZE NON-CASH INVESTING AND FINANCING ACTIVITIES\n\n5. EXPLORE REVENUE RECOGNITION AND PROFITABILITY ANALYSIS (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING\nLEARNING OBJECTIVES\n5.A. SUMMARIZE THE RECOGNITION, MEASUREMENT, AND DISCLOSURE CONCEPTS THAT GUIDE ACCOUNTING PRACTICE\n5.B. EXPLORE REVENUE RECOGNITION AT A SINGLE POINT IN TIME\n5.C. EXPLORE REVENUE RECOGNITION OVER A PERIOD OF TIME\n5.D. EXAMINE VARIABLE CONSIDERATION AND OTHER ASPECTS OF CONTRACTS THAT AFFECT THE CALCULATION AND ALLOCATION OF THE TRANSACTION PRICE\n5.E. CONTRAST THE PERCENTAGE-OF-COMPLETION AND COMPLETED CONTRACT METHODS FOR LONG-TERM CONTRACTS\n5.F. SUMMARIZE THE TIMING OF REVENUE RECOGNITION WITH RESPECT TO LICENSES, FRANCHISES, AND OTHER COMMON ARRANGEMENTS\n5.G. OUTLINE DISCLOSURES REQUIRED FOR REVENUE RECOGNITION, ACCOUNTS RECEIVABLE, CONTRACT ASSETS, AND CONTRACT LIABILITIES\n5.H. CALCULATE THE COMMON RATIOS USED TO ASSESS PROFITABILITY\n\n6. EXAMINE TIME VALUE OF MONEY CONCEPTS (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING\n6.A. DISTINGUISH BETWEEN SIMPLE INTEREST AND COMPOUND INTEREST\n6.B. CALCULATE FUTURE VALUE OF A SINGLE AMOUNT\n6.C. CALCULATE PRESENT VALUE OF A SINGLE AMOUNT\n6.D. CALCULATE INTEREST RATE USING PRESENT VALUE AND FUTURE VALUE OF A SINGLE AMOUNT\n6.E. DISTINGUISH BETWEEN AN ORDINARY ANNUITY AND AN ANNUITY DUE\n6.F. CALCULATE FUTURE VALUE OF AN ORDINARY ANNUITY\n6.G. CALCULATE PRESENT VALUE OF AN ANNUITY DUE\n\n7.EXAMINE CASH AND RECEIVABLES (LECTURE 3 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING\n7.A. EXAMINE KEY ELEMENTS NECESSARY FOR INTERNAL CONTROL OF CASH\n7.B. DISTINGUISH BETWEEN GROSS AND NET METHODS OF ACCOUNTING FOR CASH DISCOUNTS\n7.C. EXPLAIN ACCOUNTING TREATMENT FOR MERCHANDISE RETURNS\n7.D. COMPARE DIRECT WRITE-OFF WITH ALLOWANCE METHOD OF ACCOUNTING FOR BAD DEBTS\n7.E. SUMMARIZE PERCENTAGE OF SALES METHOD FOR ESTIMATING BAD DEBTS\n7.F. SUMMARIZE AGING ANALYSIS METHOD FOR ESTIMATING BAD DEBTS\n7.G. EXAMINE ACCOUNTING TREATMENT OF SHORT-TERM NOTES RECEIVABLE\n7.H. DIFFERENTIATE BETWEEN RECEIVABLES ACCOUNTED FOR AS SECURED BORROWING AND THOSE ACCOUNTED FOR AS A SALE\n\n8. EXPLORE INVENTORY METHODS AND MEASUREMENT (LECTURE 4 HOURS)\nDOMAIN COGNITIVE LEVEL ANALYZING\nLINKED CORE ABILITIES:  THINK CRITICALLY AND SOLVE PROBLEMS\n8.A. DIFFERENTIATE BETWEEN PERPETUAL AND PERIODIC INVENTORY SYSTEMS\n8.B. APPRAISE EXPENDITURES INCLUDED IN THE COST OF INVENTORY\n8.C. CALCULATE ENDING INVENTORY AND COST OF GOODS SOLD USING SPECIFIC IDENTIFICATION, FIRST-IN-FIRST-OUT (FIFO), LAST-IN-FIRST-OUT (LIFO), AND AVERAGE COST METHODS\n8.D. EXAMINE FACTORS AFFECTING A COMPANY'S CHOICE OF INVENTORY METHOD\n8.E. COMPUTE ENDING INVENTORY AND COST OF GOODS SOLD USING THE GROSS PROFIT METHOD\n8.F. EXAMINE THE LOWER-OF-COST-OR-MARKET RULE FOR VALUING INVENTORIES\n8.G. COMPUTE ENDING INVENTORY AND COST OF GOODS SOLD USING THE AVERAGE RETAIL COST METHOD\n8.H. DETERMINE ENDING INVENTORY USING THE DOLLAR-VALUE LIFO METHOD\n8.I. EXAMINE SUPPLEMENTAL LIFO DISCLOSURES AND THE EFFECT OF LIFO LIQUIDATIONS ON NET INCOME\n\n9. EXPLORE ACCOUNTING FOR CAPITAL ASSETS (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\nLEARNING OBJECTIVES\n9.A. OUTLINE VARIOUS COSTS INCLUDED IN THE INITIAL COST OF CAPITAL ASSETS (PROPERTY, PLANT, AND EQUIPMENT, NATURAL RESOURCES AND INTANGIBLE ASSETS)\n9.B. ALLOCATE INITIAL COST OF INDIVIDUAL PROPERTY, PLANT, AND EQUIPMENT ACQUIRED AS A GROUP FOR A LUMP-SUM PURCHASE PRICE\n9.C. DETERMINE ITEMS INCLUDED IN THE COST OF A SELF-CONSTRUCTED CAPITAL ASSET\n9.D. CALCULATE AMOUNT OF CAPITALIZED INTEREST RECORDED USING THE SPECIFIC INTEREST METHOD\n9.E. CONTRAST THE ACCOUNTING TREATMENT FOR PURCHASED INTANGIBLE ASSETS WITH INTERNALLY DEVELOPED INTANGIBLES\n9.F. OUTLINE ACCOUNTING FOR NATURAL RESOURCES\n\n10.EVALUATE UTILIZATION AND IMPAIRMENT OF CAPITAL ASSETS (LECTURE 4 HOURS)\nDOMAIN COGNITIVE LEVEL EVALUATING\n10.A. ASSESS RELATIONSHIP BETWEEN COST ALLOCATION AND CAPITAL ASSETS (PROPERTY, PLANT AND EQUIPMENT, NATURAL RESOURCES, AND INTANGIBLE ASSETS)\n10.B. CONTRAST PERIODIC DEPRECIATION USING STRAIGHT-LINE, UNITS OF PRODUCTION, AND DECLINING BALANCE METHODS\n10.C. CRITIQUE PERIODIC DEPLETION OF A NATURAL RESOURCE\n10.D. CRITIQUE PERIODIC AMORTIZATION OF AN INTANGIBLE ASSET\n10.E. ASSESS ACCOUNTING TREATMENT REQUIRED FOR CHANGES IN THE RESIDUAL VALUE OF CAPITAL ASSETS\n10.F. EVALUATE ACCOUNTING TREATMENT REQUIRED FOR CHANGES IN THE SERVICE LIFE OF CAPITAL ASSETS\n10.G. ASSESS ACCOUNTING TREATMENT OF REPAIRS AND MAINTENANCE, ADDITIONS, IMPROVEMENTS, AND REARRANGEMENTS TO CAPITAL ASSETS\n\n11.OUTLINE ACCOUNTING FOR INVESTMENTS IN DEBT AND EQUITY SECURITIES (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\n11.A. SUMMARIZE ACCOUNTING FOR INVESTMENTS CLASSIFIED FOR REPORTING PURPOSES AS TRADING SECURITIES\n11.B. OUTLINE ACCOUNTING FOR INVESTMENTS CLASSIFIED FOR REPORTING PURPOSES AS HELD-TO-MATURITY\n11.C. EXPLAIN ROLE OF INVESTOR'S SIGNIFICANT INFLUENCE OVER OPERATING AND FINANCIAL POLICIES OF THE INVESTEE\n11.D. EXAMINE EQUITY METHOD OF ACCOUNTING FOR INVESTMENTS\n\n12. EXAMINE ACCOUNTING FOR CURRENT LIABILITIES AND CONTINGENCIES (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\n12.A. DISTINGUISH BETWEEN CURRENT AND LONG-TERM LIABILITIES\n12.B. SUMMARIZE JOURNAL ENTRIES FOR ISSUANCE AND REPAYMENT OF NOTES PAYABLE\n12.C. SUMMARIZE JOURNAL ENTRIES FOR RECORDING INTEREST ON NOTES PAYABLE\n12.D. EXPLAIN ACCOUNTING TREATMENT FOR BONUSES, ACCRUED VACATION PAY, AND SICK LEAVE\n12.E. SUMMARIZE JOURNAL ENTRIES FOR RECORDING LIABILITIES FROM ADVANCE COLLECTION\n12.F. EXPLORE ACCOUNTING PROCEDURES FOR WARRANTIES AND EXTENDED WARRANTY CONTRACTS\n12.G. OUTLINE ACCOUNTING PROCEDURES FOR LITIGATION CONTINGENCIES\n12.H. OUTLINE ACCOUNTING PROCEDURES FOR UNASSERTED CLAIMS AND ASSESSMENTS\n\n13.EXAMINE ACCOUNTING FOR BONDS AND LONG-TERM NOTES (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\n13.A. OUTLINE THE MAIN CHARACTERISTICS OF DEBT INSTRUMENTS\n13.B. SUMMARIZE JOURNAL ENTRIES FOR BONDS ISSUED AT PAR VALUE\n13.C. SUMMARIZE JOURNAL ENTRIES FOR BONDS ISSUED AT A DISCOUNT USING THE EFFECTIVE INTEREST METHOD\n13.D. SUMMARIZE JOURNAL ENTRIES FOR BONDS ISSUED AT A PREMIUM USING THE EFFECTIVE INTEREST METHOD\n13.E. OUTLINE ACCOUNTING TREATMENT USED FOR LONG-TERM NOTES\n13.F. SUMMARIZE LONG-TERM DEBT DISCLOSURES\n\n14. EXAMINE ACCOUNTING FOR LEASES AND PENSIONS (LECTURE 4 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\n14.A. SUMMARIZE CRITERIA AND CONDITIONS USED TO CLASSIFY LEASES\n14.B. EXPLAIN ACCOUNTING FOR A CAPITAL LEASE BY A LESSOR\n14.C. EXPLAIN ACCOUNTING FOR A CAPITAL LEASE BY A LESSEE\n14.D. OUTLINE ACCOUNTING FOR A SALES-TYPE LEASE\n14.E. CONTRAST DEFINED CONTRIBUTION PENSION PLANS WITH DEFINED BENEFIT PENSION PLANS\n14.F. DISTINGUISH BETWEEN VESTED BENEFIT OBLIGATION, ACCUMULATED BENEFIT OBLIGATION, AND THE PROJECTED BENEFIT OBLIGATION (PBO)\n14.G. EXPLAIN THE TRUSTEE'S ROLE IN PENSION FUND ADMINISTRATION\n14.H. OUTLINE FINANCIAL STATEMENT PRESENTATION FOR PENSION PLANS\n\n15. EXAMINE ACCOUNTING FOR STOCKHOLDERS' EQUITY (LECTURE 3 HOURS) \nDOMAIN COGNITIVE LEVEL ANALYZING\n15.A. COMPARE THE CORPORATE FORM OF ORGANIZATION WITH SOLE PROPRIETORSHIPS AND PARTNERSHIPS\n15.B. EXPLAIN AUTHORIZED, ISSUED, AND OUTSTANDING STOCK\n15.C. CONTRAST COMMON STOCK WITH PREFERRED STOCK\n15.D. SUMMARIZE JOURNAL ENTRIES FOR STOCK ISSUANCE\n15.E. SUMMARIZE JOURNAL ENTRIES FOR CASH DIVIDENDS AND STOCK DIVIDENDS\n15. F. EXPLAIN ACCOUNTING FOR STOCK DIVIDENDS AND TREASURY STOCK\n15.G. ANALYZE ELEMENTS INCLUDED IN THE STOCKHOLDERS' EQUITY SECTION", "Textbook(s)": "NONE", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}