{"Course ID": "125477", "Institution": "FAU - FLORIDA ATLANTIC UNIVERSITY", "Course Name": "ACG 3141 - INTERMEDIATE THEORY 2", "Course Title": "INTERMEDIATE THEORY 2", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "3", "Statewide Course": "ACCOUNTING APPLICATIONS", "Lab Code": " ", "Honors Course": "NO", "Add Date": "", "Effective Date": "01/02/2013", "Discontinue Date": "", "Date SCNS Approved": "5/5/2003", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "PRE OR COREQUISITES: ACG 3131 AND ENC 3213 OR GEB 3213 WITH GRADES OF \"C\" OR BETTER.", "Corequisites": "NONE", "Course Description": "A CONTINUATION OF ACG 3131. AN IN-DEPTH STUDY OF ACCOUNTING TRANSACTIONS, THEIR EFFECT ON FINANCIAL STATEMENTS AND THE IMPACT THAT MANAGEMENT DECISIONS HAVE ON FINANCIAL STATEMENTS.", "Objectives / Learning Outcome(s) / Major Topics": "1-ANALYZE ACCOUNTING TRANSACTIONS TO DETERMINE THEIR EFFECT ON THE STATEMENT OF CASH FLOWS, IF ANY, AND PROPERLY CATEGORIZE THE TRANSACTIONS AS OPERATING, INVESTING, FINANCING OR NON-CASH INVESTING AND FINANCING ACTIVITIES WHEN PREPARING THE STATEMENT OF CASH FLOW. THE FOCUS WILL BE ON THE DIRECT METHOD OF REPORTING CASH FLOWS, WITH A BASIC REVIEW OF THE INDIRECT METHOD.\n\n2-DETERMINE HOW TO PROPERLY ACCOUNT FOR THE ACQUISITION, DISPOSITION, AND EXCHANGES OF ASSETS, INCLUDING SELF-CONSTRUCTED ASSETS. OBTAIN A BASIC UNDERSTANDING OF COSTS THAT QUALIFY AS RESEARCH AND DEVELOPMENT EXPENSE.\n\n3-CALCULATE DEPRECIATION AND AMORTIZATION USING DIFFERENT COST ALLOCATION METHODS. ALSO, ADDITIONAL ISSUES PERTAINING TO UTILIZATION AND IMPAIRMENT OF ASSETS WILL BE ADDRESSED.\n\n4-OBTAIN AN UNDERSTANDING OF LONG-TERM DEBT WITH THE FOCUS ON BONDS. CALCULATE THE SELLING PRICE OF BONDS AND PREPARE AMORTIZATION SCHEDULES. OBTAIN KNOWLEDGE OF THE FINANCIAL STATEMENT PRESENTATION AND DISCLOSURES FOR BONDS. ANALYZE HOW TO ACCRUE INTEREST WHEN FINANCIAL STATEMENTS ARE PREPARED BETWEEN INTEREST DATES.\n\n5-DETERMINE HOW TO ACCOUNT FOR DEBT WHEN IT IS RETIRED EARLY. ALSO DETERMINE HOW TO ACCOUNT FOR DEBT THAT CAN BE CONVERTED INTO STOCK OR CONTAINS AN OPTION TO PURCHASE STOCK.", "Textbook(s)": "SPICELAND, SEPE, & NELSON. INTERMEDIATE ACCOUNTING. 6TH ED. IRWIN/MCGRAW-HILL, 2011.\n \nMAY & MAY. EFFECTIVE WRITING: A HANDBOOK FOR ACCOUNTANTS. 9TH ED. PRENTICE HALL. \n\nWILEY CPA EXAM REVIEW 2012, FINANCIAL ACCOUNTING AND REPORTING. PATRICK R, DELANEY , O. RAY WHITTINGTON. ISBN: 978-0-470-92392-4", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}