{"Course ID": "163993", "Institution": "FAU - FLORIDA ATLANTIC UNIVERSITY", "Course Name": "ACG 4501 - GOVERNMENT AND NOT-FOR-PROFIT ACCOUNTING", "Course Title": "GOVERNMENT AND NOT-FOR-PROFIT ACCOUNTING", "Discipline": "165 - ACCOUNTING", "Prefix": "ACG - ACCOUNTING: GENERAL", "Level": "4", "Statewide Course": "GOV & INSTITUTIONAL ACC (3 CREDITS)", "Lab Code": " ", "Honors Course": "NO", "Add Date": "08/01/2009", "Effective Date": "08/01/2013", "Discontinue Date": "", "Date SCNS Approved": "1/9/2009", "Term Type": "SEMESTER", "Course Credits": "3.0", "Type of Credit": "COLLEGE CREDIT", "Clock Hours": "", "Course Status": "ACTIVE", "General Education Core": " ", "General Education Requirements": " ", "Rule 6A-10.030": "NO", "Rule 6A-10.030 Writing": "NO", "Degree Type": "BACCALAUREATE", "Prerequisites": "ACG 3141 AND ACG 3341 WITH GRADES OF \"C\" OR BETTER", "Corequisites": "NONE", "Course Description": "AN ADVANCED-LEVEL STUDY OF ACCOUNTING AND FINANCIAL REPORTING FOR STATE AND LOCAL GOVERNMENTS. PROVIDES A DETAILED REVIEW OF THE ACCOUNTING AND FINANCIAL REPORTING STANDARDS PROMULGATED BY THE AUTHORITATIVE BODY (GASB) INFLUENCING THE ACCOUNTING AND REPORTING FOR STATE AND LOCAL GOVERNMENTAL ENTITIES. COVERS FUND ACCOUNTING CONCEPTS AND PRACTICES AS WELL AS GOVERNMENT-WIDE FINANCIAL REPORTING SIMILAR TO PRIVATE BUSINESS CONSOLIDATED REPORTING AND THE RELATIONSHIPS BETWEEN THE TWO. STUDIES BUDGETING, ACCOUNTING AND REPORTING STANDARDS AND PRACTICES FOR OTHER NOT-FOR-PROFIT ENTITIES.", "Objectives / Learning Outcome(s) / Major Topics": "UPON SUCCESSFUL COMPLETION OF THE COURSE, STUDENTS WILL BE ABLE TO\n1. DESCRIBE THE CURRENT ACCOUNTING STANDARDS FOR STATE AND LOCAL GOVERNMENTS AND NOTPROFIT ENTITIES.\n2. COMPARE THE DIFFERENCES FROM AND SIMILARITIES TO FOR-PROFIT BUSINESSES.\n3. DIFFERENTIATE BETWEEN GOVERNMENTAL FUNDS, PROPRIETARY FUNDS, AND FIDUCIARY FUNDS.\n4. IDENTIFY ENTITIES AFFECTED BY GOVERNMENTAL FINANCIAL TRANSACTIONS AND TRANSLATE THOSE EVENTS INTO GOVERNMENTAL ACCOUNTING, USING DEBITS AND CREDITS.  \n5. CREATE FUND BASIS AND GOVERNMENTAL-WIDE STATEMENTS FOR STATE AND LOCAL GOVERNMENTS, APPLYING APPLICABLE ACCOUNTING STANDARDS. \n6. CREATE NONPROFIT FINANCIAL STATEMENTS APPLYING APPLICABLE ACCOUNTING STANDARDS.\n7. IDENTIFY THE TYPES OF GOVERNMENT REVENUES (EXCHANGE AND NONEXCHANGE) AND WHEN TO RECOGNIZE THEM IN THE FINANCIAL STATEMENTS.\n8. IDENTIFY THE MODIFIED ACCRUAL BASIS OF ACCOUNTING FOR EXPENDITURES AND EXPENSES.\n9. IDENTIFY CAPITAL PROJECTS AND DEBT SERVICE.\n10. DESCRIBE THE ACCOUNTING FOR CAPITAL ASSETS.", "Textbook(s)": "BOOK NAME - GOVERNMENTAL AND NONPROFIT ACCOUNTING, 10/E\n\nEDITION - 10/E\n\nAUTHOR NAME - ROBERT FREEMAN, CRAIG D. SHOULDERS, GREGORY S. ALLISON, G. ROBERT SMITH, JR.\n\nISBN - 10:0132751267 OR 13:9780132751261", "Transfer Status": "GUARANTEED TRANSFER TO INSTITUTION OFFERING SAME COURSE.", "Transaction Type": ""}